[{"id":166,"title":"Announcements + Opening Keynote","body":"","tags":"","level":"","starts_at":"2019-08-21T13:00:00.000Z","ends_at":"2019-08-21T13:45:00.000Z","created_at":"2019-07-27T04:02:49.105Z","updated_at":"2019-07-27T04:06:26.888Z","room":"Ballroom I/II/III","presenter":{"name":"Abstractions"},"url":"https://codeandsupply.co/event_sessions/166.json"},{"id":118,"title":"Who’s Not in the Room: Build better Products by Engaging Hard-To-Reach Users","body":"As technologists, one of the hardest things to remember is that we’re not our users and our biases can easily extend into our work. Without thinking of who we are excluding, we might be building products designed only for people of a specific age, gender, ability and those with specific access to money, time and social network.\r\n\r\nTo make better products, we need our users to give us feedback every step of the way. In this talk, I’ll share what my team and I learned from two different projects where we worked directly with our audiences- busy moms who were raising a child with autism and Gen Zs experiencing various forms of bullying. You’ll learn what types of biases and points of exclusions to watch out for, how to engage hard-to-reach audiences, and how the user-driven insights we gained uncovered the struggles unique to their community and informed our design decisions and product iterations. Whether or not you work in UX design, this talk will help you create tech solutions that are physically, cognitively and emotionally accessible and ultimately valuable for all humans.","tags":"user research, prototyping, inclusive design, products","level":"Beginner","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T14:35:00.000Z","created_at":"2019-06-08T02:03:26.247Z","updated_at":"2019-07-26T02:25:46.828Z","room":"301/302","presenter":{"name":"Ariba Jahan","bio":"As an immigrant Bengali woman that discovered her profound hearing loss at age eight, Ariba focuses on advocating for diverse, marginalized voices that are often overlooked and ensuring we bring humanity into tech. After a varied background including Biomechancial Engineering, engineering research publications, and a stint at medical school, Ariba lead operations and product management for industry-shifting startups. This work and her passion for social impact brought her to the Ad Council as the Director of Innovation, where she’s charged with scaling design thinking and agile practices, creating digital products to create measurable social impact, and exploring future-forward technology for the organization. With over 10 years of experience in user-focused product design and leading workshops for entrepreneurs in global cities, she’s leveraging her life experiences, startup mindset, and scientific approach to create digital products for social good and organizational change, and empower an innovative culture.\r\n\r\nIn her spare time, she teaches high school students UX design, go on adventures (climbing Mt. Kilimanjaro was her favorite), and knit more scarves than she’ll ever need."},"url":"https://codeandsupply.co/event_sessions/118.json"},{"id":69,"title":"By Our Powers Combined: Observability for Developers","body":"The world of maintaining applications is shifting. Our Systems Administrators aren't monitoring our application servers, it's the SREs determining SLIs and SLOs for our Micro-Services and making sure our Cloud-Distributed systems are Observable in near-real time. It's enough for buzzword burnout. Furthermore, the DevOps movement asking developers to work closer with our operations teams and handle on-call shifts! Does that mean you have to learn everything about DevOps and SRE just to keep doing what you truly love, building things out of code? \r\n\r\nNot entirely, but just as SysOps folk have started to learn valuable lessons about codifying their work, so too can developers learn how to build more easily maintainable software from those that have to maintain it every day.\r\n\r\nWithout diving through the whole world of Software Reliability Engineering and systems monitoring, this talk will level set and give a crash course on Observability. Let’s cross-class some Ops with our Dev and build reliable, maintainable software together! \r\n\r\nAttendees will walk away with an understanding of:\r\n- A level-set understanding of Observability so they can collaborate with their colleagues meaningfully.\r\n- How cross-collaboration and a shared language provide for better quality software development\r\n- A handful of ideas to keep in mind during development, to make operating software easier\r\n- Why Developers should be On-Call, too, and the value that provides for both the Ops teams AND for building better software.","tags":"observability, devops, on-call","level":"Beginner","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T14:35:00.000Z","created_at":"2019-06-08T02:03:25.516Z","updated_at":"2019-07-29T00:12:39.414Z","room":"303/304","presenter":{"name":"Aaron Aldrich","bio":"Aaron Aldrich is a Community Builder at Elastic and a founding organizer of the DevOps CT meetup \u0026 DevOpsDays Hartford. He is passionate for connecting humans and using technology to enhance our need to connect with each other. His writing can occasionally be found on crayzeigh.com or on twitter @CrayZeigh."},"url":"https://codeandsupply.co/event_sessions/69.json"},{"id":48,"title":"Mechanically Confident","body":"There’s a thread amongst all skilled practitioners: specific habits, routines, and processes that wrap uncertainty and create confidence. Oscar-winning actors rehearse, pro-drivers do laps, chefs prep. This talk will help you recognize and design habits and routines that embed confidence in the body.","tags":"confidence, developer happiness, growth and learning, leveling up","level":"Beginner","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T14:35:00.000Z","created_at":"2019-06-08T02:03:25.210Z","updated_at":"2019-07-29T00:12:39.544Z","room":"305","presenter":{"name":"Adam Cuppy","bio":"Adam is *not* a Fortune 500 CEO, award-winning book author, or Nobel Prize recipient. But, he's an actor turned software engineer who co-founded ZEAL, a people-centric process-focused consulting company located around the United States. Learn more on the interwebs @CodingZeal @adamcuppy"},"url":"https://codeandsupply.co/event_sessions/48.json"},{"id":135,"title":"Machines as Artists: Making Music with Neural Networks","body":"For a long time, we’ve been thinking about computer science as a tool for automation and computation. With the recent rise in popularity of artificial intelligence, researchers have started experimenting with using it for more artistic and creative applications.\r\n\r\nIn the first part of the talk, you’ll hear about an overview of the different tools that were developed to use machine learning to generate music, such as Google Magenta, MuseGAN, and MidiNet. With architectures from Variational Autoencoders (VAE) to Generative Adversarial Networks (GAN) and Long Short-Term Memory (LSTM); different tools are applied on different music data types, from raw audio files (e.g. mp3 files) to midi sequences. \r\n\r\nThe second part of the talk will walk you through how you can get started to work on this problem, create your own LSTM in a few steps, and understand many of the consideration of how music generation differers from other time-series-based applications of machine learning. \r\n","tags":"machine learning, artificial intelligence, music, art, neural networks","level":"Advanced","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T14:35:00.000Z","created_at":"2019-06-08T02:03:26.526Z","updated_at":"2019-07-26T02:25:46.862Z","room":"306/307","presenter":{"name":"Husni Almoubayyed","bio":"Husni is a Ph.D. candidate at Carnegie Mellon University. He spends a lot of his time writing Python programs to unravel the mysteries of the universe around us in general, and the mysteries of dark energy in particular.\r\n\r\nHe is passionate about artificial intelligence and generally enjoys solving challenging interdisciplinary problems -- from finance to music -- in novel computational ways.\r\n"},"url":"https://codeandsupply.co/event_sessions/135.json"},{"id":51,"title":"Your Work Has Moral Implications. Own it.","body":"A non-trivial number of us are working for companies with highly questionable business models: models which depend on morally questionable methods to make a profit. There are many examples, from the obvious (we'll use your data in ways that aren't in your best interests) to the sneaky (give us your data and we might give you a discount while we sell it to someone else) to the downright dastardly (we're sending your data to people that will use it against you.)\r\n\r\nAs the professionals responsible for implementing the solutions Management has in mind, it's about time we gave this more thought.\r\n\r\nIn this talk, you'll hear a new Code of Ethics for software developers that's usable by those of us who work for others. You'll learn about the construct of malpractice, what it means in comparable professions, and how it might apply to the field of computer science. You'll acquire techniques for addressing moral concerns up front with your employer. And you'll get recommendations for what to do when you're asked to make something you find morally repugnant or professionally questionable.","tags":"ethics, business practices, software development","level":"Beginner","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T14:35:00.000Z","created_at":"2019-06-08T02:03:25.257Z","updated_at":"2019-07-26T02:25:46.842Z","room":"401/402","presenter":{"name":"Bill Horvath","bio":"Bill is a developer and Agilist, with depth in both software engineering and application implementations. He has decades of professional experience in information technology, startups, industrial psychology, and management consulting, and his most noteworthy industry expertise is in software, digital media, utilities, automotive, healthcare, government, and non-profits. He was the founder of Coders Helping Recruiters and on the organizing committee for Toledo Soup, and volunteers on non-profit boards whenever he gets the chance. In his spare time, he enjoys creating art in various mediums, and mentoring up-and-coming software developers."},"url":"https://codeandsupply.co/event_sessions/51.json"},{"id":158,"title":"Programming Productivity","body":"Every tech business, from the multi-billion dollar Silicon Valley company to the 3 person startup, continually face the same problem: maintaining productivity with scale. How do you scale a codebase when you're constantly adding new features and fixing bugs? How do you grow and educate your engineering team? In this talk we’re going to do a deep dive into the JavaScript AST and learn how to leverage it so we can master one of the hard problems of engineering: productivity with scale.","tags":"javascript","level":"Advanced","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T14:35:00.000Z","created_at":"2019-06-11T00:23:09.228Z","updated_at":"2019-07-29T00:12:39.494Z","room":"403/404","presenter":{"name":"Jem Young","bio":""},"url":"https://codeandsupply.co/event_sessions/158.json"},{"id":78,"title":"Deeper Understanding \u0026 Better Communication Through Art \u0026 Observation","body":"Understanding new concepts and complex systems is hard. Explaining them? That’s even harder. \r\n\r\nLike anyone in a highly specialized career, software engineers may struggle to convey information concisely, confidently, and clearly to their technical and non-technical teammates. As an illustrator and former graphic designer, Anna has found that visual art can be the key to both deeper understanding and clearer, more accessible communication. In this talk, we’ll explore why the ability to clearly communicate is vital to mastering a complex topic, how to choose the right abstractions to present to a specific audience, and how a different medium can provide a new lens through which to view a familiar concept.","tags":"art, communication, learning","level":"Beginner","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T14:35:00.000Z","created_at":"2019-06-08T02:03:25.662Z","updated_at":"2019-07-26T02:25:46.874Z","room":"405","presenter":{"name":"Anna Rankin","bio":"Currently, Anna is a Software Engineer at General Assembly, helping build tools with an aim to change the way adults learn. Before finding her true calling as a computer whisperer, she explored careers in the arts, education, and even community relations for a small island! A lover of puns, mentorship, and learning through failure, you can find her written work on dev.to/annarankin. When she’s not trying to finish one of the four books she’s reading concurrently, you can find her lurking on Twitter or creating pixel art of her dog."},"url":"https://codeandsupply.co/event_sessions/78.json"},{"id":7,"title":"Kill All Mutants!","body":"How good are your tests?  Would they still pass if the tested code was changed much?  If so, there's probably a problem with your code, your tests, or both!\r\n\r\nMutation Testing helps reveal these cases.  It makes changed versions of your code (mutants)  and runs your tests against the mutants to \"kill\" them.  \"Survivors\" imply that there are flaws in your code and/or tests.\r\n\r\nThis talk will tell you how and why to use mutation testing, and how it works, including some examples and tools for popular languages.\r\n\r\n(Cover image credit: https://www.deviantart.com/polaris-xforce/art/The-Brotherhood-of-Evil-Mutants-390550995 used by permission)","tags":"testing, quality, mutation testing","level":"Advanced","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T14:35:00.000Z","created_at":"2019-06-08T02:03:24.584Z","updated_at":"2019-07-26T02:25:46.856Z","room":"406","presenter":{"name":"Dave Aronson","bio":"Dave Aronson is a software development consultant, with about three and a half decades of experience, in a wide variety of languages, techniques, etc.  He is the \"T. Rex\"  of Codosaurus, LLC (his one-person company, which is how he got such a cool title).  His latest passion project is to perfect and spread his ACRUMEN software quality definition.\r\n\r\nOn lighter notes, Dave is married, is owned by two cats, and enjoys dark beers, smoky whiskies, visiting foreign countries, playing guitar, and shooting targets."},"url":"https://codeandsupply.co/event_sessions/7.json"},{"id":169,"title":"Distractions","body":"- Pinball arcade\r\n- Board games\r\n- and much more!","tags":"","level":"","starts_at":"2019-08-21T13:55:00.000Z","ends_at":"2019-08-21T20:45:00.000Z","created_at":"2019-07-27T04:11:07.459Z","updated_at":"2019-07-27T04:11:07.459Z","room":"Ballroom I/II/III","presenter":{"name":"Abstractions"},"url":"https://codeandsupply.co/event_sessions/169.json"},{"id":139,"title":"Metal2Docker: Taking Software as a Service Microservices Architectures Beyond the Cloud and Into the On-Prem Enterprise Environment","body":"On-prem enterprise software deserves the benefits of CI/CD as much as their cloud-based counterparts. Continuous automatic software updates on autonomous on-prem systems which the software developer has very little control over is now made easier with the use of containers within a microservices architectures. This is how SAAS is made possible on-prem.\r\n\r\nIn this talk we describe a methodology for converting enterprise on-prem single-server software architectures to fully containerized microservices architectures. We go through different architectural components and show how they can be containerized by converting their bare metal configurations into a combination of Dockerfiles, configuration templates, environment variable files and scripts. \r\n\r\nMoreover, we describe how to build a set of accompanying metal2docker containers which will automatically transform every service on every on-prem deployment of the software, into a containerized one which can be self-upgraded to future versions of the software's microservices architecture. \r\n\r\nWe also show specific examples of how we did this for services like mysql, redis, ruby and node.js.\r\n\r\nWe create a complete production software release with a self-upgrading system which depends on a set of cloud repositories to handle software releases or even off-line upgrades. Specialized micro services are used to handle the software updates. The self updating system is also capable of maintaining the software's host, upgrading the docker daemon and reconfiguring the docker network to match the customer's enterprise network configuration using another set of microservices.\r\n","tags":"on-prem, containers, docker, software architecture, deployment, saas","level":"Advanced","starts_at":"2019-08-21T14:50:00.000Z","ends_at":"2019-08-21T15:30:00.000Z","created_at":"2019-06-08T02:03:26.590Z","updated_at":"2019-07-29T00:12:39.468Z","room":"301/302","presenter":{"name":"Panickos Neophytou","bio":"Panickos earned his PhD in computer science from the University of Pittsburgh. He has been building distributed data-stream processing and data management systems for over ten years. Panickos is the system architect and technical driving force behind the development of NetBeez. His interests now are focused on delivering top-quality, highly scalable, stream processing, on-prem software products in using a SaaS model."},"url":"https://codeandsupply.co/event_sessions/139.json"},{"id":119,"title":"Code Reviews? That's a Great Idea!","body":"We all know that code reviews are beneficial. We’ve been told time and time again that they should be part of our development process. But – like most best practices – a practical implementation is challenging (and time consuming). Your team is convinced they are a great idea. You’ll have an opportunity to squash bugs in the least costly of development times, learn new things from your talented teammates, and build a stronger foundation of trust. Awesome. Everyone is on board. But now what? What tools are out there? What are you actually looking for? How often should the reviews happen? What about bias?\r\n\r\nIn this talk, you’ll get a practical guide to making code reviews effective. Whether you’re the reviewer or reviewee: there are ways to make sure this really is a great idea.","tags":"development, soft-skills, code quality","level":"Beginner","starts_at":"2019-08-21T14:50:00.000Z","ends_at":"2019-08-21T15:30:00.000Z","created_at":"2019-06-08T02:03:26.262Z","updated_at":"2019-07-26T02:25:46.887Z","room":"303/304","presenter":{"name":"Amy Gebhardt","bio":"Amy is an extroverted software developer with a traditional Computer Science background and a passion for technology and people. She is happiest when writing code on her Mac in collaboration with her team. Currently, she is the Lead Front-End Software Engineer at SportsEngine and spends her time leading platform-wide efforts on a variety of front-end initiatives including creating a reusable component library, reducing technical debt, improving architecture, and building custom developer tools. Creating delightful experiences for other engineers has become her primary focus and strikes the perfect balance between her love for humans and her love for code."},"url":"https://codeandsupply.co/event_sessions/119.json"},{"id":109,"title":"Leveraging Kubevirt and Kubernetes as a Training Platform","body":"As organizations look to keep up with an always evolving tech landscape, being able to easily run workshops and developing proof-of-concepts on a particular technology can become a critical utility in keeping a teams skills up to date or getting new members onboard. However this pipeline that you depend on can quickly become a nightmare due to the cost of maintenance in order to keep up with the changing variables of the teams you are working with (cloud environment, local policies, etc.). In this session, we will demonstrate how focusing on Kubevirt in conjunction with Kubernetes as your workshop platform can allow you to spend less time worrying about where and how you are going to dive in on new technical content for the purpose of workshops, PoCs and Testing - allowing you to shift your focus to what may matter more - your actual content. .\r\n","tags":"kubernetes, kubevirt, containers, virtual machines","level":"Advanced","starts_at":"2019-08-21T14:50:00.000Z","ends_at":"2019-08-21T15:30:00.000Z","created_at":"2019-06-08T02:03:26.111Z","updated_at":"2019-07-29T00:12:40.018Z","room":"306/307","presenter":{"name":"Tyler Auerbeck","bio":"Tyler Auerbeck is a Site Reliability Engineer with Red Hat's Open Innovation Labs. He is currently focusing on Kubernetes, automation and observability with an interest in building open, cross-functional teams."},"url":"https://codeandsupply.co/event_sessions/109.json"},{"id":4,"title":"Maintaining a Legacy Haskell App as Not-Yet-Experts","body":"In 2016, Jacobin Magazine asked Position Development to expand their existing Haskell app. Instead of only serving ecommerce forms through iFrames in their WordPress, their Haskell app would serve the entire site, including every article from the magazine and blog.\r\n\r\nEarly into the project, the original creator of the app left Position to begin a career in research. I was suddenly the most experienced Haskell developer on my team, while I still had less than a year of professional experience in tech. In this talk, I'll discuss both a) the technical aspects of the work and b) what it was like to try to make it all happen as part of a small team of non-expert Haskellers.\r\n\r\nSome of the topics I'll touch on include:\r\n - Larceny, our HTML templating language\r\n - Offset, our library for rendering content via JSON APIs\r\n - Feeling disconnected from the larger language community, coping with inexperience as a team, and continuing to learn and grow as a functional programmer","tags":"haskell, functional programming, stereotype threat, growth and learning, practices","level":"Advanced","starts_at":"2019-08-21T14:50:00.000Z","ends_at":"2019-08-21T15:30:00.000Z","created_at":"2019-06-08T02:03:24.542Z","updated_at":"2019-07-29T17:50:33.419Z","room":"401/402","presenter":{"name":"Libby Horacek","bio":""},"url":"https://codeandsupply.co/event_sessions/4.json"},{"id":50,"title":"Muddling Through the Middle Bits: What Comes After Junior and Before Senior","body":"There’s a ton of advice out there for junior developers: how to grow your skills, how to contribute effectively without a lot of experience, how to ask good questions. Likewise, there’s a lot of good advice for senior developers on how lead and mentor effectively and how to leverage their knowledge and experience. Left out are the people in between those two extremes: the developers who aren’t junior anymore, but haven’t risen to truly “senior developer” status.How do you get from junior to senior? Perhaps it's just a matter of time: Junior Dev + 5 years = Senior Dev? Is it some combination of depth and breadth of knowledge? Are team skills or technical ones the most important in this transition? How do you know you've crossed into senior territory? For that matter, how do you know you're no longer a junior? Let’s explore this squishy middle area, its landmarks and signposts, and try to find a personalized map of the mid-career.","tags":"career development","level":"Advanced","starts_at":"2019-08-21T14:50:00.000Z","ends_at":"2019-08-21T15:30:00.000Z","created_at":"2019-06-08T02:03:25.243Z","updated_at":"2019-07-26T02:25:46.900Z","room":"403/404","presenter":{"name":"Anne Cahalan","bio":"Anne is an iOS developer Detroit Labs, where she is constantly delighted by the niftiness of Swift. Passionate about clean code, craft cocktails, and nice yarn, she dreams of an elegantly-designed app that pairs cocktails with knitting patterns. She is contractually required to mention her three-legged cat, Wobbles. \r\n"},"url":"https://codeandsupply.co/event_sessions/50.json"},{"id":125,"title":"How to Build a Community from Scratch (While Conquering Social Anxiety)","body":"How do you persuade people to join you in building a new community, especially when you have no idea what you're doing? I'll share my journey from socially anxious introvert with no technical background to founder of Learn Teach Code, the largest learning-focused tech meetup in Southern California with over 9,400 members.\r\n\r\nThe educational half of this talk: we'll explore how beginners can become mentors, how concepts from social science research can apply to tech communities, and how to recruit volunteers.\r\n\r\nThe personal half of this talk: I'll talk about community building as a form of social anxiety desensitization therapy, fighting depression by making new friends, and learning to code through peer-led, informal study groups.","tags":"community building, leadership, social anxiety, mental health, social science, meetups, volunteerism","level":"Beginner","starts_at":"2019-08-21T14:50:00.000Z","ends_at":"2019-08-21T15:30:00.000Z","created_at":"2019-06-08T02:03:26.360Z","updated_at":"2019-07-27T19:40:52.480Z","room":"405","presenter":{"name":"Liz Krane","bio":"Liz Krane is a developer advocate at Sentry and founder of Learn Teach Code, an organization that empowers aspiring developers to lead their own local events to create stronger, more diverse tech communities. She loves finding new ways to combine code with other disciplines like art and music, sharing everything she learns while she tries to learn everything!"},"url":"https://codeandsupply.co/event_sessions/125.json"},{"id":38,"title":"UX Field Research Basics","body":"With the speed at which technology is changing, field research offers understanding into how products can impact the lives of your customers. Regardless if it’s your first or hundredth time, conducting field research is a daunting task. Planning and conducting field research is a juggling act between preparation, interview skills, and synthesis. In this talk, I’ll share some of the soft skills and key principles involved in any researcher’s toolkit and explore lessons learned from the three main stages of conducting field studies:\r\n\r\nStage 1: Planning and prep — Gathering good research data starts with proper planning. This includes everything from writing interview questions and developing an interview guide to recruiting participants and determining logistics.\r\n\r\nStage 2: Out in the field — Research can drain you both physically and mentally. I will introduce some tricks to keep your mind sharp, allowing you to give each session your focus.\r\n\r\nStage 3: Finding the patterns — The data resulting from field research grows quickly. I outline a few techniques for making the most out of limited time and managing mountains of information.\r\n","tags":"design, research, ux","level":"Beginner","starts_at":"2019-08-21T14:50:00.000Z","ends_at":"2019-08-21T15:30:00.000Z","created_at":"2019-06-08T02:03:25.088Z","updated_at":"2019-07-29T00:12:39.846Z","room":"406","presenter":{"name":"David Farkas","bio":"David is a UX Designer living in Philadelphia, PA and has a passion for uncovering process and story through iterative client engagement. His experience includes work across a number of financial organizations, e-commerce platforms and a variety of business systems. \r\n\r\n\r\n\r\nAs a co-author of UX Research, with O’Reilly, David explore research techniques and approaches to collaboratively exploring product and business needs. Currently with EPAM, David embraces process and research as a tool to engage clients across all levels of a project. David is passionate about research and collaboration throughout project phases. \r\n\r\n\r\n\r\nDavid has practiced improv theater for over a decade and most recently practices through classes at Philadelphia Improv Theater (PHIT) and with the Indy Improv Team Monkey Birds and The Flood. He has led a number of improvisation workshops including formal sessions and more BarCamp style workshops and authored Collaborative Improv: Building Better Products Through Improvisation, now available on Amazon. \r\n"},"url":"https://codeandsupply.co/event_sessions/38.json"},{"id":11,"title":"A Gentle Introduction to Deep Learning for Developers","body":"Like flying cars, the promise of artificial general intelligence (AGI) has been elusive for years. We are a long ways out from machines that can perform intellectual tasks equivalent to that of a human. Deep learning, a subset of machine learning, is a technology available today which enables developers to add narrow artificial intelligence (AI) capabilities to their applications including image or audio classification, facial recognition, object recognition, image caption generation, and natural language processing. We'll explore how developers can integrate pre-trained open source deep learning models into their applications and how developers and data scientists can collaborate on the development, training, and deployment of deep learning models.","tags":"ai, machine learning, deep learning, data science, software development","level":"Advanced","starts_at":"2019-08-21T15:45:00.000Z","ends_at":"2019-08-21T16:25:00.000Z","created_at":"2019-06-08T02:03:24.659Z","updated_at":"2019-07-29T00:12:39.989Z","room":"301/302","presenter":{"name":"Bradley Holt","bio":"Bradley Holt leads a team of developer advocates within IBM who are democratizing data science and artificial intelligence (AI) through open source technologies. The team's work includes helping developers integrate open source deep learning models into their applications, ensuring trustworthiness and transparency from AI systems, promoting open standards for the deployment and operationalization of AI systems, and enabling better collaboration between developers, data scientists, and data engineers."},"url":"https://codeandsupply.co/event_sessions/11.json"},{"id":108,"title":"Company Culture:  Evolving It, Not Creating/Maintaining It","body":"When companies start paying attention to company culture they tend to focus on how to create or maintain it.  You'll hear discussions about if interview candidates might adapt to the current culture.  Efforts will be made to weed out those who do not fit in with how things are perceived as working for the team now.  \r\n\r\nThis is toxic and destructive to the long term success of the team, company, and most importantly the individuals.\r\n\r\nThe dynamic of how people within any group interact is an organic, evolving thing that should never and can never remain static.  Culture is not a zero-sum game where people can be added or subtracted to reach an ideal, finite point.\r\n\r\nWe'll go over:\r\n\r\n- why culture should not be seen as something to create or maintain\r\n- different perspectives and techniques to reframe how you view and evaluate your company dynamic\r\n- ways to shift your interview and performance review mindset towards promoting healthy dynamics and providing growth in the areas that need attention","tags":"","level":"Beginner","starts_at":"2019-08-21T15:45:00.000Z","ends_at":"2019-08-21T16:25:00.000Z","created_at":"2019-06-08T02:03:26.098Z","updated_at":"2019-07-26T02:25:46.934Z","room":"303/304","presenter":{"name":"Jesse James","bio":"Jesse (he/him) is a lover of dogs, cats, and trees.  You'll find him living in the Pacific Northwest of the U.S. with his dog Maddy and cat Poppy.  Currently, Jesse is working as a senior software engineer at Conversa Health, a health and care management software startup in Portland, OR."},"url":"https://codeandsupply.co/event_sessions/108.json"},{"id":144,"title":"Humane Tech: Redefining the Relationship with Pervasive Technology","body":"This talk will orient around my efforts to change and re-orient my relationship to technology, with special attention paid to social media, streaming media (i.e., YouTube, Netflix), and tools to measure and assess technology use. My personal experience will be used to segue into personal evaluation of tech use, and how the user/technology relationship can become more complementary, rather than consumptive. It is NOT about quitting one's smartphone, but rather, using technology in a way that enhances, rather than detracts, from daily life. \r\n\r\nThe structure of the talk will include 5 sections:\r\n- Defining and explaining 'humane technology' and why it matters\r\n- An exploration of how different platforms (especially Facebook, Twitter, and Google) use hyper-targeted user data to segment and engage users\r\n- The starting point: an honest look at my own idle smartphone use ... and what prompted me to change\r\n- Tools and data: apps used to measure time spent in different apps, identifying triggers, and physical interventions ('sleeping bag' for phones)\r\n- First-pass efforts: how successful was I? What happened as a result? Where do I/we go from here? \r\n","tags":"humane technology, technology ethics, work-life balance","level":"Beginner","starts_at":"2019-08-21T15:45:00.000Z","ends_at":"2019-08-21T16:25:00.000Z","created_at":"2019-06-08T02:03:26.680Z","updated_at":"2019-07-26T02:25:46.959Z","room":"305","presenter":{"name":"Leah Jakaitis"},"url":"https://codeandsupply.co/event_sessions/144.json"},{"id":122,"title":"Is CSS A Programming Language?","body":"CSS isn’t really programming language, is it? You can’t write algorithms or unit tests for CSS…or can you? Think again!","tags":"css, programming languages, declarative, front-end, algorithms","level":"Advanced","starts_at":"2019-08-21T15:45:00.000Z","ends_at":"2019-08-21T16:25:00.000Z","created_at":"2019-06-08T02:03:26.312Z","updated_at":"2019-07-26T02:25:46.941Z","room":"401/402","presenter":{"name":"Lara Schenck","bio":"Lara Schenck is fascinated by the profound, yet subtle, overlap between programming, computer science fundamentals, and CSS. She spreads her enthusiasm for this topic at her day job as a Design Engineer for Penske Media Corporation, where she leads the design systems effort for big media publications powered by WordPress, and through speaking and community involvement.\r\n\r\nLara writes about her work and life [on her blog](https://notlaura.com/blog/), illustrates [friendly monsters](https://notlaura.com/monsters), and inspires all of us who work with the web to seek a deeper understanding of the code we write and the tools we use."},"url":"https://codeandsupply.co/event_sessions/122.json"},{"id":151,"title":"Protecting ourselves online and in person","body":"One of the beauties of open-source engineering is the public-facing nature of our jobs. Whether we are troubleshooting issues on GitHub, speaking at conferences, or thought-leadering on social media, we are often in the physical or digital spotlight. Furthermore, because we meet our users where they are, we often expose our personal selves more so than the average human on the Internet.\r\n\r\nWhile the vast majority of our users are kind, loving, and thoughtful, unfortunately the technology community also includes bad actors. And while most communities have Codes of Conduct or similar mechanisms for removing a bad actor, how can we protect ourselves from those bad actors?","tags":"privacy,online,security","level":"Beginner","starts_at":"2019-08-21T15:45:00.000Z","ends_at":"2019-08-21T16:25:00.000Z","created_at":"2019-06-11T00:16:02.776Z","updated_at":"2019-07-29T13:59:56.038Z","room":"403/404","presenter":{"name":"Seth Vargo","bio":"Seth Vargo is an engineer at Google Cloud. Previously he worked at HashiCorp, Chef Software, CustomInk, and some Pittsburgh-based startups. He is the author of Learning Chef and is passionate about reducing inequality in technology. When he is not writing, working on open source, teaching, or speaking at conferences, Seth advises non-profits."},"url":"https://codeandsupply.co/event_sessions/151.json"},{"id":136,"title":"Starting a Mentorship Program Without Any Money","body":"Whenever we have already started our own career in software, we forget how hard were the first steps. Some big companies have the resources to train students to work for them, paying them for their time. Still, whenever you are part of a smaller organization you don't have the funds for anything like that. That's why you need to leverage on some other aspect to help young developers have real-life experience and find their first job.\r\nIn this talk, you'll learn how to set up a sustainable framework to benefit all three parts involved in the mentorship process: the apprentices, the mentors, and the community. If you want to give back, empower new colleagues or have fun with new projects, you can't miss this talk.","tags":"mentorship, opportunities, job, education, career development","level":"Advanced","starts_at":"2019-08-21T15:45:00.000Z","ends_at":"2019-08-21T16:25:00.000Z","created_at":"2019-06-08T02:03:26.543Z","updated_at":"2019-07-26T02:25:46.966Z","room":"405","presenter":{"name":"Lucas Videla"},"url":"https://codeandsupply.co/event_sessions/136.json"},{"id":83,"title":"Tester at the Table and the Tester in My Head","body":"The relationship between software developers and quality assurance professionals is crucial to making good products. Through 15 years of software development, Adrian P. Dunston has had opportunities to work with dedicated and talented QA professionals. And now he has a little tester in his head.\r\n\r\nSo how do we build up the little testers in our heads? Based on extensive reading and years of working with and without the support of QA professionals, Adrian will show you:\r\n\r\n* How to help your QA team-members be force multipliers\r\n* How to become and encourage quality-minded developers \r\n* How to use repetition and story to get your ideas stuck your colleague's heads\r\n* How to instill habits they can use and take with them\r\n","tags":"quality,relationships,communication","level":"Beginner","starts_at":"2019-08-21T15:45:00.000Z","ends_at":"2019-08-21T16:25:00.000Z","created_at":"2019-06-08T02:03:25.737Z","updated_at":"2019-07-26T02:25:46.953Z","room":"406","presenter":{"name":"Adrian P. Dunston","bio":"Adrian P. Dunston has worked in companies of all sizes as a software developer, data architect, scrum master, manager, and briefly founder. His hobbies include cross-referencing several dozens of self-help and leadership books which he quotes endlessly to his amazing wife and fabulous children. Adrian is passionate about neurodiversity, using computers to help people, and storytelling. He also takes extensive notes.\r\n"},"url":"https://codeandsupply.co/event_sessions/83.json"},{"id":81,"title":"Measuring the Human Impact of Software Best Practices: A Story of CSS and Empathy","body":"When was the last time you measured how much your application's CSS bundle cost your users to download?\r\n\r\nA non-zero percentage of people using your or your company's products pay for their internet by the byte. This is an especially stark truth for people in developing nations. Efforts towards reducing bundle sizes and improving caching strategies are not only good technical practice, but good ethical and business practice as well.\r\n\r\nIn this session, I will illustrate, using real numbers, costs, and stories, the realities of making a living in developing nations working for some of the biggest names in AI and ML. I'll connect industry best practices in managing static assets to the people those practices benefit, identifying win-win opportunities for you, your product, and your communities.","tags":"css, roi, empathy, ci/cd, gig economy","level":"Advanced","starts_at":"2019-08-21T16:40:00.000Z","ends_at":"2019-08-21T17:20:00.000Z","created_at":"2019-06-08T02:03:25.706Z","updated_at":"2019-07-29T00:12:39.968Z","room":"303/304","presenter":{"name":"jnf","bio":"Jeremy is a programmer and engineering leader living in Seattle, WA. With a philosophy that eyes technology as the means rather than the end, Jeremy takes a human-centric approach to both people leadership and software development. With 15 years experience, he utilizes technology as a medium for human expression, building real-world communities, and solving real problems.\r\n\r\nHe specializes in open-source development using languages like Ruby, JavaScript, and Elixir. Jeremy is also a conference organizer, public speaker, community advocate, teacher, and fervent record collector."},"url":"https://codeandsupply.co/event_sessions/81.json"},{"id":101,"title":"MUD to OOP: An Introduction to Object-Oriented JavaScript in Online RPGs","body":"Text-based online multi-user dungeons, or “MUDs” have been around since the 1980s, and are still popular in 2019. Based on Dungeons \u0026 Dragons, MUDs offer an interactive roleplaying experience, without the manual work of the tabletop game.\r\n\r\nThey taught me about the concept of Object-Oriented Programming (OOP), long before I even knew what it was. Objects are used for virtually every aspect, from players and objects, to rooms and the non-playable characters we “fight”.\r\n\r\nIn my talk, I'm going to provide some actual examples of MUD objects, represented in JavaScript!\r\n\r\nBy bridging the concepts of classes, attributes, and methods with object models in MUDs, new and experienced coders alike can better understand how objects interact, and the problems that objects solve in games.\r\n","tags":"javascript, object oriented programming, gaming","level":"Beginner","starts_at":"2019-08-21T16:40:00.000Z","ends_at":"2019-08-21T17:20:00.000Z","created_at":"2019-06-08T02:03:26.001Z","updated_at":"2019-07-26T02:25:46.985Z","room":"305","presenter":{"name":"Nicole Archambault","bio":"Nicole Archambault is a Boston area front-end web developer, coding career change coach, EdTech entrepreneur, and community organizer. She is the founder of La Vie en Code, dedicated to new self-taught web developers.\r\n\r\nHer entire career is centered on optimizing the experience of those who choose to teach themselves programming skills in lieu of a more traditional academic setting, or bootcamp.\r\n\r\nShe has received several awards and recognitions through her work in the developer community, including freeCodeCamp Top Contributor, and has been featured as a Treehouse Success Story. She has been teaching everything she knows via her course + coaching program, 30 Days to Web Development, the La Vie en Code blog, and the La Vie en Code podcast.\r\n"},"url":"https://codeandsupply.co/event_sessions/101.json"},{"id":31,"title":"From Long-Wall Coal Mining to Serverless Coding","body":"Serverless architecture is a way to build and run applications and services without having to manage infrastructure. With all the server management handled by a cloud service provider, your developers can focus on their core product instead of worry about managing server, operating systems and runtimes.\r\n\r\n\r\nIt’s often hard to anticipate the impact of revolutionary new technologies like serverless architecture - but maybe we can learn a few things from looking at how technology has revolutionised a completely different industry. Marvin Laucher is a former coal miner turned software developer. In this session, he’ll talk about how a technique called long-wall mining revolutionised underground coal mining, delivering massive improvements in productivity and safety. With serverless promising similar improvements for our software applications, what can we learn about working with game-changing technology by examining the impact that long-wall mining had in the coal industry?","tags":"aws, server-less, lambda, new technologies, node, js,","level":"Beginner","starts_at":"2019-08-21T16:40:00.000Z","ends_at":"2019-08-21T17:20:00.000Z","created_at":"2019-06-08T02:03:24.991Z","updated_at":"2019-07-29T00:12:40.024Z","room":"306/307","presenter":{"name":"Marvin Laucher","bio":"Marvin Laucher is a former Coal Miner turned Software Developer and the inspiration for the development of Mined Minds. After many years operating machines underground, he now enjoys writing code for clients wanting to add cutting-edge technologies to their portfolio. While he enjoyed working with the underground team, Marvin’s favorite part of his new career is breaking down complex business problems and solving them with elegant coding solutions. He works mostly with Ruby, nodeJs, Javascript, Sql, Server-less and very much enjoys mentoring others through their career transitions. \r\n"},"url":"https://codeandsupply.co/event_sessions/31.json"},{"id":55,"title":"We Didn’t Know Until We Knew: A Journey Through End Times","body":"Last year, our documentation team’s cloud-based authoring tool collapsed. The authoring tool is our team’s core tool. It manages our version control, source control, collaboration, review status, and publishing. This tool collapsing was one of our worst-case-scenario situations. However, we had prepared for this possibility because of our pre-purchase risk assessment, and our mitigation allowed us to get our release out on time, within two weeks of the tool’s collapse. \r\n\r\nIn this talk, I walk through the warning signs we caught and the ones we missed as well as the mitigation strategies we had implemented that allowed us to recover with no disruption to our end-users. While this case study features an authoring tool, the strategies presented herein apply to any tool you rely on as a key part of your workflow.\r\n","tags":"risk assessment, risk analysis, tooling, purchasing processes, crisis communications","level":"Advanced","starts_at":"2019-08-21T17:35:00.000Z","ends_at":"2019-08-21T18:15:00.000Z","created_at":"2019-06-08T02:03:25.319Z","updated_at":"2019-07-26T02:25:46.993Z","room":"303/304","presenter":{"name":"Margaret Fero","bio":"Margaret Fero is a Technical Writer at Degreed, where she enjoys helping users track all of their skills regardless of how those skills were developed. She previously documented software for containerized freight shipping."},"url":"https://codeandsupply.co/event_sessions/55.json"},{"id":113,"title":"Building Accessibility Together","body":"Accessibility can be a natural part of the design and development process that doesn’t sacrifice on looks or deadlines. \r\n\r\nBuilding an accessible product requires a team working together with intention, but it doesn’t require hours of poring through intimidating technical standards. This talk shows how to incorporate accessibility best practices into your team’s workflow, from the beginning of a design kickoff through engineering implementation.\r\n\r\nIn this talk, we’ll build an interactive search component from scratch and examine ways to collaborate, create effective handoff materials, implement accessible features, and test your work. With these guidelines, you’ll be empowered to create accessible experiences with your team from start to finish.\r\n","tags":"accessibility, design, html, css, engineering, ux design, ux development, collaboration, teamwork, workflows","level":"Beginner","starts_at":"2019-08-21T17:35:00.000Z","ends_at":"2019-08-21T18:15:00.000Z","created_at":"2019-06-08T02:03:26.170Z","updated_at":"2019-07-29T00:12:40.038Z","room":"305","presenter":{"name":"Jesse Stewart","bio":"Jesse Stewart is a UX Developer at DockYard, a fully-distributed digital product agency. She’s a big fan of her dogs, reading, and exploring the outdoors."},"second_presenter":{"name":"David Luhr","bio":"David Luhr co-manages the UX Development team at DockYard, a fully-remote digital product agency. He does traditional woodworking, rides BMX, and creates content for Build UX, a YouTube series on expert HTML, CSS, and accessibility."},"url":"https://codeandsupply.co/event_sessions/113.json"},{"id":30,"title":"Building a Real-time WebSocket API","body":"Sometimes consumers of your APIs require near-realtime communication because regular RESTful HTTP apis can be a few milliseconds too slow. These performant and scalable APIs can be made over websocket TCP connections where events are pushed from client and server in near-realtime fashion.\r\n\r\nThis talk is a story of how I built such an API. We'll look at why this decision to create a websocket API was made and we will take a look at the data that supported this decision. We will take a deep dive into Phoenix websockets, channels, and transports to expose the underlying architecture. Finally, we look at how we tested the API, how we authenticated users over the channels, and how Phoenix helped this all happen with relative ease.","tags":"api, javascript, phoenix, elixir, websocket","level":"Advanced","starts_at":"2019-08-21T17:35:00.000Z","ends_at":"2019-08-21T18:15:00.000Z","created_at":"2019-06-08T02:03:24.978Z","updated_at":"2019-07-26T02:25:46.999Z","room":"306/307","presenter":{"name":"Jamie Wright","bio":"Jamie Wright is a maker of internet things with a love/hate relationship for Redbull™, standing desks, and paintball guns. He has a love only relationship with teaching, learning, and building bots. Jamie runs Tatsu, a software bot that helps teams save time by performing standup meetings over Slack."},"url":"https://codeandsupply.co/event_sessions/30.json"},{"id":17,"title":"Building Software for People Who Don’t Want to Use It","body":"Software can be frustrating to use. It can be buggy and unstable or confusing and unwelcoming. Nonetheless, we turn to software everyday because we don’t have a ton of other options. But as people who build software we do have a better option. We can build software people want to use by empathizing with the humans who use it. \r\n\r\nIn this talk, we’ll see how we can build software people enjoy using by exploring the wedding RSVP app my wife and I built for our big, diverse family. A seemingly simple RSVP app can become accessible, fun to use software when we consider our audience.","tags":"accessibility, diversity, ux","level":"Beginner","starts_at":"2019-08-21T18:30:00.000Z","ends_at":"2019-08-21T19:10:00.000Z","created_at":"2019-06-08T02:03:24.775Z","updated_at":"2019-07-26T02:25:47.012Z","room":"301/302","presenter":{"name":"Ali Ibrahim","bio":"Ali is a seasoned developer who likes a good challenge. When he’s not busy chasing the root cause of a nasty bug, he’s busy mastering a new recipe or defending the garden from pesky squirrels (*waves fist*). You can find Ali online at testdouble.com and on Twitter @alimeye."},"url":"https://codeandsupply.co/event_sessions/17.json"},{"id":35,"title":"The Mental Impact of Tech Interviews","body":"Lengthy technical interview processes frustrate tech workers and can impact one’s mental health. From high-pressure whiteboard coding that feels more like a Broadway audition, to reciting encyclopedic knowledge found in computer science textbooks, it is no secret that technical interviews are broken. While these practices are well-known and have significant debate surrounding their accuracy and efficacy, the hidden and deleterious effects they have on tech workers have gone unrecognized.\r\n \r\nUnnecessarily difficult technical interviews can create imposter syndrome which can cause new mental health issues, exacerbate existing ones. Long-term, this can affect productivity, morale, retention and drive people to abandon their tech careers or even halt tech careers before they’ve begun. With sites like OSMI Forums, Burnout.io and many others, tech workers are increasingly speaking out about mental health issues. While companies seek to uncover the source of these issues, they often ignore a very basic component; the technical interview.\r\n \r\nAs evidenced by the existence of They Whiteboarded Me (they.whiteboarded.me) and Hiring Without Whiteboards (github.com/poteto/hiring-without-whiteboards) there is substantial frustration around these interviewing techniques. This talk aims to unpack and discuss the intersection between mental health, job hunting and technical interviews. Interviewers and hiring managers will learn how their actions affect candidates before, during and after an interview. In addition, candidates will be empowered to say no and learn how to drive change from within. Together, lets refactor tech hiring!","tags":"technical interviews,people,mental health","level":"Advanced","starts_at":"2019-08-21T18:30:00.000Z","ends_at":"2019-08-21T19:10:00.000Z","created_at":"2019-06-08T02:03:25.048Z","updated_at":"2019-07-26T02:25:47.018Z","room":"303/304","presenter":{"name":"Zachary Zlotnik","bio":"Zack Zlotnik has performed several varying roles at a variety of companies ranging from a sysadmin for a small family-owned manufacturing business, a 7.5 year stint as a Corporate Operations Engineer at Google and most recently, a DevOps Engineer at IBM Watson. His diverse background has been molded and shaped throughout years of professional curiosity and self-learning. Zack has interviewed over 100 candidates and has himself been an interview candidate too many times to count. When not writing Dockerfiles and speaking at tech conferences, Zack may be found at local autocross events or in an underwater cave in Mexico."},"url":"https://codeandsupply.co/event_sessions/35.json"},{"id":90,"title":"Imposter Syndrome - Why Did They Let Me Come Up Here and Talk to You?","body":"What am I doing here? All these people are so much smarter than me. They’ll find out I have no idea what I’m talking about. Why did they even let me do this in the first place? I should’ve just stayed at my last job. Sure, I hated it, but I knew how to do it. \r\n\r\nSound familiar? You might have Imposter Syndrome. Imposter Syndrome is a very, very common issue that a lot of us face. In the ever-growing world of tech, it sometimes seems difficult to both get and keep up to speed on what’s going on in your company. Especially for those of us that are career-changers, the task sometimes seems even more daunting.\r\n\r\nIn this talk, we’ll examine Imposter Syndrome and learn how to nip it in the bud! We’ll learn techniques for recognizing and squashing those imposter-y feelings before you let it take over your life and career.\r\n","tags":"soft skills, imposter syndrome, impostor syndrome, human skills, mental health","level":"Beginner","starts_at":"2019-08-21T18:30:00.000Z","ends_at":"2019-08-21T19:10:00.000Z","created_at":"2019-06-08T02:03:25.834Z","updated_at":"2019-07-26T02:25:47.038Z","room":"306/307","presenter":{"name":"Megan Boczar","bio":"Megan has been a software developer since way back in November 2017. She worked a ton of customer service and admin jobs before finally jumping into a bootcamp at Grand Circus in Detroit. After landing a job as a dev in Ann Arbor, she took on a new passion for accessibility and good front end design. Megan currently works at a Software Engineer at Torrance Learning in Chelsea, Michigan. She’s also the Co-Founder and Executive Director of a non-profit called Tech-Inclusive, helping to give talented underrepresented folks the resources and encouragement they need to succeed in tech.\r\n\r\nWhen she's not coding, Megan enjoys playing board games, keeping up on Netflix, and attempting to read one book per week. Megan loves all manner of nerdy things Star Wars to Buffy to Dungeons and Dragons.\r\n"},"url":"https://codeandsupply.co/event_sessions/90.json"},{"id":150,"title":"When Automation Strikes Back","body":"The HBO hit series Westworld tells us of a place where we can\r\n\"Live without limits!\" This promise might remind us of the \"magic\" with\r\nwhich automation is often spoken about. To be sure, automation is a\r\ncornerstone of DevOps, the A in DevOps' venerable CAMS, and the subject of\r\none of its oldest, most famous memes: \"Automate ALL the things.\"\r\n\r\nBut are there tasks we shouldn't automate? What if how we automate is\r\nactively causing us and the systems we're responsible for harm? We'll take\r\na look at some of the impacts and challenges pervasive automation has\r\npresented for developers and operations, along with some important\r\nconsiderations when automating our complex, living socio-technical systems,\r\nand some strategies to cope when automation strikes back!","tags":"","level":"","starts_at":"2019-08-21T18:30:00.000Z","ends_at":"2019-08-21T19:10:00.000Z","created_at":"2019-06-11T00:15:41.912Z","updated_at":"2019-07-26T02:25:47.025Z","room":"401/402","presenter":{"name":"J. Paul Reed"},"url":"https://codeandsupply.co/event_sessions/150.json"},{"id":126,"title":"“Testing” - You Keep Using that Word, but I Don’t Think It Means What You Think It Means!","body":"Do you find that you lack time and buy-in to write tests for your code?  Do you know exactly where you should spend your time testing?  Have you ever felt like you needed to create the entire architecture just to test a single feature?  Then this talk is for you!  Testing doesn’t have to feel like that last thing you have to do to meet acceptance criteria, it can actually be fun while ensuring quality for your application!  In a microservices world testing can actually get even simpler.  Inconceivable you say?  Not so.  \r\n\r\nIn this light-hearted, yet technical talk, Sam Brown, Director of Technology at Oteemo will make testing an approachable topic that will have you wondering why you haven’t been writing more tests! He will also break down how microservices architectures actually make testing easier, not more difficult.  The listener will leave with a solid appreciation for the Princess Bride as well as directly applicable strategies for simplifying testing approaches while increasing overall test coverage and quality.\r\n","tags":"testing, microservices, unit tests, integration tests, acceptance tests","level":"Advanced","starts_at":"2019-08-21T18:30:00.000Z","ends_at":"2019-08-21T19:10:00.000Z","created_at":"2019-06-08T02:03:26.378Z","updated_at":"2019-07-29T00:12:39.756Z","room":"403/404","presenter":{"name":"Samuel Brown","bio":"Sam Brown has been working in IT software delivery for the past 17 years as a Java developer, operations manager, startup product architect and Continuous Delivery consultant. Sam is the co-founder and organizer of the DC Continuous Delivery meetup and the founder and organizer of the NOVA Kubernetes meetup. Sam’s passion is helping to optimize the software delivery process to help teams delivery high-quality software applications as quickly as possible through automation. He believes that building software should be enjoyable for the entire team and can only be achieved when a team works effectively together."},"url":"https://codeandsupply.co/event_sessions/126.json"},{"id":73,"title":"Congrats! You're the First Person to Have a Baby at Your Startup. Now What?","body":"Having a baby is a big life change. Being the first person to have a baby at a startup makes it feel even more daunting. This talk walks you through the steps I took when I was the first person to go on family leave at my previous job (a startup), including educating my company about what leave I was entitled to, and shows how you can own the situation and take control.\r\n\r\nThis talk is for anyone who works in startups who is thinking about having a baby (or adopting one!), is currently expecting a child, or just wants to be an ally in the workplace for soon-to-be parents.\r\n","tags":"startups, family, work/life balance, parenting","level":"Beginner","starts_at":"2019-08-21T18:30:00.000Z","ends_at":"2019-08-21T19:10:00.000Z","created_at":"2019-06-08T02:03:25.579Z","updated_at":"2019-07-26T02:25:47.044Z","room":"405","presenter":{"name":"Wendy Gwo","bio":"Wendy is a software engineer in Los Angeles. She loves all things tech, and started off as an electrical engineer before transitioning into front end web development 4 years ago.\r\n\r\nShe’s currently a senior software engineer at Aspiration in Los Angeles, where she gets to play with React and GraphQL to build great experiences for both internal and external customers.\r\n\r\nOutside of work, she loves traveling, exploring the great outdoors, eating carbs, and chasing around her rambunctious toddler."},"url":"https://codeandsupply.co/event_sessions/73.json"},{"id":28,"title":"A Better Approach to Observability","body":"Do you measure and monitor your applications by alerting on metrics like CPU, memory usage, and request latency? Do you get large numbers of false positives, and wish you had fewer useless messages cluttering up your inbox? What if there were a better way to monitor your distributed systems that resulted in far more signal — and much less noise?\r\n\r\nIn this talk, we'll share an approach that's effective at measuring and monitoring distributed applications and systems. Through the application of a few simple core principles and a little bit of mathematical elbow grease, firms we've tried this with have seen significant results. By the end, you'll have the tools to ensure your applications will be healthier, more observable, and a lot less work to monitor.","tags":"metrics, observability","level":"Advanced","starts_at":"2019-08-21T19:25:00.000Z","ends_at":"2019-08-21T20:05:00.000Z","created_at":"2019-06-08T02:03:24.948Z","updated_at":"2019-07-26T02:25:47.052Z","room":"301/302","presenter":{"name":"John Feminella","bio":"John Feminella is an avid technologist, occasional public speaker, and curiosity advocate. He serves as an advisor to Pivotal, where he works on helping enterprises transform the way they write, operate, and deploy software. He's also the cofounder of a tiny analytics monitoring and reporting project called UpHex.\r\n\r\nJohn lives in Charlottesville, VA and likes meta-jokes, milkshakes, and referring to himself in the third person in speaker bios."},"url":"https://codeandsupply.co/event_sessions/28.json"},{"id":82,"title":"How Games Can Inspire Great Application UX","body":"What makes a great UX for games and what does it mean for mobile applications?\r\n\r\nI interviewed Raph Koster, the famous game designer and author of 'The Theory of Fun' about his principles of game design. I was convinced games and apps were two different worlds and there was little to borrow except maybe come cool graphic animation tricks.\r\n\r\nRaph completely destroyed my arguments. This talk is my journey into the light. How I learned that at a very deep level, there is little different between great games and great apps. \r\n\r\nI'll present 6 basic principles of game design and show how each can be applied to app UX design in meaningful ways.\r\n\r\nAn early trial version of this talk was given both at the game research group at Swansea University and internally at Google. The feedback from these versions have caused me to heavily revise and rewrite the talk.","tags":"ux, games","level":"Beginner","starts_at":"2019-08-21T19:25:00.000Z","ends_at":"2019-08-21T20:05:00.000Z","created_at":"2019-06-08T02:03:25.721Z","updated_at":"2019-07-29T00:12:39.766Z","room":"303/304","presenter":{"name":"Scott Jenson","bio":"Scott Jenson has been doing user interface design and strategic planning for over 25 years. He worked at Apple on System 7, Newton, and the Apple Human Interface guidelines. He was UX director of Symbian, VP of product design for Cognima, managed mobile UX for Google and was a creative director at frog design in San Francisco.\r\n\r\nScott returned to Google in November 2013 to lead the Physical Web project. He’s now working in the Android UX research group.\r\n\r\nAs a battle-scarred veteran of the software industry, Scott has shipped a consumer spreadsheet, been a part of 2 Mac OS releases, 5 Newton product cycles, 4 commercial website revisions, designed 3 different mobile phone UIs, sworn at innumerable mobile browsers, and has over 20 patents."},"url":"https://codeandsupply.co/event_sessions/82.json"},{"id":21,"title":"That Product Team Really Brought That Room Together","body":"Much of the organizational problems come from an unexpected place: The Erie Railroad company in the 1850’s. Since this first org-chart, we have sliced our businesses along functional roles. And since those roles vary from slice-to-slice, each slice is evaluated based on different measurements. This is fine, right up until two slices have a relationship in which their measurements - their incentives - conflict.\r\n\r\nIn this talk, the audience will learn the source of this conflict, why the typical org-chart is causing more problems than it’s solving, how Product Teams help prevent code from becoming “Legacy”, and ensure that software is created sustainably.\r\n\r\nThe audience will learn what I consider to be the ideal model for working in a DevOps Culture, and the steps to take to get to the DevOps Promised Land.","tags":"pager, on-call, product, operations, systems, teams, culture, devops","level":"Advanced","starts_at":"2019-08-21T19:25:00.000Z","ends_at":"2019-08-21T20:05:00.000Z","created_at":"2019-06-08T02:03:24.835Z","updated_at":"2019-07-26T02:25:47.096Z","room":"305","presenter":{"name":"Waldo G","bio":"Waldo is a geek, and if you find him odd, there are plenty of things you could blame that on.  He's a long-time Sys/Ops Engineer, enjoys leading teams, and is active in the DevOps community.  He has never been seen at the same time as Batman.  He is pretty keen on helping orgs stop hurting themselves, insight tooling (trending / monitoring / alerting), and automation in general, and actually enjoys public speaking.  He hates writing about himself in the third person, and aspires to one day be a better bio writer.\r\n"},"url":"https://codeandsupply.co/event_sessions/21.json"},{"id":110,"title":"ARCore Parkour: Building Your First Augmented Reality App","body":"Today there are lots of case studies for Spatial Computing (Augmented Reality, Virtual Reality, Mixed Reality etc) in education and entertainment. Unfortunately, the newly released ARCore features like Augmented Images still lack tutorials and practical examples.  \r\n\r\nIn this interactive session, Noble Ackerson, a seasoned Technical Product Lead and GDE, shares insights with examples through a fun \"choose your own adventure\" technical talk (Bandersnatch-style), on how to build marker-based AR with Augmented Images to create experiences to transform data from the world into practical utility for your users.","tags":"augmented reality, ar, ar foundations, arkit, arcore","level":"Advanced","starts_at":"2019-08-21T19:25:00.000Z","ends_at":"2019-08-21T20:05:00.000Z","created_at":"2019-06-08T02:03:26.125Z","updated_at":"2019-07-29T00:12:39.718Z","room":"306/307","presenter":{"name":"Noble Ackerson","bio":"Noble is a Google Developers Expert for product strategy and a seasoned technical product director delivering vision camera, web and mobile technologies from abstract concepts to final products. He led the award-winning DC-based Augmented Reality for fitness startup, LynxFit, as Product Owner and Co-founder. \r\n\r\nNoble sits on the Alumni Leadership Board for the leading online education startup, Udacity. A member of the Alumni Board at his alma mater, Lynchburg College and acts as the Publicity Chair for Ubicomp and ISWC, two top-tier conferences for the internet of things and wearable technology. When Noble is not focused on product, he is mentoring underrepresented and aspiring developers, speaking at technology events, or spending time with his daughters."},"url":"https://codeandsupply.co/event_sessions/110.json"},{"id":115,"title":"Defending Deep Learning from Adversarial Attacks","body":"Adversarial examples in AI pose an asymmetrical challenge with respect to attackers and defenders. There is a need to empower AI developers to defend deep neural networks against adversarial attacks, and to allow rapid crafting and analysis of attack and defense methods for machine learning models.\r\n\r\nIn this talk we are going to discuss how to provide an implementation for many state-of-the-art methods for attacking and defending classifiers using open source Adversarial Robustness Toolbox. For AI developers, the library provides interfaces that support the composition of comprehensive defense systems using individual methods as building blocks.\r\n\r\nIn addition, using Jupyter notebook we will also show how to leverage attack methods from the Adversarial Robustness Toolbox (ART) into a model training pipeline on Fabric for Deep Learning (FfDL). This notebook trains a CNN model on the Fashion MNIST data set and the generated adversarial samples are used to evaluate the robustness of the trained model.","tags":"deep learning, ai, adversarial attacks, adversarial defense","level":"Advanced","starts_at":"2019-08-21T19:25:00.000Z","ends_at":"2019-08-21T20:05:00.000Z","created_at":"2019-06-08T02:03:26.202Z","updated_at":"2019-07-29T00:12:39.917Z","room":"401/402","presenter":{"name":"Svetlana Levitan","bio":"Developer Advocate with IBM Center for Open Source Data and AI Technologies (CODAIT), Svetlana has been a software engineer, architect, and technical lead for SPSS Analytic components for many years. She represents IBM at the Data Mining Group and is the release manager for PMML and PFA, open standards for predictive model deployment. She is also working with other companies on ONNX, an open model exchange format for deep learning models. Svetlana is a co-organizer of several Chicagoland Meetup groups, including Big Data Developers in Chicago and Chicago Cloud Developers. She has authored several blogs and presented at many conferences and other events. Svetlana loves to learn new technologies and to share her expertise, to encourage girls and women in STEM. "},"url":"https://codeandsupply.co/event_sessions/115.json"},{"id":160,"title":"Follow Your Feedback","body":"As developers we are often using feedback systems that are under our control: tests, tools, technical interview questions, and more. But too often we forget to listen to the feedback from the systems themselves. Are your tests effective? Do your command line tools provide users with useful output? Are your technical interviews producing strong indicators about candidates’ potential?\r\n\r\nIn this talk I discuss feedback systems, aspects of good feedback, and how to setup feedback loops on the systems themselves.","tags":"","level":"","starts_at":"2019-08-21T19:25:00.000Z","ends_at":"2019-08-21T20:05:00.000Z","created_at":"2019-06-11T00:23:47.396Z","updated_at":"2019-07-26T02:25:47.074Z","room":"403/404","presenter":{"name":"Stephen Ball"},"url":"https://codeandsupply.co/event_sessions/160.json"},{"id":18,"title":"Community Driven Development: Sustainable Open Source for Social Justice","body":"As developers who want to lend our skills to support organizations fighting for social justice, how do we build effective, impactful collaborations with organizations and make the resulting open source projects sustainable? Over two years and 978 commits, we’ll follow the evolution of an open source project built with and for New Sanctuary Coalition, an NYC immigrant rights organization, to help them meet exponentially growing demand for their services following the 2016 election.\r\n\r\nWe’ll examine how having technologists embedded in NSC facilitated the initial application build out through first-hand knowledge of the work the software is supporting, motivation of working alongside a community, and mutual trust with leadership. Through lessons learned in maintaining open source and reflection on how NSC builds community, we’ll talk about the strategies we implemented to recruit and onboard contributors, keep contributors motivated and engaged, and make contributors part of the larger NSC community.","tags":"open source, ruby on rails, social justice","level":"Beginner","starts_at":"2019-08-21T19:25:00.000Z","ends_at":"2019-08-21T20:05:00.000Z","created_at":"2019-06-08T02:03:24.790Z","updated_at":"2019-07-29T00:12:39.668Z","room":"406","presenter":{"name":"Christine Zagrobelny","bio":"Christine is a Ruby engineer, open source maintainer, and theatre director. As an engineer at Fractured Atlas, she builds tools to help artists with the business side of their art (fundraising, selling tickets, finding studio/performance space). Outside of work, Christine maintains open source software to support the work of an NYC immigrant rights organization (New Sanctuary Coalition) and is an organizer for RailsBridge NYC. She is driven and inspired by the potential of technology to enable small organizations with limited resources to maximize their impact."},"url":"https://codeandsupply.co/event_sessions/18.json"},{"id":127,"title":"Negotiate Like a Badass","body":"Technical folx often don't negotiate, and when we do, we often undersell ourselves. Over the course of our careers, missed opportunities to ask for more financially can add up to a substantial loss. In this talk, I'll go over best practices for negotiating; highlight some key issues for women and under-represented minorities specifically; and address how to prepare for different types of negotiations. \r\n\r\nThere will be some exercises to help audience members identify specific areas to practice or research in preparation for a possible upcoming negotiation.","tags":"negotiations, professional development","level":"Beginner","starts_at":"2019-08-21T20:20:00.000Z","ends_at":"2019-08-21T21:00:00.000Z","created_at":"2019-06-08T02:03:26.393Z","updated_at":"2019-07-26T02:25:47.102Z","room":"301/302","presenter":{"name":"Marisa Brandt","bio":"Marisa was most recently VP of Engineering at White House Custom Colour, where her teams develop and support a mix of internal applications, software that enables professional photographers to better serve their clients, and direct-to-consumer applications. Prior to joining WHCC, Marisa led two infrastructure and devops teams at the University of Minnesota. She has also served as COO for an early-stage IoT startup and as Head of Product Strategy for Dell’s Cloud Manager software. Earlier in her career, Marisa supported enterprise and large institutional customers as a system administrator, solutions architect, and cloud engineer. Her hobby is collecting graduate degrees: she has an M.A. and a Ph.D. in History from the University of Minnesota, and an M.B.A. from the Carlson School of Management."},"url":"https://codeandsupply.co/event_sessions/127.json"},{"id":1,"title":"Game Development in Eight Bits","body":"The \"8-Bit\" era of the late 1980s brought video games into the home with systems like the Nintendo Entertainment System (NES). Developers of the time produced iconic games and introduced entire genres of video game that are still with us to this day, all while working with limited hardware that required inventive approaches. This talk will explore how NES developers created more with less, looking at techniques and algorithms used in professionally-developed NES games to handle physics, collision detection, randomness, data compression, and more.","tags":"computing,nes,game development,retrogaming,physics,compression","level":"Beginner","starts_at":"2019-08-21T20:20:00.000Z","ends_at":"2019-08-21T21:00:00.000Z","created_at":"2019-06-08T01:11:44.602Z","updated_at":"2019-07-29T00:12:40.006Z","room":"303/304","presenter":{"name":"Kevin Zurawel","bio":"Kevin has been an NES fan since he first played \"Super Mario Bros.\" in 1989. He learned to program out of a love of video games, and ended up with a career in web development. Kevin is currently an Engineering Manager at Snapsheet in Chicago. He has previously spoken on computing history and game development topics at conferences like Abstractions, Node.js Interactive, ForwardJS, and Strange Loop."},"url":"https://codeandsupply.co/event_sessions/1.json"},{"id":137,"title":"The Next Billion Users and the Digital Gender Divide","body":"By the end of 2019, about half of the global population will be online. In many parts of the world, however, internet access is strikingly disparate by gender, preventing women from accessing modern technology. In a world where we access our money, education, and crucial information about daily life from the internet, promoting equal access to the web is key to promoting gender equality on all levels.\r\n\r\nIn this session, we’ll dive into where the next billion users are and what their lives are like, how these users are getting online, and how internet access is a gender equality issue. On the way, we’ll talk about how to design and develop for global users, since these next billion users will soon be key for any global company’s future strategy.","tags":"global internet, gender equality, web development","level":"Beginner","starts_at":"2019-08-21T20:20:00.000Z","ends_at":"2019-08-21T21:00:00.000Z","created_at":"2019-06-08T02:03:26.560Z","updated_at":"2019-07-26T02:25:47.135Z","room":"305","presenter":{"name":"Sara Cashman","bio":"Sara brings together endless curiosity and passion for all the amazing things technology can do to build clean, performant front-end experiences. She is currently on the front end team for a niche e-commerce company, where accuracy, performance, and cross-browser functionality are key. She also believes in the power of community and lifting up other people into where they want their tech careers to go. A previous Chapter Leader for Girl Develop It, Sara co-founded Inclusive Tech Lab to focus on bringing the abundance of tech talent in the Boston area and those who want to learn those skills together. When she's not stuck in an internet rabbit hole, Sara loves volunteering at the Museum of Fine Arts, getting outside on a hike or to the beach, and reading."},"url":"https://codeandsupply.co/event_sessions/137.json"},{"id":112,"title":"Be the \"Bootstrap\":  Using Privilege to the Benefit of Others","body":"Recognizing privilege is a good first step towards the road to allyship for underrepresented groups, especially in software.  As with many things though, it is necessary but not sufficient for improving equity, inclusion, and acceptance.  In this talk, we'll discuss ways of using privilege and platform within your company to amplify the voices and presence of those who deserve it most, yet receive in the least.\r\n\r\nA single talk cannot hope to fix or provide solutions to all the problems, but the goal is to provide actionable tools and resources to encourage communication, empathy, and further discussion in your team, company, and the software community as a whole.","tags":"inclusion, diversity, equity, acceptance, visibility, voice, presence","level":"Beginner","starts_at":"2019-08-21T20:20:00.000Z","ends_at":"2019-08-21T21:00:00.000Z","created_at":"2019-06-08T02:03:26.155Z","updated_at":"2019-07-26T02:25:47.128Z","room":"306/307","presenter":{"name":"Jesse James","bio":"Jesse (he/him) is a lover of dogs, cats, and trees.  You'll find him living in the Pacific Northwest of the U.S. with his dog Maddy and cat Poppy.  Currently, Jesse is working as a senior software engineer at Conversa Health, a health and care management software startup in Portland, OR."},"url":"https://codeandsupply.co/event_sessions/112.json"},{"id":106,"title":"Building Confidence in Your Automated Tests","body":"The growth of automation testing in today’s software development organizations is changing the the way we test applications. Software development practices have matured over the last 30 years, to include all forms of testing to verify software quality. In the last ten years, there has been a huge spike in the adoption of automated tests, effectively replacing some of these manual testing practices, and supplementing many traditional testing activities. Many parts of the software development industry, however, are wary of replacing manual testing with automated testing. Not only is there often a lack of confidence in the automation tests, many see automated testing as fragile, unmaintainable, and ultimately, something delivering a low return on investment. Max believes that by employing mature software development techniques, we can achieve robust, maintainable, tests, that deliver confidence of the application under test. In addition to discussing how to structure automated tests that are cleaner, more maintainable and efficient, developer testing, and deployment techniques can be used to programmatically verify test correctness. Drawing on his experiences building test automation, test frameworks and advising organizations to adopt test automation, Max will walk us through how to mature your test automation practices.","tags":"software testing, automation","level":"Advanced","starts_at":"2019-08-21T20:20:00.000Z","ends_at":"2019-08-21T21:00:00.000Z","created_at":"2019-06-08T02:03:26.071Z","updated_at":"2019-07-29T00:12:39.702Z","room":"401/402","presenter":{"name":"Max Saperstone","bio":"Max Saperstone has been working as a Software and Test Engineer for over a decade, with a focus on Test Automation within the CI/CD process. He specializes in open source tools, including the Selenium Tool Suite, JMeter, AutoIT, Cucumber, and Chef. Max has lead several testing automation efforts, including developing an automated suite focusing on web-based software to operate over several applications for Kronos Federal. He also headed a project with Delta Dental, developing an automated testing structure to run Cucumber tests over multiple test interfaces and environments, while also developing a system to keep test data 'ageless.' He currently heads up the development of Selenified, an open sourced testing framework to allow testing of multiple interfaces, custom reporting, and minimal test upkeep. After completing an implementation of the Active Authentication for android devices, he has gotten deep in the mobile testing world, working with open source tools such as Robotium, Selendroid, and Appium, and he most recently became an ASTQB Certified Mobile Tester. His recent efforts have been around DevOps work, architecting and building out pipelines, with an effort on integrating test automation in at multiple levels. In addition to working heavily under the testing umbrella, Max is also an experienced Agile developer, and he is well versed in Agile processes and practices. He is an ICAgile Certified Professional (ICP). Max has spoken at multiple conferences including StarCanada, StarEast, Mobile Dev and Test, and AgileDC, and is currently an instructor for the Mobile Application Testing course.\r\n"},"url":"https://codeandsupply.co/event_sessions/106.json"},{"id":46,"title":"Embrace the Suck: Thoughts on Perseverance ","body":"How do you push through when the client just threw you under the bus for making changes they approved, when Xcode has crashed for the tenth time today, and your boss just said “Java, JavaScript, same thing”? \r\nResearch has shown that grit and perseverance are better predictors of success than self-discipline, but what if you don’t feel like a particularly gritty person? The good news is perseverance is a skill that you can foster and grow. Through tales of both triumph and woe, we will dive into research-based strategies that can be put into practice tomorrow. Whether you’re looking to pull yourself up by the bootstraps or help those you mentor conquer the next hurdle, this talk aims to add some tangible perspective to the elusive concept of grit.\r\n","tags":"soft skills, mental health, mentorship, junior, career","level":"Beginner","starts_at":"2019-08-21T20:20:00.000Z","ends_at":"2019-08-21T21:00:00.000Z","created_at":"2019-06-08T02:03:25.185Z","updated_at":"2019-07-26T02:25:47.142Z","room":"405","presenter":{"name":"Ellen Williams","bio":"An educator turned developer, Ellen discovered her passion for programming while teaching her students how to code. In 2016, she took the plunge and decided to follow her passion by becoming an apprentice at Detroit Labs. Now an iOS developer, Ellen works on apps for a wide range of clients from financial institutions to the auto industry. Ellen often shares her laptop with her cat, Chip. When she’s not in front of a computer Ellen can be found gallivanting the globe in search of new beers. "},"url":"https://codeandsupply.co/event_sessions/46.json"},{"id":54,"title":"Distributed by Design -or- How to Work with a Team in 12 Timezones","body":"At the company I work for, everything we build is distributed; our software and our company itself; my team alone is in 12 timezones. Building distributed systems is notoriously hard, but as they say, “humans are even more difficult.” As we’ve worked to build a purposely distributed team, we’ve faced specific challenges and worked to overcome them directly. We’ve treated our distributed nature as a boon to who we are and how we work, not just a challenging fact of life to be overcome, or a bug to be dealt with.\r\n\r\nThis talk dives into the details of how our company thrives on its distributed model:\r\n\r\n* Why we say \"distributed\" instead of \"remote\" and how that language has been key from day one.\r\n* How have shared values held us together as a group and how have they evolved as we scale from a handful to over 1000 employees?\r\n* What challenges we face on a daily basis being distributed\r\n* What tools and practices we use to over come them\r\n* How we can possibly make it work with a truly global team.","tags":"working remote, distributed systems, teams, communication, diversity","level":"Beginner","starts_at":"2019-08-21T20:20:00.000Z","ends_at":"2019-08-21T21:00:00.000Z","created_at":"2019-06-08T02:03:25.305Z","updated_at":"2019-07-29T00:12:39.594Z","room":"406","presenter":{"name":"Aaron Aldrich","bio":"Aaron Aldrich is a Community Builder at Elastic and a founding organizer of the DevOps CT meetup \u0026 DevOpsDays Hartford. He is passionate for connecting humans and using technology to enhance our need to connect with each other. His writing can occasionally be found on crayzeigh.com or on twitter @CrayZeigh."},"url":"https://codeandsupply.co/event_sessions/54.json"},{"id":156,"title":"Keynote","body":"","tags":"","level":"","starts_at":"2019-08-21T21:00:00.000Z","ends_at":"2019-08-21T21:40:00.000Z","created_at":"2019-06-11T00:21:00.842Z","updated_at":"2019-07-25T18:52:40.350Z","room":"Ballroom I/II/III","presenter":{"name":"Aaron Patterson"},"url":"https://codeandsupply.co/event_sessions/156.json"},{"id":94,"title":"Practical Open Source Security","body":"While 81% of users feel that developers are responsible for security, open source maintainers only rate their own security knowledge as 6.6/10(1). Whether you’re creating, maintaining, or depending on open source software, you have a responsibility to code with a secure mindset and educate yourself on the minimum steps needed to properly secure your open source projects.\r\n\r\nThis talk will cover open source security management from both a proactive and reactive standpoint. We'll start with a basic understanding of the top web application security risks, dive in to monitoring and auditing best practices, take a tour of available tools and walk through how to automate the detection of insecure patterns and outdated libraries affected by known vulnerabilities.\r\n\r\nYou'll leave with actionable steps secure your open source code with confidence.\r\n\r\n1. https://res.cloudinary.com/snyk/image/upload/v1551172581/The-State-Of-Open-Source-Security-Report-2019-Snyk.pdf","tags":"open source, security, code management, devsecops","level":"Advanced","starts_at":"2019-08-22T13:00:00.000Z","ends_at":"2019-08-22T13:40:00.000Z","created_at":"2019-06-08T02:03:25.893Z","updated_at":"2019-07-26T02:25:47.153Z","room":"301/302","presenter":{"name":"Sara Cope","bio":""},"url":"https://codeandsupply.co/event_sessions/94.json"},{"id":34,"title":"Duolingo's Microservice Journey","body":"Applications built on a microservices-based architecture and packaged as containers bring several benefits, but also some pitfalls. In this session, Duolingo, a popular language-learning platform, describes its journey from a monolith to a microservices architecture and its experiences building a global product in the cloud.","tags":"microservices, cloud, aws, amazon, cost savings","level":"Advanced","starts_at":"2019-08-22T13:00:00.000Z","ends_at":"2019-08-22T13:40:00.000Z","created_at":"2019-06-08T02:03:25.036Z","updated_at":"2019-07-26T02:25:47.161Z","room":"303/304","presenter":{"name":"Max Blaze","bio":"Max has been involved in the open source community since the late 90's and fondly remembers his Linux desktop not crashing during the Y2K rollover. After studying Telecommunications, VoIP, and network security at the undergraduate and graduate level, he went on to work for many Pittsburgh-based institutions and startups. He now manage's Duolingo's Operations team, which is responsible for infrastructure stability and security. "},"url":"https://codeandsupply.co/event_sessions/34.json"},{"id":49,"title":"Tracing the Black Box of Serverless","body":"Serverless is often a black box. You write functions then they are invoked on a platform on which you have no real visibility. Sure, there are metrics and logs, but finding the bottlenecks is a huge challenge. Understanding how a function relates to other resources is just as tough. On AWS, a tool that solves these problems is X-Ray. In this talk, I will show you how you can use X-Ray to: \r\n* troubleshoot the more ornery issues with Lambda\r\n* get a better understanding of how functions are invoked\r\n* work with all 3 pillars of observability to get a complete view of your serverless infrastructure\r\n","tags":"serverless, aws, xray, lambda, baby formula","level":"Advanced","starts_at":"2019-08-22T13:00:00.000Z","ends_at":"2019-08-22T13:40:00.000Z","created_at":"2019-06-08T02:03:25.225Z","updated_at":"2019-07-26T02:25:47.199Z","room":"305","presenter":{"name":"Matt Williams","bio":"Matt Williams is one of the Evangelists at Datadog and an organizer of DevOps Days Boston. He is passionate about the power of monitoring and metrics to make large-scale systems stable and manageable. So he tours the country speaking and writing about monitoring with Datadog. When he's not on the road, he's coding. You can find Matt on Twitter at @Technovangelist."},"url":"https://codeandsupply.co/event_sessions/49.json"},{"id":79,"title":"Running Awesome Discovery Projects","body":"The largest risk in any digital project is building the wrong thing. Yet you’re expected to define a project scope and provide an estimate after just a few conversations. Then you have to manage to that budget for the life of the project regardless of what else you learn. This is nuts. One of your most important constraints–budget–is defined when you know the least about the project, the beginning. Running digital projects is hard. When expectations are mismanaged (or forced too early) during initial client conversations, running digital projects is nearly impossible. A few conversations and a quick estimate do not provide what you need to build the right thing.\r\n\r\nDuring this talk, we will discuss how you can implement Awesome Discovery Projects to dive into a project with confidence while removing some of the largest risks. You’ll be armed with a thoughtful, scoped roadmap to provide more accurate estimates and be able to correctly set client expectations for the rest of the engagement.\r\n","tags":"business, project management","level":"Advanced","starts_at":"2019-08-22T13:00:00.000Z","ends_at":"2019-08-22T13:40:00.000Z","created_at":"2019-06-08T02:03:25.676Z","updated_at":"2019-07-26T02:25:47.191Z","room":"306/307","presenter":{"name":"Rob Harr","bio":"As Vice President of Sparkbox Rob is responsible for the operations and financials of the company. With a background in software development, Rob is always ready to challenge the development process. On any given day Rob meets with prospective clients, works with employees, and continues to evolve the business of Sparkbox."},"url":"https://codeandsupply.co/event_sessions/79.json"},{"id":23,"title":"A Mobile App Success Starter Pack","body":"When you’re pitching a mobile app to a prospective client, it’s easy to focus on the app’s raison d’être. A pizza-ordering app should order pizza, a messaging app should send messages, and a game should be fun. For an app to succeed, there are countless other hidden tasks to consider: does your app respond well to poor network connectivity? Is it always clear when it’s waiting on network communication? What happens when you ship the app but need to prevent users from using a broken version? In this talk we’ll look at common examples of the unspoken assumptions made when creating apps—assumptions that clients may have, assumptions users definitely have, and the things no app should leave an App Store without. Using these critical features as a guide, you’ll be better prepared to estimate project length and deliver amazing (and successful) apps.","tags":"mobile, ios, best practices, usability, accessibility","level":"Beginner","starts_at":"2019-08-22T13:00:00.000Z","ends_at":"2019-08-22T13:40:00.000Z","created_at":"2019-06-08T02:03:24.880Z","updated_at":"2019-07-29T00:12:40.056Z","room":"401/402","presenter":{"name":"Jeff Kelley","bio":"Jeff Kelley is a developer at Detroit Labs, where he builds apps in Swift but still has a soft spot for Objective-C. Author of Developing Apps for Apple Watch and Learn Cocoa Touch for iOS, he’s been working with iOS since its infancy in 2008. Jeff is passionate about building usable apps, the open-source community around Apple platforms, and will talk your ear off about electric cars and clean energy. Jeff loves raising his two kids and two dogs, Detroit, and organizing the Motor City CocoaHeads group."},"url":"https://codeandsupply.co/event_sessions/23.json"},{"id":159,"title":"Rapid prototyping with GatsbyJS","body":"Wireframes and mockups often fail to demonstrate the actual experience of a product. Sometimes the released product doesn’t look anything like the designs that were approved. This happens due to technical constraints and edge cases that appear during the development process. We are also seeing an influx of design tools that are promising to improve the design + development workflow but do we really need them? Should we add another tool into our complex workflow or is there a way we can design quickly and collaborate with our colleagues without disrupting the design process?\r\n\r\nEnter the front-end prototype, a sample application where designers can build new features in the browser. Speed is very important when prototyping and the tools we use need to empower us to validate our solutions early and often. With the power of GatsbyJS and a data API, you can build data driven prototypes that brings the experience into user experience. Learn how you and your team can leverage the JAMstack to improve the product development process and break down the barriers between designers and developers.\r\n\r\nThe audience will learn:\r\n\r\n\r\n* What is the JAMstack and why it’s great for front-end prototypes \r\n* How to setup a front-end prototype with GatsbyJS\r\n* How a front-end prototype can improve collaboration \u0026 communication within a team","tags":"","level":"","starts_at":"2019-08-22T13:00:00.000Z","ends_at":"2019-08-22T13:40:00.000Z","created_at":"2019-06-11T00:23:29.535Z","updated_at":"2019-07-26T02:25:47.175Z","room":"403/404","presenter":{"name":"Adekunle Oduye"},"url":"https://codeandsupply.co/event_sessions/159.json"},{"id":8,"title":"The Seven Deadly Sins","body":"Software projects accumulate many kinds of debt. Each debt comes in the form of small qualitative shortcomings we (knowingly or unknowingly) choose to ignore in the name of shipping. They cause friction -- and over time they can combine to easily grind momentum to a halt if left unchecked. While these kinds of debt can in fact be useful (if not necessary) to creating software - teams need to understand the nature of their shortcomings to prevent  \"velocity bankruptcy.\"\r\n\r\nIn this talk we'll discuss the nature of seven oft-overlooked forms of project debt: shortcomings in culture, empathy, discipline, morale, organization, preparedness, and requirements. We'll discuss examples of each, tips on identifying the risks in your own projects, and how to decide when to avoid, mitigate, or accept and track these risks.","tags":"software quality, technical debt, project success, management, communication, company culture, success stories, failure stories","level":"Beginner","starts_at":"2019-08-22T13:00:00.000Z","ends_at":"2019-08-22T13:40:00.000Z","created_at":"2019-06-08T02:03:24.600Z","updated_at":"2019-07-29T00:12:39.481Z","room":"405","presenter":{"name":"Brian McElaney","bio":"Brian McElaney (or \"Mac\" as his friends and coworkers know him) has lead user-focused software teams building everything from medical device monitoring systems to foreign exchange trading platforms. He currently runs the technology team at Think Company - a user experience design firm in Philadelphia focused on enterprise software, process, and service design. When he's not coding Mac cooks competitively, drinks wine professionally as a Level 3 Somm, pretends to like parades, and feels that brunch should be protected by law."},"url":"https://codeandsupply.co/event_sessions/8.json"},{"id":88,"title":"Let’s Play!","body":"Improv games ~ZIP!~ build skills like paying attention ~ZAP!~, switching roles ~ZOP!~, negotiating uncertainty ~...zzZIP?~, and celebrating failure ~ZOP! HURRAH!~\r\n\r\n… and these skills build up to real world benefits like understanding the people around you better, working well in a group, and not being fazed by initial failures.\r\n\r\nNo experience is required, just readiness to jump in. You’ll meet people, learn activities that you can take back to your teams/families/friends, practice and reflect on a variety of skills, and walk out full of joy and energy. Come play with us!","tags":"improv, games, communication","level":"Beginner","starts_at":"2019-08-22T13:00:00.000Z","ends_at":"2019-08-22T13:40:00.000Z","created_at":"2019-06-08T02:03:25.807Z","updated_at":"2019-07-26T02:25:47.183Z","room":"406","presenter":{"name":"Jean Lange","bio":"Jean Lange is really super into: smiling, learning about humans, enjoying the present moment. She likes colors and the daily crossword. She teaches at Academy Pittsburgh (https://academypgh.com/) and LFG (https://www.lfgpgh.com/) Board Game Night, but usually on different subjects."},"second_presenter":{"name":"Remy Porter","bio":"Remy Porter is a \"creative coder\" who mainly works on large-scale art installations, mixing digital technology with sculpture. As the Editor-in-Chief at TheDailyWTF.com, he's an expert in what makes bad code and bad workplaces, and writing articles about them. In addition to writing, Remy dabbles in film, theater, improvised comedy, and music, and is passionate about combining all of those interests into a single process."},"url":"https://codeandsupply.co/event_sessions/88.json"},{"id":148,"title":"TBA","body":"","tags":"","level":"","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-22T14:35:00.000Z","created_at":"2019-06-11T00:14:00.737Z","updated_at":"2019-07-26T02:25:47.214Z","room":"301/302","presenter":{"name":"Karen Sandler"},"url":"https://codeandsupply.co/event_sessions/148.json"},{"id":105,"title":"Modern Application Delivery with AWS, Azure, and HashiCorp","body":"The compatibility between AWS, Azure and HashiCorp tools is very mature, with many production deployments to learn from. In this talk we will demo multiple workflows that have worked well for both AWS and Azure users who utilize HashiCorp tools.  Popular cloud services combined with HashiCorp tools can help you build a reliable application delivery platform.  This talk includes demos for:\r\n\r\nVagrant - Developer environment provisioning\r\nPacker - Machine image build automation\r\nTerraform - Infrastructure provisioning, infrastructure as code\r\nNomad - Cluster scheduler\r\nConsul Connect - Service discovery, service configuration, service mesh\r\nVault - Centralized secrets manager","tags":"vagrant, packer, terraform, consul, nomad, vault, hashicorp, aws, azure, multi-cloud, workflows, automation","level":"Advanced","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-22T14:35:00.000Z","created_at":"2019-06-08T02:03:26.059Z","updated_at":"2019-07-29T00:12:39.708Z","room":"303/304","presenter":{"name":"Gabe Maentz"},"url":"https://codeandsupply.co/event_sessions/105.json"},{"id":20,"title":"The Solopreneurial Dev – a Guide to Making It on Your Own","body":"Many developers find comfort in a standard 9-to-5 environment with a predictable wage, luxurious benefits, and the ability to leave work at the office. But not you. You have bigger ideas than that. To you, code is the ultimate set of legos, and you're ready to build a castle unlike anything that anyone's seen before.\r\n\r\nYou have everything you need to get started within reach. With no more than a laptop, a few books, some grit, and an unlimited quota for Google searches, you can make a bigger difference than you might think.\r\n\r\nThis is the talk I'd wish I had heard before I ventured out on my own. In this talk, you'll gain some practical insight on what you can expect when striking out on your own and learn how you can set yourself up for the best chance of success.","tags":"freelance, business, entrepreneurship, products, saas","level":"Beginner","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-22T14:35:00.000Z","created_at":"2019-06-08T02:03:24.820Z","updated_at":"2019-07-26T02:25:47.255Z","room":"305","presenter":{"name":"Dave Kiss","bio":"I had a pretty early start on this web stuff – I still remember the modem connection sounds of AOL 2.5 emanating from my eMachines desktop like it was yesterday. My first website was a Kool-aid fan site that I built in 2004 (yeah, it’s still up.)\r\n\r\nIn 2012, I started selling my own software online and took a few years to grow the sales to a sustainable level. I did it by extracting my truth from the industry’s smartest brains, applying it to my ideas along the way, and finding out firsthand what did and didn’t work.\r\n\r\nIt’s now my full time job and provides the opportunity to explore my many other interests.\r\n\r\nI get a ton of satisfaction from sharing what I know. Whether it’s helping you write your first few lines of Javascript, making your first online sale, or talking about the importance of meetups, I want to do my best to help you do better work and share what I’ve learned along the way."},"url":"https://codeandsupply.co/event_sessions/20.json"},{"id":53,"title":"Socially Engineering Your Pathway to a Better Team","body":"In the context of information security, social engineering is a practice that can help hackers to acquire personal information, insights, and access. Social engineering techniques can also be used by hackers and non-hackers alike to become more skilled at observing the people around them and making informed decisions that are based on these observations. \r\n\r\nIn this session, you will learn how to take a social engineering approach towards improving your team dynamics, including:\r\n\r\n- Strategies for assessing your team’s current strengths and areas of improvement. \r\n\r\n- Recommendations for developing an action plan to initiate change, and using ongoing observation techniques to effectively manage change. \r\n\r\n- Best practices for resolving conflict, particularly for team members with different communication styles.","tags":"team building, social engineering, security, communication","level":"Beginner","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-22T14:35:00.000Z","created_at":"2019-06-08T02:03:25.287Z","updated_at":"2019-07-26T02:25:47.248Z","room":"306/307","presenter":{"name":"Olivia Liddell","bio":"Olivia Liddell is a Cloud Training Specialist at Cloudbakers. She is a former Chicago Public Schools teacher who now specializes in technology training and change management. She is passionate about teaching, mentoring, and distance running."},"url":"https://codeandsupply.co/event_sessions/53.json"},{"id":47,"title":"In Defence of Boring UX","body":"Wikipedia. Reddit. GitHub. Three popular sites with millions of satisfied users. \r\n\r\nAnd all three look pretty boring.\r\n\r\nBoring is clear and straightforward. It solves key pain points without surprise or delight. And we need a lot more of it.\r\n\r\nMy friendly manifesto deconstructs and defends boring design, using examples from across the web. As I’ve learned, foundational content, code, and design doesn’t necessarily take more time. All you need is the right language and mindset to sell skeptics and stakeholders on the invisible work and unsung work required to build useful and understandable digital products that truly satisfy user needs.\r\n\r\nAnd there’s nothing boring about that.","tags":"ux, content strategy, semantic html, accessibility, boring","level":"Beginner","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-22T14:35:00.000Z","created_at":"2019-06-08T02:03:25.197Z","updated_at":"2019-07-29T00:12:39.514Z","room":"401/402","presenter":{"name":"Ryan Bigge","bio":null},"url":"https://codeandsupply.co/event_sessions/47.json"},{"id":102,"title":"Code \u0026 Fabrication","body":"One hundred and ninety-five speakers, four hundred and fifty suspended glass orbs and a fifty-three-foot long hallway; what do all these things have in common? Technology. Computationally designed, CNC cut, hand assembled, running code across sixty-eight computers these three examples of interactive art represent how technology and fabrication play nice to create something exceptional.\r\n\r\nThis talk will look at lessons from working in the physical world with digital tools and how this intersection creates a challenging set of problems, the solutions to which always lead to a better result. There is a lot to be learned in writing code or designing electronics that go in strange and weird places.\r\n","tags":"code, hardware, electronics, fabrication, making, design","level":"Beginner","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-22T14:35:00.000Z","created_at":"2019-06-08T02:03:26.015Z","updated_at":"2019-07-26T02:25:47.234Z","room":"403/404","presenter":{"name":"Jordan C. Parsons","bio":"Jordan C. Parsons is a graduate of the BArch program at Carnegie Mellon University School of Architecture in Pittsburgh, PA. While at CMU he worked for Golan Levin in the STUDIO for Creative Inquiry. He presented his thesis with Michael Jeffers entitled Recusionism, on computational and algorithmic architecture. After graduating from CMU he spent two years working in Montreal, CA for Rafael Lozano-Hemmer as a digital fabricator and architect. Where he helped create new media artworks across the world. \r\n\r\nHe is currently living and working in Pittsburgh, PA with his wife, and pets. When they are not remodeling their house, he works for Iontank as Technical Director creating interactive art installations and software systems.\r\n"},"url":"https://codeandsupply.co/event_sessions/102.json"},{"id":68,"title":"Those Who Can Do Should Also Teach","body":"Programmers are constantly learning new technologies, especially in the rapidly evolving frontend ecosystem. As a result, developers often find themselves in a teaching role -- whether that means mentoring a colleague, writing blog posts, speaking at meetups, or even teaching more formally at a college or bootcamp.\r\n\r\nSo, how can you teach code more effectively? We'll go over strategies for breaking down information, explaining concepts without jargon, using relevant examples, and engaging learners so that you can be more effective the next time you are in a teaching position.","tags":"teaching, instruction, learning","level":"Beginner","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-22T14:35:00.000Z","created_at":"2019-06-08T02:03:25.503Z","updated_at":"2019-07-26T02:25:47.261Z","room":"405","presenter":{"name":"Ali Spittel","bio":"Ali is a software engineer at DEV. She loves Python, JavaScript, and talking about code. She is most interested in the intersection of programming, art, and education. She's also a distinguished faculty member at General Assembly, where she teaches people how to code.\r\n\r\nWhen Ali's not working, you can find her watching New England sports, competing on CodeWars, taking runs around Capitol Hill, rock climbing, or participating in DC coding community events.\r\n\r\nAli also blogs at dev.to/aspittel where she talks about code and her life surrounding it. Her writing has gotten over a million readers in the past year. She is also a Google Developer Expert and Mozilla Tech Speaker.\r\n\r\n\r\nWhen Ali's not working, you can find her watching New England sports, competing on CodeWars, taking runs around Capitol Hill, rock climbing, or participating in DC coding community events.\r\n\r\nAli also blogs at dev.to/aspittel where she talks about code and her life surrounding it. \r\n"},"url":"https://codeandsupply.co/event_sessions/68.json"},{"id":24,"title":"Improving the Technical Hiring Process for Everyone","body":"Hiring is time consuming and infrequent enough that it’s hard to get sufficient practice, but it has far-reaching consequences for your team’s happiness and productivity. I draw on a broad mix of best practices and personal experience to detail an approach to developing a concrete strategy that addresses your unique hiring needs, including best practices for improving diversity at every stage of the hiring process.\r\n\r\nA successful approach to hiring rests on a strong foundation. I will start by describing how to quickly assemble the building blocks that you’ll need in order to define a hiring strategy. I'll also share real-world examples that take an initial set of requirements for hiring through every stage of the process, from writing a hiring plan and job posting to making decisions after finalist interviews. Throughout, I'll focus on producing reusable materials that will make your initial hiring process more successful and allow you to learn from and iterate on your process in subsequent searches.\r\n\r\nTopics include:\r\n* An approach for developing a hiring strategy\r\n* Writing effective job postings\r\n* Turning a hiring strategy into screening/interview questions\r\n* Developing rubrics to consistently score applicants\r\n* How to iteratively evaluate your hiring processes","tags":"hiring, management","level":"Beginner","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-22T14:35:00.000Z","created_at":"2019-06-08T02:03:24.895Z","updated_at":"2019-07-26T02:25:47.241Z","room":"406","presenter":{"name":"Marisa Brandt","bio":"Marisa was most recently VP of Engineering at White House Custom Colour, where her teams develop and support a mix of internal applications, software that enables professional photographers to better serve their clients, and direct-to-consumer applications. Prior to joining WHCC, Marisa led two infrastructure and devops teams at the University of Minnesota. She has also served as COO for an early-stage IoT startup and as Head of Product Strategy for Dell’s Cloud Manager software. Earlier in her career, Marisa supported enterprise and large institutional customers as a system administrator, solutions architect, and cloud engineer. Her hobby is collecting graduate degrees: she has an M.A. and a Ph.D. in History from the University of Minnesota, and an M.B.A. from the Carlson School of Management."},"url":"https://codeandsupply.co/event_sessions/24.json"},{"id":170,"title":"Distractions","body":"- Pinball arcade\r\n- Board games\r\n- and much more!","tags":"","level":"","starts_at":"2019-08-22T13:55:00.000Z","ends_at":"2019-08-21T19:45:00.000Z","created_at":"2019-07-27T04:12:42.217Z","updated_at":"2019-07-27T04:12:42.217Z","room":"Ballroom I/II/III","presenter":{"name":"Abstractions"},"url":"https://codeandsupply.co/event_sessions/170.json"},{"id":52,"title":"I Took Your Idea and I Made It Better: Design Principles for Non-Designers","body":"Through my post-design-school years, while working both with developers and as a developer myself, I've always gotten the same question: \"So why does *that* look better than *this*?\" \r\n\r\nBy the end of this talk, you should be able to discuss the C.R.A.P. (contrast, repetition, alignment, and proximity) design principles, be able to justify last-minute design decisions, and see the worlds of design, user-experience, and accessibility differently in order to become stronger in your role.","tags":"design, user experience, ux, accessibility","level":"Beginner","starts_at":"2019-08-22T14:50:00.000Z","ends_at":"2019-08-22T15:30:00.000Z","created_at":"2019-06-08T02:03:25.272Z","updated_at":"2019-07-26T02:25:47.267Z","room":"301/302","presenter":{"name":"Bridget Reed","bio":"Bridget Reed is a Philadelphia-based UX engineer, product designer, and speaker, as well as an active member of the Philly tech community. As a career-changer, she has taken part in projects ranging from advertising and branding to apparel and print, email and software to social media and web, with a constant focus on the user. On the rare occasion that she is offline, Bridget can be found hacking together ideas for the “next big” Alexa app, sampling craft beer, digging through crates of vinyl records, and exploring local brunches for the best biscuits and gravy around town."},"url":"https://codeandsupply.co/event_sessions/52.json"},{"id":61,"title":"Fight Code Rot Using Continuous Improvement","body":"What happens when you leave a codebase alone for a year? Would you expect it to still work? What about 5 years? 10 years?\r\n\r\nIf you've experienced you know the answer: it's a whole bunch of work to replatform the code to something more modern, more supported.\r\n\r\nIt doesn't have to be like this.\r\n\r\nWhat if we used continuous integration and deployment techniques to ensure an easier future for ourselves and our future teams? Let's discuss a world in which we can write systems that, to a large degree, can look after themselves when we're not looking.\r\n\r\nIn this session, we'll explore code rot, continuous deployment, and the tools (automated and otherwise) you can use to keep your code alive for a bit longer.","tags":"software-design, continuous-deployment, continuous-improvement","level":"Advanced","starts_at":"2019-08-22T14:50:00.000Z","ends_at":"2019-08-22T15:30:00.000Z","created_at":"2019-06-08T02:03:25.403Z","updated_at":"2019-07-26T02:25:47.273Z","room":"303/304","presenter":{"name":"Gary Fleming","bio":"Gary is an agile provocateur, software crafter, and lean mercenary. His main hobby is to try and help companies to build better software in better ways. Sometimes this is by helping them with the messy human communication side of agile, and sometimes it's through teaching better software crafting practices - but it's usually at least some of each. Coaching, mentoring, writing, and showing; whatever helps in the context. You'll find him at various local meetups trying to both share what he knows and learn from his peers."},"url":"https://codeandsupply.co/event_sessions/61.json"},{"id":146,"title":"How NOT to Review a Pull Request","body":"There are many opinions and techniques for reviewing code. Instead of boring you to death with another philosophical rant, we will explore what not to say to your co-workers. Once our journey is complete, we will have tools to help recognize these non-constructive behaviors before hitting send.","tags":"code review, inclusion, communication, continuous improvement, teamwork, community","level":"Beginner","starts_at":"2019-08-22T14:50:00.000Z","ends_at":"2019-08-22T15:30:00.000Z","created_at":"2019-06-10T14:30:51.872Z","updated_at":"2019-07-30T02:00:51.712Z","room":"305","presenter":{"name":"Aaron Goldsmith","bio":"A DevOps engineer with a critical eye towards communication, mental health, and utilizing cloud computing efficiently."},"url":"https://codeandsupply.co/event_sessions/146.json"},{"id":161,"title":"Building UX Teams","body":"The job of a UX manager is to empower the team to realize its full potential. We see the best in people, and help them capitalize on their strengths and passions. We assemble teams of people that balance each other's differences, and encourage cultures that allow the team to grow and thrive. By doing all this, we help individuals grow and succeed in their careers, while creating teams that are far more than the sum of their parts.\r\n\r\nGreat managers are accelerators and multipliers of success. But it's a tricky job. We've all suffered under bad management at some point in our careers, and know how damaging that can be to individuals and teams. The people on your teams may be wildly different from each other in motivation, communication style, and skill level. Humans are both incredibly rewarding and endlessly complicated. Which is why one of our most challenging tasks  –  building great UX teams  –  requires serious thought and reflection.\r\n\r\nIn this talk, Matt Griffin (Sr. UX Manager, Shopify) will take you through his insights and experiences with forming and developing UX teams at Shopify in Ottawa, and his Pittsburgh UX agency, Bearded.\r\n\r\nHighlights include:\r\n\r\n* Teamwork and collaboration in cross-functional teams, including the role and importance of soft skills\r\n* Seeing beyond titles to the unique shape of a person's skills, experience, and perspectives\r\n* Forming balanced teams that are matched to the work at hand\r\n* Guiding individual career growth by focusing on strengths, motivations, and business needs\r\n* Training your teams at varying levels of experience\r\n* Encouraging a growth culture","tags":"","level":"","starts_at":"2019-08-22T14:50:00.000Z","ends_at":"2019-08-22T15:30:00.000Z","created_at":"2019-06-11T00:24:04.714Z","updated_at":"2019-07-26T02:25:47.299Z","room":"306/307","presenter":{"name":"Matt Griffin","bio":"Hi, I'm Matt Griffin 👋. I lead UX for the Financial Solutions teams at Shopify in Ottawa, Ontario, Canada.\r\n\r\nIn 2008, I founded the web design and UX consultancy Bearded in Pittsburgh, Pennsylvania, which I managed until its completion 8½ years later.\r\n\r\nI've spoken at conferences around the world about design and UX. My writing has been published by both net magazine and A List Apart. \r\n\r\nI'm the director of the documentary film What Comes Next Is the Future. It is the story of Tim Berners-Lee’s creation – how it came to be, where it’s been, and where it’s going – as told by the people who build it.\r\n\r\nPrevious to entering the world of design, I played drums for a handful of indie bands. I was lucky enough to tour all over the world, and play on a fair number of records. Somehow I got sort of famous in Japan, which is a long story."},"url":"https://codeandsupply.co/event_sessions/161.json"},{"id":162,"title":"Observability: The New Watch Word","body":"Without a doubt, security is one of the biggest concerns in application development for the modern dev team. Many approaches have been offered on how to combat security issues and vulnerabilities, however these are often reactive. How can development and DevOps teams be proactive?","tags":"","level":"Beginner","starts_at":"2019-08-22T14:50:00.000Z","ends_at":"2019-08-22T15:30:00.000Z","created_at":"2019-06-11T19:34:34.739Z","updated_at":"2019-07-26T02:25:47.280Z","room":"401/402","presenter":{"name":"PJ Hagerty"},"url":"https://codeandsupply.co/event_sessions/162.json"},{"id":124,"title":"Finding Happiness in Open Source","body":"As technologists have amazing skills and abilities, but for a lot of us the missing piece is finding a way to give back. Join me as I discuss how to get involved in open source helping organizations that support some of the most vulnerable members in our communities -- food banks, diaper banks, animal shelters, and many others. \r\n\r\nWe'll also discuss the benefits, educational, personal and professional, of contributing to projects like these. You will leave having learned how to get involved in areas you’re passionate about to fill this missing piece that will keep you happy throughout your career.","tags":"open source, happiness, doing good, making a difference","level":"Advanced","starts_at":"2019-08-22T14:50:00.000Z","ends_at":"2019-08-22T15:30:00.000Z","created_at":"2019-06-08T02:03:26.344Z","updated_at":"2019-07-29T00:12:39.750Z","room":"403/404","presenter":{"name":"Sean Marcia","bio":"Sean absolutely loves the technical community. He is a tireless do-gooder who created and organizes Code for Good a non-profit that puts on Ruby for Good and Python for good. Sean, at his day job, works to make government more sane. He is committed to making the world a better place. When not programming he loves being outdoors (especially national parks), drinking coffee from Portland, eating dried seaweed and playing with dogs."},"url":"https://codeandsupply.co/event_sessions/124.json"},{"id":9,"title":"Mentoring the Way to a More Diverse and Inclusive Workplace","body":"Often, the endeavors of hiring and mentoring junior engineers and of bolstering diversity and inclusion efforts are seen as “nice to haves” at best and “extraneous” (or even “impossible”!) at worst. But in reality, building diversity and inclusivity and fostering the ability to incorporate junior engineers go hand-in-hand. Engineering teams should approach each of these efforts in service of the other.\r\n\r\nTogether, we'll articulate the value of investing in mentorship efforts in terms of their impact on the ability to attract and retain diversity. You will walk away with a clearer understanding of the connection between the two efforts, and ideas for incorporating mentorship and D\u0026I processes at your place of work.","tags":"diversity and inclusion, mentorship, junior engineers, retention","level":"Advanced","starts_at":"2019-08-22T14:50:00.000Z","ends_at":"2019-08-22T15:30:00.000Z","created_at":"2019-06-08T02:03:24.619Z","updated_at":"2019-07-29T00:12:40.063Z","room":"405","presenter":{"name":"Alexandra Millatmal","bio":"Alex is a programmer with a passion for work that has real-world impact. At Newsela, she writes software that helps students read and teachers teach.\r\n\r\nWhen she's not thinking about refactoring her Ruby or good object-oriented front-end patterns, Alex spends a lot of time thinking about secular space/discourse, ethics in communicating “othered” experiences, how many cats are too many cats, and if she’ll ever write a novel."},"url":"https://codeandsupply.co/event_sessions/9.json"},{"id":133,"title":"Write Code In Production","body":"Teams building data-oriented applications against sensitive or large-scale information often face the problem of how to conduct discovery and work iteratively during development. Often, developers are cut-off from production data sets for security and operational reasons. But this doesn't have to be the case. You can build your system in such a way that analysts can work securely with production data, separate from customers, sharing their work, and performing quality control with real, live, production data. Save on operational overhead and complexity while maintaining security by moving your development environment to production instead of your production environment to your laptop.","tags":"security, privacy, data science, software engineering, software architecture","level":"Advanced","starts_at":"2019-08-22T14:50:00.000Z","ends_at":"2019-08-22T15:30:00.000Z","created_at":"2019-06-08T02:03:26.495Z","updated_at":"2019-07-26T02:25:47.293Z","room":"406","presenter":{"name":"Sam Wilson","bio":"Sam Wilson has been a professional software engineer for over 20 years. He is currently the CTO of Bainbridge Health, a startup that spun out of the Children's Hospital of Philadelphia in 2016 focused on helping hospitals improve the safety and efficiency of the medication administration. Previously he has worked in back-office and analysis applications in the streaming media, e-commerce, education, banking, and payments industries."},"url":"https://codeandsupply.co/event_sessions/133.json"},{"id":65,"title":"Orchestrating Multi-Modal Interactions","body":"The rise of the Natural User Interfaces (NUIs) such as speech-, gaze-, and gesture recognition, as well as the skyrocketing adoption of connected devices such as smart speakers and wearables, has brought in the age of multi-modal interactions. \r\n\r\nThey allow us to create beautifully complex transitions between touchpoints, devices, and input modalities. \r\n\r\nBut tackling such interfaces can be scary and overwhelming. I would like to share the lessons I've learned from creating such experiences for the medical professionals with the Abstractions community. ","tags":"design, ux, vui, nui, multi-modal interfaces","level":"Advanced","starts_at":"2019-08-22T15:45:00.000Z","ends_at":"2019-08-22T16:25:00.000Z","created_at":"2019-06-08T02:03:25.461Z","updated_at":"2019-07-29T00:12:40.073Z","room":"303/304","presenter":{"name":"Anna Abovyan"},"url":"https://codeandsupply.co/event_sessions/65.json"},{"id":130,"title":"Sextech: The Good, the Bad \u0026 the Bias","body":"When it comes to sextech, people often let their imaginations get in the way of the facts. One common reason is that the media likes to focus primarily on VR porn and bang-able robots. In reality these subjects are just a small uncommon sliver on the sextech spectrum. Sextech spans everything from menopause technology and sex-ed apps for teens to teledildonics and erotica audiobooks.\r\n\r\nYou encounter it when you use an app to track your menstrual cycle, talk to an A.I. OBGYN chatbot, or simply just watch pornography.\r\n\r\nIn this talk I'll describe:\r\n\r\n• briefly what sextech is\r\n\r\n• the current biases sextech faces and how they detrimentally impact marginalized groups, lead to sexual abuse and stifle innovation within the industry \r\n\r\n• why sextech is the most lucrative sector of technology based on growth statistics, use-cases and the human experience.\r\n\r\n• why adding “tech\" to the end of “sex” gives us “permission” to start dialogue on a taboo topic. The tech sector is uniquely positioned to remove the stigma surrounding one of the most common human experiences, and this is important for eliminating the professional risk associated with working in sextech. Technology enables bright minds to come forward and provide real world solutions to things like human trafficking, STIs, sexual assault, sex-ed, and more.\r\n\r\n• why being informed on the subject will make you a more well-rounded inclusive technologist and advocate for a more diverse tech industry\r\n","tags":"sextech, teledildonics, tech ethics, diversity and inclusion","level":"Beginner","starts_at":"2019-08-22T15:45:00.000Z","ends_at":"2019-08-22T16:25:00.000Z","created_at":"2019-06-08T02:03:26.447Z","updated_at":"2019-07-26T02:25:47.341Z","room":"305","presenter":{"name":"Alison Falk","bio":"Alison is the founder of Women In Tech PGH \u0026 Sex Tech Space platforms, as well as a front-end software engineer with experience in startup and corporate environments. She is a member of the Women of Sex Tech, a cybersecurity master’s candidate at the George Washington University and a recipient of the the (ISC)2 Center for Cyber Safety Education award. She has also been awarded the RedChairPgh scholarship for leadership as a mid-career woman in IT.  \r\n\r\nIn her free time she enjoys spending time with her pet cockatiel, Stinky (he does not smell bad).\r\n\r\nShe has been featured in WIRED, Women of Silicon Valley, WomenInTech, Female Tech Leaders, WiTech, 96Boards, Pitchwerks, and more."},"url":"https://codeandsupply.co/event_sessions/130.json"},{"id":138,"title":"12 Factor Serverless Applications","body":"The “Twelve-Factor” application model has come to represent twelve best practices for building modern, cloud-native applications. With guidance on things like configuration, deployment, runtime, and multiple service communication, the Twelve-Factor model prescribes best practices that apply to everything from web applications to APIs to data processing applications. Although serverless computing and AWS Lambda have changed how application development is done, the “Twelve-Factor” best practices remain relevant and applicable in a serverless world. In this talk, we’ll apply the “Twelve-Factor” model to serverless application development with AWS Lambda and Amazon API Gateway and show you how these services enable you to build scalable, well built, and low administration applications.","tags":"serverless, 12 factor, api gateway, lambda","level":"Beginner","starts_at":"2019-08-22T15:45:00.000Z","ends_at":"2019-08-22T16:25:00.000Z","created_at":"2019-06-08T02:03:26.575Z","updated_at":"2019-07-29T00:12:39.500Z","room":"306/307","presenter":{"name":"Eric Johnson","bio":"I am a Senior Developer Advocate – Serverless for AWS. My passion is to help other developers embrace the Serverless revolution by escaping the ordinary of server management, and performing the extraordinary through code. I am a sucker for best practices in the serverless world and get giddy when I get a chance to teach others. In my free time, I love relaxing with my beautiful bride and five kids, yes you read right, five. I also fancy myself as a musician, well, at least a drummer."},"url":"https://codeandsupply.co/event_sessions/138.json"},{"id":27,"title":"Promoting Human Flourishing through Ethical Software Development","body":"Have you ever found yourself writing code to do something, and had a general sense of unease, but didn’t have the vocabulary to express what ethical problems you were feeling? What responsibility do we have as a software industry to create ethical software that contributes to human flourishing?  \r\nIn this talk, we assume that many negative outcomes in software have come from well meaning developers, who either didn’t stop to ask the right questions, or didn’t know how to vocalize their concerns.  In this talk, we will examine ethical failures in software systems, and we will observe different categories of these failures.  From each category, we will derive questions that developers can ask to avoid this committing this category of ethical error. \r\nFrom these categories, we will consider three questions that developers should ask themselves to ensure that they are not writing software that is unethical.  \r\nFirst, we will consider the ethical implications of respecting the humanity of your users.  Is it ethical to create systems without considering all the users of the system, not just those who are demographically similar to the development team?  What would it mean to live in a world where every piece of software was designed to respect the humanity of ALL its users?  \r\nSecond, we will consider the ethical implications of the amplifying power of software systems, and what role developers play in amplifying behavior across society.   What would it look like to live in a society where care was taken to amplify the best of humanity, and not just the parts that resulted in the most “engagement”?\r\nFinally, we will consider the role of ethics in quality.  What would a software developers’ “hippocratic oath” look like?  What would it be like to live in a world where software was developed with quality standards that every developer strived to “do no harm”.\r\n\r\nFor each of these questions, in addition to giving developers a series of questions to ask themselves, and a language for expressing ethical concerns, we will also look at solutions that are being developed in these areas, for example GenderMag (http://gendermag.org/) which helps developers overcome gender bias in software, or the latest in algorithmic fairness. \r\n\r\nI look forward to giving this talk, and working towards a world where ethical software is being developed everyday, where users’ humanity is respected by software, where the best of humanity is amplified, and all developers are working to do no harm.  I believe such a world is possible, and that software can be a force for good in the world.\r\n","tags":"ethics, software developement","level":"Beginner","starts_at":"2019-08-22T16:40:00.000Z","ends_at":"2019-08-22T17:20:00.000Z","created_at":"2019-06-08T02:03:24.936Z","updated_at":"2019-07-26T02:25:47.348Z","room":"303/304","presenter":{"name":"Michael Hilton","bio":"Michael Hilton is an Associate Teaching Professor in the School of Computer Science at Carnegie Mellon University.  His passion is for teaching the next generation of software engineers.  Before we returned to academia, he was a developer for almost a decade.  He completed a PhD focused on developer practices, specifically continuous integration.  "},"url":"https://codeandsupply.co/event_sessions/27.json"},{"id":19,"title":"Behind the STACKS: Elevating Independent Musicians Through Community-Based Technology","body":"We are a public librarian developing digital strategies at Carnegie Library of Pittsburgh and a humanities scholar turned software executive. We work together to build STACKS, an ongoing document of Pittsburgh’s vital, evolving music scene. Powered by the open-source platform MUSICat, STACKS shares artist profiles, streaming, and downloads. \r\n\r\nWe build \"with not for\" communities. STACKS draws energy from library practices, programs, and places with community engagement at their core. MUSICat's developers work with librarians and musicians to create ethical tools that respect privacy and enable inclusive and fair licensing and curating practices. We'll share how we're scaling these systems as we keep them grounded in local community values. \r\n","tags":"libraries, music, software development, community management","level":"Beginner","starts_at":"2019-08-22T16:40:00.000Z","ends_at":"2019-08-22T17:20:00.000Z","created_at":"2019-06-08T02:03:24.805Z","updated_at":"2019-07-26T02:25:47.364Z","room":"305","presenter":{"name":"Toby Greenwalt","bio":"Toby Greenwalt (he/him/his) is Director of Digital Strategy and Technology Integration at Carnegie Library of Pittsburgh. Exploring the intersection of community-building and pervasive technology, Toby works to create memorable library experiences for users in the physical space and the virtual space – and everywhere in between. A founding member of the advisory committees for the American Library Association’s Center for the Future of Libraries and the Public Library Association’s Task Force on Equity, Diversity, Inclusion, and Social Justice, Toby writes and speaks frequently on issues related to building community through technology. \r\n\r\nco-presenter Kelly Hiser (she/her/hers) is co-founder and CEO of Rabble, a startup dedicated to empowering libraries to support and sustain their local creative communities. Kelly holds a Ph.D. in music history from the University of Wisconsin-Madison. As a historian she focuses on gender, race, music, and technology; as an entrepreneur and executive she works at the intersections of technology, the arts and humanities, and the public good."},"second_presenter":{"name":"Kelly Hiser"},"url":"https://codeandsupply.co/event_sessions/19.json"},{"id":93,"title":"All! The! New! Things!: Using MVVM, Flow-Coordinators, and RxSwift to Create a Completely Dynamic UI","body":"It seems like everyone is talking about reactive programming and architecture, but it can be difficult to figure how or why to use these tools to actually benefit your work. Faced with the challenge of creating an app with a completely dynamic UI under ever-changing scope and deadlines, my team was able to use MVVM, Flow-coordinators, and RxSwift to adapt to change, manage risk, and tame the chaos. In this talk, we'll discuss the specific problems that each of these frameworks and patterns helped to solve, lessons learned from implementing so many new tools on a single project, and what to consider before using these tools in your own projects.","tags":"frameworks, design patterns, mvvm, rxswift, reactive programming, coordinators, mobile, swift, ios","level":"Advanced","starts_at":"2019-08-22T16:40:00.000Z","ends_at":"2019-08-22T17:20:00.000Z","created_at":"2019-06-08T02:03:25.877Z","updated_at":"2019-07-26T02:25:47.356Z","room":"306/307","presenter":{"name":"Ellen Williams","bio":"An educator turned developer, Ellen discovered her passion for programming while teaching her students how to code. In 2016, she took the plunge and decided to follow her passion by becoming an apprentice at Detroit Labs. Now an iOS developer, Ellen works on apps for a wide range of clients from financial institutions to the auto industry. Ellen often shares her laptop with her cat, Chip. When she’s not in front of a computer Ellen can be found gallivanting the globe in search of new beers. "},"url":"https://codeandsupply.co/event_sessions/93.json"},{"id":104,"title":"Developers Should Not Become Managers (Unless They Should)","body":"Too often, developers move into management roles for the wrong reasons and without adequate preparation. The erroneous view that management represents a promotion for developers causes mismatched expectations and undue stress on new managers and their teams. We need to talk about what management really is and why it's so difficult for developers to succeed. If you've ever thought about becoming a manager or are afraid you may one day be forced to, come hear what it's really like so you can make an informed decision about where to take your career.\r\n\r\nAs a developer-turned-manager, Jamie has stumbled over enough of the hurdles making the transition to clearly explain why you should absolutely not follow the same path he did (unless maybe you should).","tags":"management, career","level":"Beginner","starts_at":"2019-08-22T17:35:00.000Z","ends_at":"2019-08-22T18:15:00.000Z","created_at":"2019-06-08T02:03:26.046Z","updated_at":"2019-07-26T02:25:47.372Z","room":"301/302","presenter":{"name":"Jamie Strachan","bio":"Jamie currently manages a team of developers at Loopio after spending 15 years as a web developer himself. He's (mostly) traded in coding for coaching and strives to help the developers around him be as effective as possible by being a facilitator, an advocate, and an advisor. He also shares his experience with depression to help combat the stigma surrounding mental health issues."},"url":"https://codeandsupply.co/event_sessions/104.json"},{"id":14,"title":"Readability \u0026 Web: Let's Build Great Inclusive Projects","body":"Reading is not an easy thing. Even if we are used to having our eyes going through an important quantity of content every day, this action still requires a lot of energy and mechanisms in our head. And it is even more complex for people with reading or cognitive impairments.\r\nThe reading experience is highly dependent of the medium and the context.\r\nUnfortunately, our bright displays are definitely not our best allies to help us read more efficiently. \r\n\r\nLuckily for all our users and visitors, there is a lot of small improvements and tips every designer, content-writer and developer can do in a project to improve the life all of our users.\r\nLet see together how reading on screen works for our eyes and our brain, then we will find together ways to help people with reading impairments and/or limited attention span to have a better access to our content.\r\n","tags":"accessibility, cognitive disabilities, readability","level":"Beginner","starts_at":"2019-08-22T17:35:00.000Z","ends_at":"2019-08-22T18:15:00.000Z","created_at":"2019-06-08T02:03:24.707Z","updated_at":"2019-07-26T02:25:47.381Z","room":"303/304","presenter":{"name":"Damien Senger","bio":"I’m a queer Design systems \u0026 Accessibility lead working in the healthcare industry for Castor EDC. Speaker, teacher and passionate about too many things, I am fighting every day for a more inclusive web.\r\n\r\nThrough my different projects, I am trying to make the Web a more inclusive and accessible place, while focusing on collaboration and mentoring. By the way, I’m agender, so my pronouns are they/them."},"url":"https://codeandsupply.co/event_sessions/14.json"},{"id":107,"title":"Handling Customer Feedback","body":"For every new feature comes a new feature request, or so it would seem once a software project has more than a handful of users or \"customers\". In this talk we'll examine sources of customer feedback, ways to collect and curate it, and talk about how to balance the wisdom of the crowd vs. well-intentioned product direction. While I can't tell you what percentage of your time should be spent on bugs vs. new things, I can give you an understanding of what this space looks like at scale: direct from the owner of the customer feedback process at GitHub.\r\n\r\nWith examples coming from a well-known product like GitHub, my hope is that the audience will be able to draw parallels to their own experiences regardless of the size of their project. We will talk about things that have gone well and things that have not and the lessons we learned from it over the last 5 years at GitHub. We will take a deep dive into what happens when you don't do a good job of listening to customers and compare that to the behaviors of a project that has become customer obsessed. \r\n\r\nFinally, we've been through a lot of iterations of how best to handle customer feedback. We'll talk about the things you can do on the cheap and the type of stuff that makes sense at larger scale (aka, it'll cost ya). We'll also talk about the ideal state, which includes some thoughts and opportunities that currently sound good on paper but haven't been tested in our own crucible of enterprise and open source experience. \r\n\r\nThe ultimate goal is to give you all some ideas of how to handle feedback for your own project or projects while giving you a little reassurance that it's OK to not totally nail this area. It's hard to do well and there's no such thing as permanent perfection. At the end of the day, handling customer feedback is all about empathy and giving it the best shot you can with the resources you have makes you a better technologist and builder of things. It's the thought that counts and a little execution goes a long way toward giving someone a better day!","tags":"github, product management, customer feedback, prioritization","level":"Advanced","starts_at":"2019-08-22T17:35:00.000Z","ends_at":"2019-08-22T18:15:00.000Z","created_at":"2019-06-08T02:03:26.085Z","updated_at":"2019-07-29T00:12:39.429Z","room":"306/307","presenter":{"name":"Greg Padak","bio":"Greg has been in the dev tools software industry for about a decade, working in direct support of development and operations teams for about half of that time and spending the last 5 years at GitHub. As a customer facing human at GitHub for 4.5 of those years, Greg amassed a lot of experience in dealing with the strategic and tactical needs from a variety of folks, both in enterprise and open source. Greg took that valuable experience into his latest job as a member of the product management team at GitHub, working daily on building and improving the experience for all of GitHub's 35+ million users. Outside of the work life Greg owns all of the equipment needed to snowboard, stay fit, and competitively game but let's be honest... he's not really good at any of that. Instead he spends most of his free time with his young pup Josie the labahoula."},"url":"https://codeandsupply.co/event_sessions/107.json"},{"id":77,"title":"For the Love of Logs","body":"Logs: they're just simple lines of text, right? How is something so small and seemingly uncomplicated actually so important and...complicated? Whether your logs are still hanging out on your hosts without centralization or you currently manage an ELK stack, this talk will explain why you should be as obsessed about logs as I am.\r\n\r\nTopics covered:\r\n* Who loves logs across an entire organization and what they do for the people who love them\r\n* What makes a good log including formatting, keys, etc.\r\n* How log centralization was implemented in a small Rails shop\r\n* How that simple implementation saved a lot of headaches and provided simple but essential observability\r\n* How I improved log standardization and utilization at massive scale across various microservice infrastructures\r\n* What considerations you need to make for logging at massive scale at both application and infrastructure levels","tags":"logging, devops, sre, observability","level":"Beginner","starts_at":"2019-08-22T17:35:00.000Z","ends_at":"2019-08-22T18:15:00.000Z","created_at":"2019-06-08T02:03:25.649Z","updated_at":"2019-07-29T00:12:39.928Z","room":"401/402","presenter":{"name":"Aly Fulton","bio":"Senior Site Reliability Engineer at npm, Inc. I really love performant systems, empathetic teams, and logs."},"url":"https://codeandsupply.co/event_sessions/77.json"},{"id":111,"title":"One Codebase to Rule Them All - Using React Native Everywhere","body":"With React Native and tools like React Native Web, React Native Dom, and React XP it is possible to share nearly all of the same code between web, iOS, Android, and Windows apps. With the addition of Electron, that same codebase can be used to create Mac and Linux apps too! This talk will go through some of the leading approaches and provide real world examples of production apps using these technologies.","tags":"react native, react, react xp, react native web, react native dom, javascript, mobile, desktop","level":"Advanced","starts_at":"2019-08-22T17:35:00.000Z","ends_at":"2019-08-22T18:15:00.000Z","created_at":"2019-06-08T02:03:26.139Z","updated_at":"2019-07-26T02:25:47.399Z","room":"403/404","presenter":{"name":"Jesse Raymond Weigel"},"url":"https://codeandsupply.co/event_sessions/111.json"},{"id":164,"title":"Pass the Torch and Drop the Ball: Lessons in Documenting Your Work","body":"A replacement plan or document is a great resource, even when you’re not being replaced or looking for a new gig.\r\n\r\nA year ago, as the role of OpenStack community manager at Red Hat was moving from one person to another, we started thinking about what needs to be in place to effectively transition a role. More generally, we started thinking about planning, and documenting, for your eventual replacement.\r\n\r\nWe’ll talk about what worked, what didn’t, and what had unexpected benefits for the larger community.\r\n","tags":"documentation, career","level":"Beginner","starts_at":"2019-08-22T17:35:00.000Z","ends_at":"2019-08-22T18:15:00.000Z","created_at":"2019-07-03T02:39:54.064Z","updated_at":"2019-07-26T02:25:47.414Z","room":"405","presenter":{"name":"Mary Thengvall","bio":"Mary Thengvall is a connector of people at heart, both personally and professionally. She loves digging into the strategy of how to build and foster developer communities and has been doing so for over 10 years. After building community programs at O’Reilly Media, Chef Software, and SparkPost, she’s now consulting for companies looking to build out a Developer Relations strategy. In addition to her work, she's known for being \"the one with the dog,\" thanks to her ever-present medical alert service dog Ember. She's the author of the first book on Developer Relations: The Business Value of Developer Relations (© 2018, Apress).\r\n\r\nMary is founder and co-host of Community Pulse, a podcast for Developer Relations professionals. She curates DevRel Weekly, a weekly newsletter that brings you a curated list of articles, job postings, and events every Thursday. She's also a founding member and \"Benevolent Queen\" of the Evangelist Collective Slack team.\r\n\r\nMary is also a member of Prompt, a non-profit that encourages people to openly talk about mental illness in tech. She speaks at various conferences and events about building and fostering technical communities as well as how to prevent burnout in yourself and your team."},"url":"https://codeandsupply.co/event_sessions/164.json"},{"id":129,"title":"It Is Correct, But Is It Fast?","body":"Ruby is optimised for happiness, we tell ourselves when we write beautiful code. We’ve written our acceptance and unit tests. What else is there to do? Nah, we don’t need to worry about performance. \r\n\r\nSometimes, though, things turn sour when your beautiful code meets reality and the data processing consumes all of the server’s resources. There are no magic bullets that can instantly detect performance and scaling issues in our code, but there are techniques that can help. \r\n\r\nIn this talk, you’ll learn all about the benefits of writing performance assertions in a test suite. You’ll see how a seemingly reasonable algorithm in fact exhibits abysmal performance and doesn’t scale. We’ll explore two different types of performance assertions that can be used to establish the performance characteristics of our example. Once we’ve done that, from then on, only hard cold measurements will guide us in refactoring the code to be more performant.\r\n\r\nYou will leave equipped with the techniques to help you learn how fast your code really is. Let’s put a stop to slow code and remove all of those pesky performance bugs!","tags":"performance testing, testing, ","level":"Advanced","starts_at":"2019-08-22T18:30:00.000Z","ends_at":"2019-08-22T19:10:00.000Z","created_at":"2019-06-08T02:03:26.427Z","updated_at":"2019-07-26T02:25:47.424Z","room":"301/302","presenter":{"name":"Piotr Murach","bio":"Piotr is a software engineer building things on the web. He has a special interest in tooling, automation, and testing. He is a creator of over 50 Ruby gems including a framework called TTY for building intuitive and sleek command line applications. If you're interested in his ruminations on software, technology and more, visit piotrmurach.com"},"url":"https://codeandsupply.co/event_sessions/129.json"},{"id":155,"title":"Building Afghanistan 2.0 with #AfghanGirlsCode","body":"Code to Inspire empowers young women in developing countries to drive economic and social progress by teaching them how to code, find programming jobs and launch technology ventures. Code to Inspire (CTI) was established in 2015 starting in Afghanistan as the first coding school for young women by Computer Science Professor and former refugee Fereshteh Forough. The nonprofit training program has taught 150 young women how to code, build mobile apps and games. Over 70% of graduates have found work, earning above-average wages in their country.","tags":"","level":"","starts_at":"2019-08-22T18:30:00.000Z","ends_at":"2019-08-22T19:10:00.000Z","created_at":"2019-06-11T00:19:12.412Z","updated_at":"2019-07-26T02:25:47.432Z","room":"303/304","presenter":{"name":"Fereshteh Forough","bio":"Fereshteh Forough is the Founder and CEO of Code to Inspire.\r\n\r\nAs a refugee born I learned, Great things can start with empty hands!\r\n\r\nFereshteh’s family left Afghanistan early 80s because of the Soviet invasion of Afghanistan. Fereshteh was born in a small town at the border of Iran and Afghanistan. She grew up in a family of eight kids. One year after the Taliban regime collapsed, Fereshteh and her family moved back to Herat, Afghanistan. After returning to Herat, she earned her Bachelor in Computer Science and later her Master’s from Technical University of Berlin in Germany. She taught as a professor at the Computer Science faculty of Herat University for almost three years. In January 2015 she founded the first coding school for girls in Herat, Afghanistan teaching around 150 girls learn to code."},"url":"https://codeandsupply.co/event_sessions/155.json"},{"id":114,"title":"How We Created and Then Worked to Disband A Risk Management Team","body":"As our teams and traffic grew, CoverMyMeds experienced a series of deploy related incidents that ultimately lead to the institution of a heavy risk review roadblock for all production changes.  This new process was enforced by a volunteer team of developers.  In the beginning, it dramatically slowed delivery and frustrated or even angered us.  Over time, we improved both the process and the risk awareness of developers across the company.  After several iterations, we were able to return authority for risk management to the development teams and trusted that there would not be a backslide.  This talk explores the evolution of our pre-deploy risk management process and offers a case study of how we incorporated risk management into our culture so that a prescriptive review process and team to carry it out were no longer necessary.","tags":"risk management, culture, growth, teams","level":"Beginner","starts_at":"2019-08-22T18:30:00.000Z","ends_at":"2019-08-22T19:10:00.000Z","created_at":"2019-06-08T02:03:26.188Z","updated_at":"2019-07-26T02:25:47.472Z","room":"305","presenter":{"name":"Mike Lustig","bio":"Hi!  I'm Mike Lustig.  My wife and I live in the outskirts of Akron, OH with our four awesome daughters.  Together, we learn, play and raise chickens.  I'm a software developer with CoverMyMeds by day and an instructional associate for the Georgia Tech OMSCS by night."},"url":"https://codeandsupply.co/event_sessions/114.json"},{"id":98,"title":"The White Glove Treatment: Polishing Your iOS Build with Jenkins","body":"We use continuous integration and delivery systems to help us build apps all the time. Our pull requests trigger builds that we can test, merging them triggers other builds that we can deploy, and so on. What about all of the other tedious tasks involved in development? This talk will cover using Jenkins, fastlane, and other tools as a system to automatically update an iOS app's dependencies—whether you use CocoaPods, Carthage, or the Swift Package Manager—provide inline feedback on pull requests, and manage tedious distribution work. By the end, you'll have tools at your disposal to let Jenkins do the tedious part of app development, letting you take care of what's actually important.","tags":"ios, automation, ci, jenkins, fastlane, cocoapods, carthage, swift, swift package manager","level":"Advanced","starts_at":"2019-08-22T18:30:00.000Z","ends_at":"2019-08-22T19:10:00.000Z","created_at":"2019-06-08T02:03:25.958Z","updated_at":"2019-07-29T00:12:40.082Z","room":"306/307","presenter":{"name":"Jeff Kelley","bio":"Jeff Kelley is a developer at Detroit Labs, where he builds apps in Swift but still has a soft spot for Objective-C. Author of Developing Apps for Apple Watch and Learn Cocoa Touch for iOS, he’s been working with iOS since its infancy in 2008. Jeff is passionate about building usable apps, the open-source community around Apple platforms, and will talk your ear off about electric cars and clean energy. Jeff loves raising his two kids and two dogs, Detroit, and organizing the Motor City CocoaHeads group."},"url":"https://codeandsupply.co/event_sessions/98.json"},{"id":154,"title":"TBA","body":"","tags":"","level":"","starts_at":"2019-08-22T18:30:00.000Z","ends_at":"2019-08-22T19:10:00.000Z","created_at":"2019-06-11T00:18:55.316Z","updated_at":"2019-07-26T02:25:47.439Z","room":"401/402","presenter":{"name":"Heather Miller","bio":""},"url":"https://codeandsupply.co/event_sessions/154.json"},{"id":140,"title":"Programming Language: Learning to Present, Talk, and Ask Questions in an Inclusive Way","body":"As our tech communities grow more aware of the need to and value of being inclusive and welcoming in our approach, many people still struggle with how to amend their vocabulary and style of speaking to reflect their desire to really be inclusive. The causes for this are many but often include cognitive biases, and a lack of understanding about how to speak in a way that will entice others to hear and listen to what we're saying, and a misunderstanding on how importance words and phrases are to humans. This talk will explore the value of saying things in such a way so as to build inclusivity and connection between people. The talk will provide tools and language attendees can immediately implement to foster greater sense of welcome and community.","tags":"diversity, inclusion, communication, language","level":"Advanced","starts_at":"2019-08-22T18:30:00.000Z","ends_at":"2019-08-22T19:10:00.000Z","created_at":"2019-06-08T02:03:26.616Z","updated_at":"2019-07-26T02:25:47.447Z","room":"403/404","presenter":{"name":"Liam Dempsey","bio":"A community organizer in suburban Philly, Liam Dempsey works to bring people together for the empowerment of all. He’s the co-founder and organizer of the Philly ‘burbs WordPress Meetup. He's co-organized WordCamp Philly from 2012-2018, and was the lead organizer for the last two years. He also served on the organizing team for WordCamp US in 2015 and 2016. Active outside the WordPress community, Liam volunteers in support of unemployed and underemployed people. Liam owns and runs the friendly marketing and design consultancy, LBDesign."},"url":"https://codeandsupply.co/event_sessions/140.json"},{"id":56,"title":"Three or Four Shades of Blues: Success and Failure Adopting Workflow Management Tools","body":"Apache Airflow, Apache Nifi, and AWS Step Functions are tools designed to enable declarative programming workflows. They take existing code and systems and allow users to stitch them together, manage failures and conditional logic, and execution on a schedule from a simple programming interface. These tools are famous for tasks like cron jobs, ETL and machine learning pipelines. While these tools are simple on the surface, adopting them reveals many limitations. This talk covers the successes and failures of utilizing these three projects in succession on a small team. We evaluate each project on their:\r\n\r\n* User experience\r\n* Programming Model\r\n* Deployment Topology\r\n* Scalability characteristics\r\n* Costs\r\n* Design \r\n\r\nWe discuss where each project fails along these dimensions and why we settled on AWS Step Functions for these workloads. We conclude by discussing how these workflow systems can be improved and promising projects on the horizon.","tags":"data engineering, ","level":"Advanced","starts_at":"2019-08-22T18:30:00.000Z","ends_at":"2019-08-22T19:10:00.000Z","created_at":"2019-06-08T02:03:25.332Z","updated_at":"2019-07-29T17:08:35.110Z","room":"405","presenter":{"name":"Jowanza Joseph","bio":"Jowanza Joseph is a Software Engineer at Pluralsight. Jowanza's work focuses on distributed data processing and messaging systems. Previous to Pluralsight, Jowanza worked at Adobe, Edge by Ascential and Zagg. Jowanza contributes to several open source projects and blogs about big data and productivity. "},"url":"https://codeandsupply.co/event_sessions/56.json"},{"id":92,"title":"Architecture and Organization","body":"Drawing on real-life examples from Avvo, Spotify, Adobe and Microsoft, Kevin Goldsmith explores why you should consider changing your organization to improve your architecture and discusses the successes and failures he’s seen around the interplay of organizational models and software architectures. Kevin often visits companies, where he hears about how they struggle to break up monolithic applications or move to a continuous deployment pipeline. Oftentimes, the organizational structure is clearly making their problems harder but is seen as something that can’t be changed. Kevin relates his own journey to a more experimental organizational style. As a developer at Microsoft, Kevin worked in a rigid hierarchy organized around functional areas. The communication flows within the organization dictated the way it structured its libraries and dependencies. This is the essence of Conway’s law. In this case, the company hierarchy and the architecture it produced was often suboptimal for the problem Kevin and his team were solving, but it was the architectural path of least resistance. When Kevin moved to Adobe and became a senior manager, he started to build his organization in the traditional way. Adobe wanted to create a more fluid and agile architecture for its products, but the company struggled to realize these goals because it was it was too hard to work across teams and reporting lines. The company finally started to make some progress as the organization became more fluid and loosely coupled. Kevin then went to Spotify, which had realized this problem early on and restructured its organization in a way that supported the architectural model that it wanted to build. As a vice president of engineering, Kevin was able to see firsthand how the organizational model simplified the architectural challenges that other companies struggled with while also introducing difficulties that other companies were easily able to overcome. When Kevin joined Avvo as its CTO, the company had the same organization and architectural challenges as many other startups, but rather than attack them only from an architectural angle, Avvo experimented with architecture and organization together to improve its legacy systems and help build new ones faster and with higher quality.","tags":"software architecture, organization design, culture","level":"Beginner","starts_at":"2019-08-22T18:30:00.000Z","ends_at":"2019-08-22T19:10:00.000Z","created_at":"2019-06-08T02:03:25.862Z","updated_at":"2019-07-26T02:25:47.456Z","room":"406","presenter":{"name":"Kevin Goldsmith","bio":"Kevin Goldsmith has been a developer, software architect, technology manager, and senior technology executive for over 27 years. He is currently the Chief Technology Officer at Onfido in London, a machine learning and computer vision company helping users own their identities on the internet. Previously, he was the Vice-President of Engineering at AstrumU, a startup whose purpose is to help students find meaningful careers. Kevin was the Chief Technology Officer at legal marketplace Avvo from 2016 through their acquisition in 2018, overseeing all Product Development, Data, Dev Ops and IT teams. For three years, he was the Vice President of Engineering, Consumer at Spotify in Stockholm, Sweden, leading the development of the multi-platform product and streaming services for three years. Kevin spent nine years at Adobe Systems as a Director of Engineering, leading the Adobe Revel product group and the Adobe Image Foundation group. He spent eight years as a developer and development lead at Microsoft in the Windows and Research teams."},"url":"https://codeandsupply.co/event_sessions/92.json"},{"id":116,"title":"Testing Without Examples (With Examples): A Look at Property-Based Testing","body":"Have you ever heard of an example-based test? Chances are, you've written one without even knowing it! Every time we write a test where the input of the test is known, it's an example-based test.\r\n\r\nLet's face it though, example-based tests can be hard to write. \"Did I think of every possible edge case?\" can be a tough question to answer. Sometimes we just don't know. Property-based tests are a great way to find those edge cases and can even help us fully understand how our code behaves under all conditions. Not just the ones we know about.\r\n\r\nIn this session, we'll learn all about the benefits (and drawbacks) of property-based testing through a series of examples using C# and FsCheck.","tags":"testing, quality, unit testing","level":"Beginner","starts_at":"2019-08-22T19:25:00.000Z","ends_at":"2019-08-22T20:05:00.000Z","created_at":"2019-06-08T02:03:26.217Z","updated_at":"2019-07-26T02:25:47.480Z","room":"301/302","presenter":{"name":"John Reese","bio":"John Reese is a professional .NET developer and a Microsoft Certified Professional in C#. He is also an active open source contributor for Exercism, a learning platform used to teach test-driven development. In his free time, he enjoys playing hockey and video games, both of which he takes way too seriously."},"url":"https://codeandsupply.co/event_sessions/116.json"},{"id":22,"title":"Application Roll-Out Strategies - Day 2","body":"Anyone who has deployed an application in production on Kubernetes has felt the pain of “day 2” issues that are often overlooked. After `HelloWorld` is deployed, an application is only as useful as the ability to change it and roll out a new version reliably. \r\n\r\nSeamlessly shift traffic to endpoints of an application by changing the mindset from how or where an application is deployed to just needing to understand it’s access. By applying some simple patterns, we can enable some pretty complex operations against inter-cluster, multi-cluster, as well as non-containerized endpoints.\r\n\r\nIn this talk we’ll discuss how to apply different deployment strategies starting from very simple canary deploys, then to blue/green deploys and finally to more complex multi-cluster black/red strategies. These strategies not only enable simpler deployments but allow for maintenance of infrastructure as well as no risk cluster upgrades. We’ll also look at ways to allow teams to self-manage their application’s Ingress traffic safely and reliably without the risk of causing disruption to others in the cluster.  \r\n\r\nCome see how bridging gap between traditional applications and containers can promote a cloud-native attitude towards infrastructure in the cloud or on-premises and gain better control over how your applications are accessed!\r\n","tags":"kubernetes, devops, application deployments","level":"Advanced","starts_at":"2019-08-22T19:25:00.000Z","ends_at":"2019-08-22T20:05:00.000Z","created_at":"2019-06-08T02:03:24.856Z","updated_at":"2019-07-29T00:12:39.833Z","room":"303/304","presenter":{"name":"Steve Sloka","bio":"Steve Sloka is a Sr. Member of Technical Staff from Pittsburgh, PA currently working at VMware dealing with all things Cloud, Containers, and Kubernetes. Steve is a maintainer of Contour, Gimbal, the Elasticsearch Operator and is a contributor to many other open source projects. Steve is also a Kubernetes contributor and has been working with it since early 2015.\r\n"},"url":"https://codeandsupply.co/event_sessions/22.json"},{"id":145,"title":"Mosaic Theory of Information Security","body":"In finance, a concept called mosaic theory says that non-material information in sufficient quantities can be combined to constitute useful information. Investment analysts using this principle combine non-material information to develop significant insights into companies’ upcoming results without verging into insider trading. \r\n\r\nIn other words, a lot of insignificant details, like you might post to social media, can be combined to deduce significant aspects of your or your organization’s private data. In non-financial information security, a similar principle applies. Small divergences from usual patterns can, when combined together, give a competitor or potential attacker hints about your organization’s strategy, upcoming product launches, or your private personal information. \r\n\r\nIn this talk, we discuss types of information you want to avoid posting about yourself or watch out for in your organization’s social media postings to avoid unintentional disclosures.\r\n","tags":"information security, mosaic theory, finance, privacy","level":"Beginner","starts_at":"2019-08-22T19:25:00.000Z","ends_at":"2019-08-22T20:05:00.000Z","created_at":"2019-06-08T02:03:26.698Z","updated_at":"2019-07-26T02:25:47.521Z","room":"305","presenter":{"name":"Margaret Fero","bio":"Margaret Fero is a Technical Writer at Degreed, where she enjoys helping users track all of their skills regardless of how those skills were developed. She previously documented software for containerized freight shipping."},"url":"https://codeandsupply.co/event_sessions/145.json"},{"id":143,"title":"Celebrating 30 Years and Enhancing the Web Commons","body":"In the past 30 years, the Web Platform has come to enable so much of our modern world. We're all familiar with the most obvious examples, but did you know the Web Platform has been used to create phone applications, games, art, billboards, kiosks, print, television, automobile and appliance interfaces? \r\n\r\nIn this talk, I'll show how pervasive and fundamental the use of web technologies is, and why it's important to protect the commons of the Web Platform. I will present the interesting history of shrewd decisions, happy accidents, struggles and wrong turns that led us to this point.\r\n\r\nThen, we'll take a look at the complex realities of standards work today. How can we tend the Web Platform to keep it flourishing for another 30 years and beyond? What do we need to be prioritizing right now? And how can you get involved from the trenches of web development? \r\n","tags":"web, standardization, community, history, commons","level":"Advanced","starts_at":"2019-08-22T19:25:00.000Z","ends_at":"2019-08-22T20:05:00.000Z","created_at":"2019-06-08T02:03:26.665Z","updated_at":"2019-07-26T02:25:47.514Z","room":"306/307","presenter":{"name":"Brian Kardell","bio":"Developer Advocate at Igalia.  Original Co-author/Co-signer of The Extensible Web Manifesto Co-Founder/Chair, W3C Extensible Web CG Member, W3C (The JS Foundation) Co-author of HitchJS Blogger Art, Science \u0026 History Lover Standards Geek"},"url":"https://codeandsupply.co/event_sessions/143.json"},{"id":149,"title":"TBA","body":"","tags":"","level":"","starts_at":"2019-08-22T19:25:00.000Z","ends_at":"2019-08-22T20:05:00.000Z","created_at":"2019-06-11T00:15:19.467Z","updated_at":"2019-07-26T02:25:47.494Z","room":"401/402","presenter":{"name":"Guillermo Rauch"},"url":"https://codeandsupply.co/event_sessions/149.json"},{"id":85,"title":"From Software Craftsman to Product Owner","body":"Many start-ups are driven by an entrepreneur who is a subject matter expert looking for a technical co-founder.\r\n\r\nThis is a story of a software craftsman who unwittingly became as subject matter expert due to his sons interest in American Ninja Warrior and subsequent success in the related sport.  He quickly saw the need for software that would help run events more efficiently and effectively.  So, he decided to birth a Software-as-a-Service with his high-performance, multi-disciplinary team.\r\n\r\nHe’ll walk through the story of how the SaaS evolved from concept to the standard for the major organizations in the sport in roughly a year’s time.  He’ll punctuate the advantages and disadvantages of being a Product Owner who had previously always been on the side of the technical team.","tags":"object-oriented javascript, html canvas, software craftsmanship, designers, developers, 2d, 3d, visualization","level":"Beginner","starts_at":"2019-08-22T19:25:00.000Z","ends_at":"2019-08-22T20:05:00.000Z","created_at":"2019-06-08T02:03:25.765Z","updated_at":"2019-07-29T00:12:39.655Z","room":"403/404","presenter":{"name":"Ken Auer","bio":"Ken Auer is the founder and Master Craftsman of RoleModel Software.  He is the author of Extreme Programming Applied and a variety of early software patterns works.  For over four decades, he has applied his craft as a leader of high-performance development teams. Ken was introduced as \"the father of Software Craftsmanship\" as the opening keynote speaker at the first Software Craftsmanship North America conference.  Though he occasionally speaks in various venues, he spends most of his time focused on working with his high-performance, multi-disciplinary team to turn others' innovative ideas into well-crafted sustainable software and raising up generations of software crafters through the Software Craftsmanship Academy and RoleModel Software.."},"url":"https://codeandsupply.co/event_sessions/85.json"},{"id":3,"title":"Satisfaction: A Tool to Facilitate Reflective Practice","body":"How does your work make you feel? In the course of developing software, we often ignore how a project affects us personally. All of us have experienced a time when mismanaged feelings and negative sentiment has created developer burnout. If we had better visibility into how our work affects us, we might have opportunities to address these issues before they become disasters. Satisfaction is a tool designed to help developers track their feelings and sentiment as they work so they can be more self-aware about how their job affects them. ","tags":"self-care, mental health, work-life balance, reflective practice","level":"Beginner","starts_at":"2019-08-22T19:25:00.000Z","ends_at":"2019-08-22T20:05:00.000Z","created_at":"2019-06-08T02:03:24.527Z","updated_at":"2019-07-26T02:25:47.527Z","room":"405","presenter":{"name":"Micah Adams","bio":"Micah is a former punk rock kid turned software engineer. He began his career building software for imaging informatics and scientific research, and he's passionate about using data to solve interesting social problems. Micah currently works at Test Double as an engineer and consultant and spends most of his free time writing code and developing data models. "},"url":"https://codeandsupply.co/event_sessions/3.json"},{"id":121,"title":"Deploy a Serverless Language Model API ","body":"This session will serve as an introduction to using GCP's Cloud Run as a service to deploy and host a serverless machine learning prediction API. Python’s FastAI libraries will be used for natural language processing predictions which will be easily triggered using HTTPS requests. During a live demonstration, a trained neural network model will be transferred from a remote Jupyter environment to Google Cloud Storage. A Docker image will then be built to contain this exported model. Then the serverless application will be deployed based on this image. Prediction requests will then be made using Postman. By seeing the workflow first hand, attendees will be able to build upon this example to deploy their own serverless applications and cost-effectively host custom trained machine learning models.\r\n","tags":"fastai, pytorch, nlp, python, machine learning, ai, gcp, docker, cloudrun","level":"Advanced","starts_at":"2019-08-22T19:25:00.000Z","ends_at":"2019-08-22T20:05:00.000Z","created_at":"2019-06-08T02:03:26.297Z","updated_at":"2019-07-29T00:12:39.873Z","room":"406","presenter":{"name":"James Kennedy","bio":"James is a new Pittsburgher and recently joined Mitsubishi Electric to design and sell battery systems for the power grid. He previously worked for several years as an evaluation engineer and data scientist determining the impacts and performance of energy resources on behalf of utilities, public commissions, and state agencies. \r\n"},"url":"https://codeandsupply.co/event_sessions/121.json"},{"id":165,"title":"Keynote","body":"","tags":"","level":"","starts_at":"2019-08-22T20:20:00.000Z","ends_at":"2019-08-22T21:00:00.000Z","created_at":"2019-07-12T00:01:20.016Z","updated_at":"2019-07-26T02:25:47.534Z","room":"Ballroom I/II/III","presenter":{"name":"Simone Giertz"},"url":"https://codeandsupply.co/event_sessions/165.json"},{"id":13,"title":"Analysis of the Feeling of the Attendees to a Talk in Real Time","body":"\r\nIn this talk, we will see how to develop a serverless project to analyze the feelings of those attending a talk in almost real time.\r\nIncreasingly, serverless architectures are more powerful and diverse. There are many projects that can be solved using this type of architectures and in our case, it makes perfect sense.\r\nA good use case is to be able to analyze the feelings of those attending a talk in near real time. We are going to use the technologies offered by Google Cloud. Such as Google Storage, Google Functions, BigQuery or ML Vision API.\r\nWe will see how it is not only simple to implement this project but also can be done in record time and with less than 50 lines of code.","tags":"ai, machine learning, deep learning, sentiment analysis ","level":"Advanced","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T13:40:00.000Z","created_at":"2019-06-08T02:03:24.691Z","updated_at":"2019-07-29T00:12:39.439Z","room":"301/302","presenter":{"name":"Juantomás Garcia Molina","bio":"Juantomás leads Sngular’s Data Science team and is also Chief Envisioning Officer. Since joining Sngular in 2018, Juantomás has leveraged his extensive experience to harness the potential of new technologies and implement them across the company’s solutions and services. \r\n\r\nJuantomás is Google Developer Expert for Cloud and Machine Learning, co-author of the software book La Pastilla Roja and creator of “AbadIA”, the artificial intelligence platform built to solve the popular Spanish game La Abadía del Crimen. He’s an expert on free software technologies and has been a speaker at more than 200 international industry events. Among the various positions he has held during his 20-year career, he has been Data Solutions Manager at Open Sistemas, Chief Data Officer at ASPgems and President of Hispanilux for 7 years. \r\n\r\nHe studied IT engineering at the Universidad Politécnica de Madrid and plays an active role as a tech contributor and mentor to various academic organizations and startups. He regularly organizes Machine Learning Spain and GDG cloud Madrid meetups, is a mentor at Google Launchpad for entrepreneurs and is also an advisor to Penn State University on their Deep Learning hyperspectral Image Classification for EE project.\r\n\r\ntwitter: @juantomas\r\nhomepage: http://www.juantomas.net\r\nlinkedin: https://www.linkedin.com/in/juantomasgarcia/\r\nslideshare: https://es.slideshare.net/juantomas\r\nmedium: https://www.medium.com/@juantomas\r\nvideos: http://www.juantomas.net/entrevistas-videos\r\nGitHub: https://github.com/bazarum\r\n"},"url":"https://codeandsupply.co/event_sessions/13.json"},{"id":37,"title":"No, You DON'T Need a Single-Page App","body":"Are you and your team building a new product and expecting to make it a single-page application (SPA)?  Have you considered all the risks and hidden costs in making a SPA?\r\nIn this talk, you'll learn about when it's appropriate to build a single-page application, the downsides of going single-page too early, and the longer term tradeoffs you make once your application is a SPA.  You'll learn about accessibility, how your users interact with your applications using external tools, and the costs of solving these with SPAs.  The talk will also touch on security, code bloat, fragility, and testability of SPAs.  Then, you'll learn about some alternative solutions.","tags":"javascript,spa","level":"Beginner","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T13:40:00.000Z","created_at":"2019-06-08T02:03:25.074Z","updated_at":"2019-07-26T02:25:47.548Z","room":"303/304","presenter":{"name":"Penny Sheaffer","bio":"Penny works at Pivotal Software, where they've spent the last four years working in different parts of the organization as an engineer, consultant, and solutions architect.  This is Penny's first conference, and they don't know what to say in a bio!"},"url":"https://codeandsupply.co/event_sessions/37.json"},{"id":80,"title":"Building a Better Commonwealth Through Citizen Advocacy","body":"No one thinks about state government providing citizen-centric services and solutions that are couched in user research, but it's true. My team and I are creating those experiences for the State of Pennsylvania in collaboration with the Governor's Office to create governments services and products that are useful and meaningful to Pennsylvanians. By taking human centered design principles and putting them into practice with Governor Tom Wolf's initiatives, we helping to create a new relationship with citizens that will see state government as an ally.\r\n\r\nWhat you'll learn from this presentation:\r\n- Who we are and what we do for PA state government.\r\n- How we implement design thinking to create better experiences.\r\n- How we do research to make sure we're making services that matter to citizens.\r\n- How we define and implement UX at the Commonwealth level.\r\n- How to get involved and inform how to improve services.\r\n\r\nThis presentation is unique to Pennsylvania in a big way, but will give out of state attendees a way to reach out to their respective state governments. What attendees will get from this presentation is how the Commonwealth of Pennsylvania is shifting to a more human-centered approach and how we meet those challenges through our tools, processes and strategies.","tags":"pennsylvania, user research, design, organization","level":"Advanced","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T13:40:00.000Z","created_at":"2019-06-08T02:03:25.691Z","updated_at":"2019-07-29T00:12:39.962Z","room":"305","presenter":{"name":"Tim McKenna","bio":"Tim McKenna is the Director of Experience Design at Pennsylvania Interactive LLC, part of NIC, Inc. at Pennsylvania Interactive, he leads a small team of designers, researchers, and developers in the creation and implementation of products and services that benefit Pennsylvanians everyday. He has over 13 years experience in the design field working in industries from healthcare, technology, artificial intelligence, student financial aid, and advertising. Tim is a past president of AIGA Central PA and Society of Design ad is a current member of InVision's Design Leadership Forum and IxDA. Originally from Pittsburgh, Tim lives in Carlisle, PA. Outside of design and family, Tim is an avid musician and homebrewer. "},"url":"https://codeandsupply.co/event_sessions/80.json"},{"id":43,"title":"Designing More Ethical and Unbiased Experiences","body":"Humans are biased, and sadly, we are not always able to filter our deeply ingrained biases. UX designers and researchers have long understood this, but as we watch major technology companies make significant mistakes with regard to ethics and bias, the cost of not accounting for bias and ethics is becoming more evident and widely known.\r\n \r\nIn this session, we’ll share ways you can empower yourself and your teams to do the right thing for people. Even knowing what pitfalls exist, we still miss opportunities for doing good as a result of our own human biases obscuring our vision. We need tools to explore and challenge our biases in a productive way to deliver better outcomes. We need a set of shared values across all roles in software development and, ultimately, across the industry to promote our common responsibility to deliver the greatest benefit while causing the least amount of harm. How can we work together to intensify the focus on ethical design?\r\n","tags":"ethics, bias, ethical design, inclusion, ai, data","level":"Beginner","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T13:40:00.000Z","created_at":"2019-06-08T02:03:25.149Z","updated_at":"2019-07-29T00:12:39.883Z","room":"306/307","presenter":{"name":"Karen Bachmann","bio":"Karen Bachmann has over 20 years of experience supporting clients in all phases of user-centered design. She has worked with clients in various industries including scholarly publishing, retail, insurance, technology, education, and energy. She uses a wide range of research techniques to explore and define problems thoroughly to help identify the best, holistic solutions that fit the organization's need. Karen regularly presents on research, design, and fundamental professional skills at international and regional professional conferences and to local business groups and meetups."},"second_presenter":{"name":"Carol Smith","bio":""},"url":"https://codeandsupply.co/event_sessions/43.json"},{"id":33,"title":"What Can a Service Mesh Do for You","body":"As companies shift from monoliths to microservices, operations engineers are increasingly turning to a service mesh to achieve load balancing, mutual TLS, request tracing, service discovery, and observability in their highly available distributed systems. In this introduction to service meshes, we’ll explore the two leading tools in the space: Linkerd2 and Istio. Attendees will learn the differences between the two, and how both can be leveraged effectively with a minimal learning curve. When discussing the service meshes, our example microservice architecture will be running on Kubernetes, a brief overview of Kubernetes and microservices will be given as well to help all attendees grasp any concepts used.","tags":"service mesh, istio, likerd2, microservices, kubernetes","level":"Advanced","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T13:40:00.000Z","created_at":"2019-06-08T02:03:25.022Z","updated_at":"2019-07-29T00:12:39.910Z","room":"401/402","presenter":{"name":"Mike Stoltz","bio":"Mike is a Software Engineer at Containership Inc. He has been working with containers and orchestrators for 3 years now, concentrating on Kubernetes for the last 2. He manages the microservice infrastructure of Containership using Kubernetes and was integral in the development of their cluster management platform and provisioning tool."},"url":"https://codeandsupply.co/event_sessions/33.json"},{"id":15,"title":"Improving Design through Test Driven Development","body":"There are numerous benefits to writing unit tests; they help with regression and provide executable documentation. However, there is yet another benefit that seems to go unnoticed. They facilitate good design!\r\n\r\nIn this session, we'll write a program not once, but twice. The first time we won't consider TDD at all. Next, we'll write the same program using TDD and see how different the two approaches truly are. Then we can ask ourselves, what had to change to make the program testable? What can we do now that the program has a suite of tests behind it?\r\n\r\nIf you want to see how leveraging test-driven development encourages a better design, this is the talk for you!","tags":"testing, quality, tdd, unit testing","level":"Beginner","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T13:40:00.000Z","created_at":"2019-06-08T02:03:24.732Z","updated_at":"2019-07-26T02:25:47.564Z","room":"403/404","presenter":{"name":"John Reese","bio":"John Reese is a professional .NET developer and a Microsoft Certified Professional in C#. He is also an active open source contributor for Exercism, a learning platform used to teach test-driven development. In his free time, he enjoys playing hockey and video games, both of which he takes way too seriously."},"url":"https://codeandsupply.co/event_sessions/15.json"},{"id":95,"title":"That Time I Accidentally Built a Sweatshop","body":"When we build software we build experiences, and with that comes ethical responsibility. The poster child for these dilemmas might be variable reward consumer apps, but software for work is even worse! How often do your tools make you angry? How often do they dictate how you work and take away your professional autonomy?\r\n\r\nIn this talk I'll explore my experiences building software for the workplace, the ethical lessons I've learnt, and some of the hidden ethical problems in features of the software you use every day.","tags":"ethics,saas","level":"Beginner","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T13:40:00.000Z","created_at":"2019-06-08T02:03:25.907Z","updated_at":"2019-07-26T02:25:47.594Z","room":"405","presenter":{"name":"Matthew Owen","bio":"I'm a staff software engineer at Flexport, leading our collaboration platform team. Prior to that I worked on software supporting curated content at eBay, and before that as a software engineer at Twice, an intermediated marketplace for second hand clothing.\r\n\r\nIn a past life I was a PM at Torchbox working with NGOs and non-profits, and before that a literature student at the University of Oxford.\r\n\r\nMy daughter was born this year and I hope the future she grows up to is less dystopian than the present, not more."},"url":"https://codeandsupply.co/event_sessions/95.json"},{"id":42,"title":"Coding the Crossfade","body":"When Michael Winslow first decided to place 2 Windows Media Player controls onto a Visual Basic form in the early 2000s, he had no idea that it would lead to a fifteen year adventure as a DJ in Philly! But just like any other DJ, Winslow had to prove himself. All of the fancy tech he created would mean nothing if he could not keep the party moving during song transitions! The key to that: Coding the Crossfade!\r\n\r\nJoin me as I show some key functionality and data needed to make software crossfade like a real DJ!","tags":"engineer development dj music crossfade","level":"Beginner","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T13:40:00.000Z","created_at":"2019-06-08T02:03:25.137Z","updated_at":"2019-07-26T03:21:07.174Z","room":"406","presenter":{"name":"Michael Winslow","bio":"Michael Winslow picked up his love for programming when he was 10 years old writing GW-Basic code on his Tandy-1000. With his passion for designing simple solutions to complex problems, Michael has played key roles at companies like Aramark, Ortho-McNeil, Oracle and Xfinity Mobile. He is currently a DevOps advocate, Agile enthusiast, and dedicated people-leader for the Core Applications group at Comcast.\r\n\r\nSpeakerdeck:\r\nhttps://speakerdeck.com/michaelswinslow/coding-the-crossfade\r\n\r\nPrezi:\r\nhttps://prezi.com/view/j7Gik3rq4WIfob3HaUl0/\r\n"},"url":"https://codeandsupply.co/event_sessions/42.json"},{"id":171,"title":"Distractions","body":"- Pinball arcade\r\n- Board games\r\n- and much more!","tags":"","level":"","starts_at":"2019-08-23T13:00:00.000Z","ends_at":"2019-08-23T20:00:00.000Z","created_at":"2019-07-27T04:25:10.806Z","updated_at":"2019-07-27T04:25:10.806Z","room":"Ballroom I/II/III","presenter":{"name":"Abstractions"},"url":"https://codeandsupply.co/event_sessions/171.json"},{"id":58,"title":"Easy Peasy Accessibility","body":"In a recent audit of the accessibility of the top 1,000,000 home pages, 97.8% of home pages had detectable WCAG 2 failures. We can do better than this!\r\n\r\nLet's take a deep dive into the low hanging fruit of accessibility so we can fix these issues once and for all. We'll go over auditing a site, interpreting the results and implementing solutions.\r\n\r\nIn this session, learn: \r\n\r\n*Some quick and easy 5 minute fixes you can do right now (contrast, fonts and :focus)\r\n*A break down of the images, alt text and links\r\n*Button vs link\r\n*Common mistakes we make with semantics and roles\r\n*How to handle forms\r\n*What's new in WCAG 2.1\r\n*Testing automation (break the cycle of inaccessibility)","tags":"accessibility, building a better web, code for good","level":"Beginner","starts_at":"2019-08-23T13:55:00.000Z","ends_at":"2019-08-23T14:35:00.000Z","created_at":"2019-06-08T02:03:25.358Z","updated_at":"2019-07-29T00:12:39.573Z","room":"301/302","presenter":{"name":"Heather Migliorisi","bio":"As a Senior Software Engineer, Heather is responsible for implementing accessibility solutions for a international, multifaceted corporation on one hand while continuing to on building new features in the GiftCards.com site."},"url":"https://codeandsupply.co/event_sessions/58.json"},{"id":86,"title":"You (Yes, You) Need to Support Junior Developers","body":"\"We just can't find all of the developers that we need to build our product\"\r\n\"Here's a promising developer, right out of code school, why don't you hire her?\"\r\n\"Oh, we don't hire junior developers. Because $REASONS.\"\r\n\r\nLife as a new developer can be frustrating, especially for one coming out of something other than a big-name Computer Science program. They hear about the shortage of developers in the industry, but often find it extremely difficult to get that first job. However, if there are no junior developers, there will eventually be no senior developers. Frequently, companies do not know how to successfully integrate new developers, and the developers lack the experience and confidence to understand their needs. So how can your team be part of the solution?\r\n\r\nIn this session, you will hear from a longtime hiring manager/CTO, who has hired at all experience levels for remote and in-office development teams, and who has successfully onboard and supported entry-level developers at several companies. They will discuss several areas where teams stumble in effectively supporting new developers, and provide actionable techniques that your company can use to make the most of valuable talent out on the job market.\r\n\r\nIt's a cutthroat market for development talent out there. If your company can find and grow new developers when your competitors cannot, you will end up ahead of the game. Plus, you will be helping the future of the industry. Come learn how.\r\n","tags":"","level":"Beginner","starts_at":"2019-08-23T13:55:00.000Z","ends_at":"2019-08-23T14:35:00.000Z","created_at":"2019-06-08T02:03:25.779Z","updated_at":"2019-07-26T02:25:47.613Z","room":"303/304","presenter":{"name":"Wade Minter","bio":"Wade Minter is the Chief Technology Officer for Custom Communications Inc, leading a team of Ruby software developers. He was previously in technology leadership at TeamSnap, Adwerx, and WeaveUp. He is also the arena public address announcer for the NHL's Carolina Hurricanes, a professional wrestling ring announcer, and an improv comedian. He leads a weird life.\r\n"},"url":"https://codeandsupply.co/event_sessions/86.json"},{"id":25,"title":"The EM Kata","body":"Kata is the Japanese word for form.  In the martial arts, it is the series of forms and exercises necessary to support eventually mastery.  Many consider the practice of a given kata to be an individual pursuit, but true masters know that group practice and engagement is essential to true mastery. \r\n\r\nWhat makes a good engineering manager?  What makes a good manager great?  There are a growing number of tomes that explain the path one takes to becoming a manager, but what do you do once you get there?  In this talk, we will explore the exercises required to build the muscles necessary to continue your growth as a leader of people.  Specifically, we will discuss patterns to model, and anti-patterns that you should definitely avoid.  \r\n\r\nWe will explore the differences between mentoring, coaching, and sponsorship as the leader acts as both protege and adviser.  This talk will also explore the concept of secular humanist based servant leadership, and challenge the notion that the engineering leader is first a technical leader.  We will discuss humility as an asset, and stress on the importance of listening as the most essential path towards understanding.  \r\n\r\nFinally, there will be code.  We will discuss how the code we use as leaders can often expose unconscious biases.  The practitioner must be ever aware of these potential blind spots as they continue to grow and share their knowledge with others.","tags":"engineering leadership, management, bias, mentoring, coaching, sponsorship","level":"Advanced","starts_at":"2019-08-23T13:55:00.000Z","ends_at":"2019-08-23T14:35:00.000Z","created_at":"2019-06-08T02:03:24.910Z","updated_at":"2019-07-26T02:25:47.646Z","room":"305","presenter":{"name":"Tramale Turner","bio":"Tramale is an Engineering Manager at Stripe working to build the economic infrastructure of the internet.  Prior to Stripe, Tramale has held engineering leadership roles at companies such as F5 Networks and Nintendo, and technical and marketing leadership roles at Critical Mass and Volkswagen. He has a passion for developing technology leaders at all levels, and is determined to hear underrepresented voices amplified in our industry."},"url":"https://codeandsupply.co/event_sessions/25.json"},{"id":16,"title":"Non-Artificial Intelligence: Modelling Other Minds","body":"Do you want to learn to communicate better, but you don’t know how to? How about with a board game?\r\n\r\nHanabi is a cooperative game with hidden information where the players work together to solve a logic puzzle. Each player must both listen to and speak to other players, imagining what they know and think in order to make sense of the very limited communication that’s allowed. The players build models of each other’s minds by asking themselves questions like: What do I know? What does my partner expect? Why did they choose that move and not another one?\r\n\r\nThis talk will cover the basics of Hanabi and use a variety of gameplay puzzles to ask you to consider how they apply to communication in other domains, like work and relationships. You’ll walk away with new ideas about:\r\n- Basing your assumptions and actions on the goals you share with your partners\r\n- Considering multiple interpretations\r\n- Building expectations and noticing when they’re not fulfilled\r\n- Thinking about what your partner thinks you think\r\n\r\nFinally, you’ll have learned how to play a truly spectacular board game. Come to the game room later to play Hanabi and communicate with others through this excellent medium!","tags":"board games, communication, teamwork, fireworks","level":"Beginner","starts_at":"2019-08-23T13:55:00.000Z","ends_at":"2019-08-23T14:35:00.000Z","created_at":"2019-06-08T02:03:24.761Z","updated_at":"2019-07-26T02:25:47.640Z","room":"306/307","presenter":{"name":"Jean Lange","bio":"Jean Lange is really super into: smiling, learning about humans, enjoying the present moment. She likes colors and the daily crossword. She teaches at Academy Pittsburgh (https://academypgh.com/) and LFG (https://www.lfgpgh.com/) Board Game Night, but usually on different subjects."},"url":"https://codeandsupply.co/event_sessions/16.json"},{"id":84,"title":"What We Learned from Getting 100% of Our Engineers On-Call","body":"This is a talk about scaling engineering culture, disguised as a talk about sustainable on-call rotations in the age of microservices. It is a report on Duolingo’s journey to an on-call ecosystem that includes every single one of our 80+ engineers and on the development of the “on-call pain balancer”, which automatically generates rotations based on team composition, service maturity, and incident statistics. We will share some of the tools and processes that have helped us reduce the burden of being on-call, and how setting out to standardize a single aspect of engineering life opened the door to a much deeper conversation and taught us lessons that went far beyond improving site reliability.","tags":"on-call, microservices, scaling, engineering culture, work-life balance, documentation","level":"Advanced","starts_at":"2019-08-23T13:55:00.000Z","ends_at":"2019-08-23T14:35:00.000Z","created_at":"2019-06-08T02:03:25.752Z","updated_at":"2019-07-26T02:25:47.619Z","room":"401/402","presenter":{"name":"Antonia Scheidel","bio":"Antonia is a Senior Software Engineer at Duolingo, the most popular language-learning platform and the most downloaded education app in the world. She is currently working on building tools to help users take their language learning from the app into the real world and back again. Antonia has been the Tech Lead on several teams and loves building teams as much as building products."},"url":"https://codeandsupply.co/event_sessions/84.json"},{"id":36,"title":"Effective Engineering: Step Away from the Keyboard","body":"A lot of really good engineers make the same mistake: The path to being a better engineer is to “engineer harder”. Instead, engineers should focus on the holistic aspects of working effectively while solo and in teams. In this talk, i’ll cover the “other” skills engineers need, and how to grow them.\r\n\r\nWhen trying to get ahead in your career or just improve as an engineer, time and time again people think the only solution is to either step into the management track, or double down and engineer as hard as they can. If only they can bang out slightly better code, they’ll be that better engineer.\r\n\r\nBut this a myopic and frankly incompatible approach with the realities of engineering in many companies. “The engineer in the corner” is not who you should aspire to be, and increasingly the opportunity to be such an engineer is disappearing. Even in the biggest companies, the lone wolf is a dying breed.\r\n\r\nInstead, engineers should focus on what have incorrectly been labeled as “soft skills”, when in fact it’s really amongst the hardest things to be good at for almost all of us. Communication. Empathy. Collaboration. Problem Solving (and not just at the code level). Responsibility.\r\n\r\nThese are among the topics I will speak on from my 15+ years of industry experience, working in small and large companies, cross functionally across many different roles. The road to being seen as a leader doesn’t just go through ManagerTown, nor does it only pass through Brilliant Jerksburg. It’s a highway that anyone - lifelong ICs or managerial hopefuls alike, need to focus on as they level up in their career.\r\n\r\nThe goal of this talk to reinforce good practices amongst the audience when it comes to the aforementioned skill sets, and hopefully open the eyes of folks who so far might eschew such things as “not worth it”.","tags":"leadership, engineering, soft skills is a stupid term and everyone needs to stop using it","level":"Advanced","starts_at":"2019-08-23T13:55:00.000Z","ends_at":"2019-08-23T14:35:00.000Z","created_at":"2019-06-08T02:03:25.061Z","updated_at":"2019-07-29T00:12:40.098Z","room":"403/404","presenter":{"name":"Sean Kelly","bio":"I've been lucky enough to work across a number of industries in my 15 years in our field, including medical, energy, advertising, and as of late, security.\r\n\r\nI was fortunate enough to marry a woman who was my best friend, and have been raising our dog and cat together.\r\n\r\nI've been managing a team of 7 (and directing a wider group of nearly 20) for almost 2 years now, and it's given me an eye-opening perspective on all the ways I ruined the lives of my managers in prior jobs (I found one of them and gave him a hug once).\r\n\r\nI love sleep but do not get enough of it."},"url":"https://codeandsupply.co/event_sessions/36.json"},{"id":131,"title":"\t Identity Expression: Coming Out of the Work Closet","body":"The phrase \"coming out of the closet,\" has a ton of connotational baggage. In pop culture, coming out has been reserved for angsty teens, telling friends their big secret set to uplifting rock ballads. But in reality, coming out happens way more than once, including the workplace. What if I told you that most people, not just LGBTQ+ folks, may feel like they have to conceal part of themselves when they start their 9-to-5?\r\n\r\nThis talk will tackle the consequences and implications of identity concealment, and how that can hurt your bottom line and overall success in a company. Creativity, collaboration, productivity and communication are all directly tied to expression, so letting your employees and peers be themselves just makes good business sense.   ","tags":"inclusion, diversity, lgbtq, minorities, equality, design, creativity, engineering, teamwork, culture, collaboration, community","level":"Beginner","starts_at":"2019-08-23T13:55:00.000Z","ends_at":"2019-08-23T14:35:00.000Z","created_at":"2019-06-08T02:03:26.461Z","updated_at":"2019-07-29T00:12:39.535Z","room":"405","presenter":{"name":"Matthew Rogers","bio":"As a recent grad and pseudo-grownup, my passion for engaging with others has mixed with a desire to make things. That power combo has manifested in a career in digital product design, a dedication to user research and experience, and a group of friends and family who wish I would stop talking about color theory so much. "},"url":"https://codeandsupply.co/event_sessions/131.json"},{"id":70,"title":"Y2K Was a Feature: Accounting for Time in Software","body":"Time is a complex mechanism in programming. Whether you’re building a calendar app or a decentralized internet, time will likely play an unexpected role in your software.\r\n\r\nPopular bugs like Y2K have brought a lot of attention to how easily software can overlook such a vital part of everyday life. These bugs may be fun anecdotes, but they illustrate how difficult it can be to successfully account for every edge case time presents. Why is time so hard to deal with? It goes much further than time zones, daylight savings, and leap years.\r\n\r\nAs product designers and developers, it is essential that we better understand the gap between user expectations and the realities of how time operates.\r\n\r\nWe’ll chronicle some time-related programming bugs and what we can learn from them (and laugh at ourselves a little). We’ll also cover how different languages handle time and some best practices for storing, retrieving, and presenting time. Lastly we’ll dive into the special cases to be aware of as we design and build our software.","tags":"time, y2k, time zones, utc, daylight savings, leap years, parsing, javascript, ruby, mysql, postgresql, iso8601, apis","level":"Beginner","starts_at":"2019-08-23T13:55:00.000Z","ends_at":"2019-08-23T14:35:00.000Z","created_at":"2019-06-08T02:03:25.531Z","updated_at":"2019-07-29T00:12:39.826Z","room":"406","presenter":{"name":"Brian Sewell","bio":"Brian is an Engineer at Adwerx in Durham, North Carolina. Although he was born and raised in North Carolina, he welcomes all forms of barbecue. Outside of work, he is a husband, recently new father, and future olympic curling champion."},"url":"https://codeandsupply.co/event_sessions/70.json"},{"id":10,"title":"The Self-Care Project: Refactoring Life, Sharing Issues","body":"We all know about self-care in the abstract. That it's good for us to find work/life balance in an increasingly multi-tasked world. That it's something we all need to be doing more of. However in reality many of us don't pay attention until it's too late. We burn out under a burden of high expectations and low self-esteem. And we struggle to break the cycle of stress and sustain the path to recovery. \r\n\r\nThis is a talk about my ongoing journey - from recognizing symptoms to proactively creating tools and design patterns to help me navigate the stresses that impact my physical and mental well-being. I will start by unpacking the science of stress and it's connection to self-esteem. I'll then share specific strategies I use to combat key issues in my life, and provide a broad design pattern that others can use to create their own self-care toolkits.\r\n\r\nAt the core, it is also a talk about belonging and thriving in an industry that celebrates \"workism\" and denigrates vulnerability. To underscore that no one is alone in this. And that only by sharing our stories, and normalizing these conversations, can we effect productive change that leads to happier people and healthier communities. ","tags":"self-care, stress, toolkit, design patterns","level":"Beginner","starts_at":"2019-08-23T14:50:00.000Z","ends_at":"2019-08-23T15:30:00.000Z","created_at":"2019-06-08T02:03:24.638Z","updated_at":"2019-07-26T02:25:47.658Z","room":"301/302","presenter":{"name":"Nitya Narasimhan","bio":"Nitya Narasimhan is a PhD and Polyglot with over two decades of software research \u0026 development experience across industry, academia and startups. After a decade in research at Motorola, she worked as a software consultant, an adjunct faculty and an engineering lead at a startup before discovering her passion for community.\r\n\r\nShe recently joined the Cloud + AI Developer Relations team at Microsoft as a senior Program Manager, focused on empowering and amplifying community and technology across professional, startup and academic ecosystems. Follow her @nitya or connect with her at #in/nityan"},"url":"https://codeandsupply.co/event_sessions/10.json"},{"id":63,"title":"Positive Sum, Building with Privacy as a Basic Need","body":"Personal data privacy is a hot-button item today. It can often seem overly burdensome for the software developer looking to change the world. Developers and designers may look at regulations and current trends in data privacy as negative impacts to product innovation.\r\n\r\nThis is the wrong lens by which we should look at this.\r\n\r\nIn this talk, Noble shares opportunities to innovate around the growth in data, the growth in regulations like the GDPR. He shares insights on human-centered design opportunities that can help both independent developer or an established corporation. He presents practical examples to minimize the data you collect and best practices on asking for data in software only when it provides value for the user.","tags":"design, privacy by design, software ethics","level":"Advanced","starts_at":"2019-08-23T14:50:00.000Z","ends_at":"2019-08-23T15:30:00.000Z","created_at":"2019-06-08T02:03:25.432Z","updated_at":"2019-07-29T00:12:39.839Z","room":"303/304","presenter":{"name":"Noble Ackerson","bio":"Noble is a Google Developers Expert for product strategy and a seasoned technical product director delivering vision camera, web and mobile technologies from abstract concepts to final products. He led the award-winning DC-based Augmented Reality for fitness startup, LynxFit, as Product Owner and Co-founder. \r\n\r\nNoble sits on the Alumni Leadership Board for the leading online education startup, Udacity. A member of the Alumni Board at his alma mater, Lynchburg College and acts as the Publicity Chair for Ubicomp and ISWC, two top-tier conferences for the internet of things and wearable technology. When Noble is not focused on product, he is mentoring underrepresented and aspiring developers, speaking at technology events, or spending time with his daughters."},"url":"https://codeandsupply.co/event_sessions/63.json"},{"id":39,"title":"Designing for Speech","body":"Speech technology (Speech Recognition, Natural Language Processing, Speech Generation, etc) has dramatically improved over the past several years, which lead to an explosion of speech-ready devices in the consumer space: phones, cars, gaming systems, home assistants, and even TV remotes. It seems like the wild west. \r\n\r\nWhat few people know, though, is that speech technology has been successfully used in healthcare industry for several decades now.\r\n\r\nI believe that Abstractions attendees can benefit from understanding the fundamentals of speech technology, what it is and is not well suited for, how to design, prototype, and test for it, etc. \r\n\r\nIn his talk, I will cover a brief history of the technology itself and focus on outlining design principles for voice user interfaces (VUIs). I will illustrate my points with examples from my own work at M*Modal, including some dramatic mistakes along the way.","tags":"design, ux, vui, speech technology, healthcare","level":"Advanced","starts_at":"2019-08-23T14:50:00.000Z","ends_at":"2019-08-23T15:30:00.000Z","created_at":"2019-06-08T02:03:25.099Z","updated_at":"2019-07-29T00:12:40.104Z","room":"305","presenter":{"name":"Anna Abovyan"},"url":"https://codeandsupply.co/event_sessions/39.json"},{"id":75,"title":"Pedagogy in Pairing","body":"What do you do when a new developer joins your delivery team? What do they need to know to get up to speed? How do you begin to build trust? How does your approach change when working with a junior developer versus someone with a lot of general experience who's new to your specific project? \r\n\r\nFor many of us, the answer involves a lot of pairing. But how can you make the most of it?\r\n\r\nIn this session, you'll learn to teach as you pair in an effective and inclusive way. We'll focus on the five Standards of Effective Pedagogy and Learning as a model for an excellent pair.","tags":"pairing, inclusion, teamwork, knowledge transfer, soft skills","level":"Advanced","starts_at":"2019-08-23T14:50:00.000Z","ends_at":"2019-08-23T15:30:00.000Z","created_at":"2019-06-08T02:03:25.610Z","updated_at":"2019-07-26T02:25:47.689Z","room":"306/307","presenter":{"name":"Aisha Blake","bio":"Aisha Blake has a deep love for the tech community in Detroit. She has taught web development to people of all ages in bootcamps, workshops, and online courses. She currently works as an Application Developer for Detroit Labs. She is down for anything as long as there are puppies and/or karaoke involved."},"url":"https://codeandsupply.co/event_sessions/75.json"},{"id":100,"title":"Consider the Pattern","body":"Software design is hard. That’s why we invented design patterns. Design patterns abstract common approaches to problem solving into generic approaches that can be modified to suit the application at hand.\r\n\r\nMany of the design patterns in common use today are inspired by static object-oriented Enterprise languages like Java and C++. These languages have a feature set that is somewhat more restrictive than the languages that came after them, and many design patterns are built to provide elegant ways around these restrictions.\r\n\r\nDesign patterns, like Dependency Injection, and the Singleton pattern arise from restrictions on how you can pass code around at runtime. The Visitor Pattern arose from a need to safely traverse data structures. Other patterns, like Iterators and Factories, have been replaced by first-class language features of their own.\r\n\r\nIn this talk, we’ll build up several design patterns, and then look at features in newer languages, and newer versions of languages that make each pattern unnecessary. In doing so, you’ll get a view into idiomatically designing code in your favourite language, and a greater understanding of design decisions users of other languages need to make.\r\n","tags":"python, kotlin, java, design patterns, patterns, object-oriented programming, programming, architecture","level":"Advanced","starts_at":"2019-08-23T14:50:00.000Z","ends_at":"2019-08-23T15:30:00.000Z","created_at":"2019-06-08T02:03:25.987Z","updated_at":"2019-07-26T02:25:47.670Z","room":"401/402","presenter":{"name":"Christopher Neugebauer","bio":""},"url":"https://codeandsupply.co/event_sessions/100.json"},{"id":163,"title":"Ready for Takeoff: The Journey from On-Premises to the Cloud","body":"Innovating in a compartmentalized on-premises environment isn’t impossible, but in today’s need-for-speed-workspaces it’s limiting, and things quickly become overburdened. This rings especially true in large organizations as more people and more data weigh things down. This presentation explores the journey of UPMC Enterprises’ adoption of a fail-fast-develop-rapidly mindset, and the pains and gains associated with taking a 250+ person team and their projects to the cloud. From the early days of building core competencies, to standardizing technologies and services, to the evolution of DevOps in the cloud, there’s been a little turbulence – but much more success – so buckle your seatbelt, put your electronic devices in airplane mode, and enjoy the ride.","tags":"aws, cloud, devops, automation, security","level":"Beginner","starts_at":"2019-08-23T14:50:00.000Z","ends_at":"2019-08-23T15:30:00.000Z","created_at":"2019-06-20T15:59:42.459Z","updated_at":"2019-07-29T00:12:40.110Z","room":"403/404","presenter":{"name":"Ken Howard"},"url":"https://codeandsupply.co/event_sessions/163.json"},{"id":99,"title":"Overcoming Challenges: An Attitude of Iteration","body":"Challenges are a very real part of daily life. Some challenges are very apparent, like having one finger on each hand. Other challenges, are less apparent but no less of a hurdle that must be jumped. As someone who was born different and has been challenged through life, I have a very interesting view on hitting challenges head on. I also like to laugh as I deal with these challenges. In this session I we will joke our way through having an attitude of iteration in how we deal with challenges in our personal lives AND in our work lives. Prepare to laugh, commiserate, and face your challenges!","tags":"challenges, laughter, comedy","level":"Beginner","starts_at":"2019-08-23T14:50:00.000Z","ends_at":"2019-08-23T15:30:00.000Z","created_at":"2019-06-08T02:03:25.974Z","updated_at":"2019-07-29T00:12:39.688Z","room":"405","presenter":{"name":"Eric Johnson","bio":"I am a Senior Developer Advocate – Serverless for AWS. My passion is to help other developers embrace the Serverless revolution by escaping the ordinary of server management, and performing the extraordinary through code. I am a sucker for best practices in the serverless world and get giddy when I get a chance to teach others. In my free time, I love relaxing with my beautiful bride and five kids, yes you read right, five. I also fancy myself as a musician, well, at least a drummer."},"url":"https://codeandsupply.co/event_sessions/99.json"},{"id":2,"title":"Ethical Software: How Not to Build Bombs in the Modern Era","body":"\"I made one great mistake in my life - when I signed the letter to President Roosevelt recommending that atom bombs be made\" --Albert Einstein, 6 Nov. 1954\r\n\r\nEthics. It's a complex discipline, and it's rarely as clean cut in the moment as it seems when looking back through the lens of history. So what can you do to ensure your company isn't building bombs? How can you ensure your organization is trying to make ethical choices? Is it ethical to ask engineers to work 80 hours a week during their on call rotations? Is it sustainable? What about the contract the sales team just signed which promises a fully functioning product, from scratch, in less than six months? What do you do when you realize your app is leaking unencrypted data?\r\n\r\nIn this talk, I'll walk you through some of processes that my company has around ethical sales, sustainable workflows, and preventing burnout. I'll talk about what's worked for us \u0026 what hasn't-- from surfacing and discussing ethical concerns to ensuring our development process is sustainable -- both for our employees during a contract's term and for our clients after we hand off the finished product.","tags":"ethics, building process around ethics, what works, what didn't work for us, sustainable engineering, ethical engineering, ethical software, ethical sales","level":"Beginner","starts_at":"2019-08-23T14:50:00.000Z","ends_at":"2019-08-23T15:30:00.000Z","created_at":"2019-06-08T01:58:51.563Z","updated_at":"2019-07-26T02:25:47.683Z","room":"406","presenter":{"name":"Jeri Sommers","bio":"Jeri is a software engineer who graduated from Ada Developers Academy back in 2015. Since then, they have spent a few years working at Microsoft before leaving to join Truss, a software consultancy that has put a *lot* of thought into ethical processes.\r\n\r\nJeri is passionate about ethical software. Case in point: she left Microsoft over their relationship with ICE and joined Truss after asking a lot of questions about how they evaluated incoming contracts."},"url":"https://codeandsupply.co/event_sessions/2.json"},{"id":123,"title":"Using Accessibility as a Bridge Between Design \u0026 Development","body":"Web Accessibility is a team effort, but too often it is just viewed as a technical requirement relying only on the engineering team.\r\nUnfortunately, you cannot deliver an accessible experience if the design and the project itself was not prepared for it.\r\nIn my last projects, I tried to use Web accessibility as a bridge between design \u0026 development and it worked.\r\nNew workflows, new deliverables, new rituals: focusing on making an accessible platform allowed my teams to abolish every wall between each specialties.\r\nLet’s discuss together how we were able to do it and how we documented accessibility and shared accountability between PO, designers and engineers.","tags":"accessibility, collaboration, team work, design, front-end engineering","level":"Beginner","starts_at":"2019-08-23T15:45:00.000Z","ends_at":"2019-08-23T16:25:00.000Z","created_at":"2019-06-08T02:03:26.328Z","updated_at":"2019-07-26T02:25:47.708Z","room":"303/304","presenter":{"name":"Damien Senger","bio":"I’m a queer Design systems \u0026 Accessibility lead working in the healthcare industry for Castor EDC. Speaker, teacher and passionate about too many things, I am fighting every day for a more inclusive web.\r\n\r\nThrough my different projects, I am trying to make the Web a more inclusive and accessible place, while focusing on collaboration and mentoring. By the way, I’m agender, so my pronouns are they/them."},"url":"https://codeandsupply.co/event_sessions/123.json"},{"id":45,"title":"A Bug's Life: What If `Select` Is Broken After All?","body":"Your project's issue list lies dormant for months, years even. Users seem happy enough, and you've got other priorities. Suddenly, a flurry of users report a crazy-sounding bug. They're seeing a crash, triggered with specific keystrokes, with a common operating system. You can't reproduce it. What in the world?!\r\n\r\nYou may have heard the debugging tip from the fantastic book Pragmatic Programmer, \"select isn't broken\". It's always best to assume that bugs are in *your* code. But... what if this one isn't?\r\n\r\nIn this talk, you'll re-experience this unusual low-level bug, and take away some lessons for the kinds of debugging we need to do all the time as software developers.\r\n","tags":"oss, jvm, clojure, linux","level":"Advanced","starts_at":"2019-08-23T15:45:00.000Z","ends_at":"2019-08-23T16:25:00.000Z","created_at":"2019-06-08T02:03:25.174Z","updated_at":"2019-07-26T02:25:47.727Z","room":"305","presenter":{"name":"Colin Jones","bio":"Colin Jones is CTO at 8th Light, where he works with teams to craft reliable, maintainable software. He's into application performance, security, DevOps, architecture, and functional programming. He once wrote a book about Clojure macros that mostly advises you not to use them."},"url":"https://codeandsupply.co/event_sessions/45.json"},{"id":142,"title":"Cross-Site Scripting (XSS) Primer","body":"Cross-site scripting (XSS) is a code injection attack that allows an attacker to execute malicious JavaScript in another user's browser. The attacker's primary target are other users of an application.  XSS scripting is frequently exploited for illegitimate ad injection including click fraud, exploitation frameworks (such as BeEF) to attack the victim’s system from within the browser context, and bitcoin mining. This talk will demonstrate how various forms of these attacks succeed and what web developers can do to prevent them using input validation, Content Security Policy (CSP), and the Trusted Types experimental API.","tags":"cross-site scripting, xss, content security policy, trusted types, secure web development, software security","level":"Beginner","starts_at":"2019-08-23T15:45:00.000Z","ends_at":"2019-08-23T16:25:00.000Z","created_at":"2019-06-08T02:03:26.649Z","updated_at":"2019-07-29T00:12:40.116Z","room":"306/307","presenter":{"name":"Robert C. Seacord","bio":"Robert C. Seacord is a Technical Director at NCC Group and works with software developers and software development organizations to eliminate vulnerabilities resulting from coding errors before they are deployed. Previously, Seacord led the secure coding initiative in the CERT Division of Carnegie Mellon University’s Software Engineering Institute (SEI). Seacord is also an adjunct professor in the School of Computer Science and the Information Networking Institute at Carnegie Mellon University. Seacord is the author of six books, including The CERT C Coding Standard, Second Edition (Addison-Wesley, 2014) Secure Coding in C and C++, Second Edition (Addison-Wesley, 2013), and Java Coding Guidelines: 75 Recommendations for Reliable and Secure Programs (Addison-Wesley, 2014). Seacord is on the Advisory Board for the Linux Foundation and an expert on the ISO/IEC JTC1/SC22/WG14 international standardization working group for the C programming language."},"url":"https://codeandsupply.co/event_sessions/142.json"},{"id":29,"title":"Innovating Security in Innovative Organizations","body":"Do you need to secure your leading technology product and business? Are\r\nyou struggling with aligning your security program to agile and devops?\r\nOrganizations can be compliant and secure while remaining innovative.\r\nThis presentation explores innovative processes and practices for\r\nevolving traditional security controls. With these techniques, you can\r\nsecurely enable the speed of change needed to disrupt in today's market\r\nplace. Warner will explore alternative methods using real world examples\r\nfor addressing security controls such as separation of duties, change\r\ncontrol, and release management using automation and modern practices.","tags":"security, devsecops, infosec, devops, innovation, grc","level":"Advanced","starts_at":"2019-08-23T16:40:00.000Z","ends_at":"2019-08-23T17:20:00.000Z","created_at":"2019-06-08T02:03:24.961Z","updated_at":"2019-07-26T02:25:47.733Z","room":"303/304","presenter":{"name":"Warner Moore","bio":"Warner Moore is a strategic technology leader and manager with a background in web operations and information security. He has focused his career in working with entrepreneurial growth organizations where technology is their business and product. Within these organizations, Warner has an accomplished record of building successful cybersecurity programs and high performing technology teams who embrace DevOps culture and practices.  \r\n\r\nAs an international speaker, Warner has been invited to present to university students, technology professionals, and business leaders in a classroom setting as well as at conferences such as Startup Week, CloudDevelop, Path to Agility,  InfoSec Summit, CodeMash, Security BSides, and DevOpsDays.\r\n\r\nWarner is passionate about culture, innovation, and community. His passion reflects in his non-profit work with organizations such as Ohio LinuxFest, LOPSA, DevOpsDays, and Toastmasters. Recently, he founded a strategy consulting company that provides virtual CISO, CIO, and CTO services. Additionally, Warner advises and helps build startups.\r\n"},"url":"https://codeandsupply.co/event_sessions/29.json"},{"id":91,"title":"Using AI to Build More Secure Software","body":"MITRE's growing Common Vulnerabilities and Exposures (CVE) list -- nearly 150,000 and growing -- is testament that building software that is resistant and resilient to attack remains difficult. The introduction of SecDevOps looks to improve security of software but has not taken advantage of how artificial intelligence could be used to improve the security of software. This presentation will discuss why the construction of secure software is a concern beyond the IT industry, the elements of a secure software development process and how artificial intelligence could be applied to improve that process. The discussion will then consider additional security issues facing the construction of artificial intelligence software.","tags":"","level":"Advanced","starts_at":"2019-08-23T16:40:00.000Z","ends_at":"2019-08-23T17:20:00.000Z","created_at":"2019-06-08T02:03:25.848Z","updated_at":"2019-07-26T02:25:47.746Z","room":"305","presenter":{"name":"Mark Sherman","bio":"Dr. Mark Sherman is the Technical Director of the Cyber Security Foundations group at CERT within CMU’s Software Engineering Institute. His team focuses on foundational research on the life cycle for building secure software and on data analytics in cyber security. Before coming to CERT, Dr. Sherman was at IBM and various startups, working on mobile systems, integrated hardware-software appliances, transaction processing, languages and compilers, virtualization, network protocols and databases. Dr. Sherman received his undergraduate degrees from MIT and his PhD in Computer Science from CMU. He has published over 50 papers and several books on various topics in computer science."},"url":"https://codeandsupply.co/event_sessions/91.json"},{"id":132,"title":"The Differences and Benefits of Teaching High School Comp Sci","body":"How did you learn to code? Chances are it was not in high school. Only 35% of high schools teach computer science in the country. Yet computing jobs are the number one source of new wages, and the US has roughly 500,000 open positions. So how we can help solve this problem?\r\n\r\nTEALS is one organization dedicated to bringing Computer Science to every high school. They connect tech professionals to high schools in need, who assist in CS education. But teaching in a high school environment is different than mentoring a junior engineer. \r\n\r\nThis talk will dive into how you can volunteer, learn to teach, and teach to learn. As a bonus, we will also discuss how students can learn source control, and share their work with the world.\r\n","tags":"education, teaching, mentoring, computer science, diversity, communication","level":"Beginner","starts_at":"2019-08-23T16:40:00.000Z","ends_at":"2019-08-23T17:20:00.000Z","created_at":"2019-06-08T02:03:26.479Z","updated_at":"2019-07-26T02:25:47.740Z","room":"306/307","presenter":{"name":"Zackary Whipkey","bio":"Zack Whipkey is a software developer currently residing in Austin, TX. He lived in Pennsylvania for 25 years, and Pittsburgh for three years. As a TEALS volunteer this past year, he has been stationed an Austin High School in an AP Computer Science class.  He has worked across many stacks of software, industries, and has particular interests in education and security. You can read more about him at his blog: \r\n\r\nhttps://zdware.com/"},"url":"https://codeandsupply.co/event_sessions/132.json"},{"id":72,"title":"Beyond the Sunset: How to Wring the Maximum Joy from Your Last 10 Years in Tech","body":"You’ve survived the internship, the seven year itch to switch careers, the mid-career management vs tech decision, and also mainframes, the Y2K panic, the dot-com boom, the Great Recession, the Java vs C++ wars, the birth of CSS and React/Redux, and that weird thing with bitcoin. It’s time to start thinking about retirement. \r\n\r\nBut first, you need to think about how to enjoy your last 10 years or so in the tech industry. In this talk, I will lay out why this is the best phase of your career (because it really is), how to enjoy it as much as possible, and why you need to make a plan for what comes after.","tags":"","level":"Beginner","starts_at":"2019-08-23T17:35:00.000Z","ends_at":"2019-08-23T18:15:00.000Z","created_at":"2019-06-08T02:03:25.562Z","updated_at":"2019-07-26T02:25:47.752Z","room":"301/302","presenter":{"name":"Vanessa Kristoff","bio":"Vanessa Kristoff has been a software engineer since the 1980s, and attributes her longevity in the industry to the fact that she prioritizes having fun at work. "},"url":"https://codeandsupply.co/event_sessions/72.json"},{"id":128,"title":"Using Ansible and Terraform to Avoid Cloud Lock-In","body":"One of the main pitfalls of moving to the cloud is locking yourself in to a particular provider.  Tools like CloudFormation can rapidly provision environments for your applications but make moving your infrastructure to a a different provider or your own infrastructure a complex process.  Come hear about using Open Source automation tooling to make your workloads easily portable across both public and private clouds with a minimum of reconfiguration.  The demo will focus using Ansible and Terraform to deploy to both AWS and VMware vCloud Director environments but the best practices discussed will apply to just about any combination of tooling and infrastructure that makes sense for your application. ","tags":"automation, aws, vmware, ansible, terraform, vcloud director","level":"Advanced","starts_at":"2019-08-23T17:35:00.000Z","ends_at":"2019-08-23T18:15:00.000Z","created_at":"2019-06-08T02:03:26.411Z","updated_at":"2019-07-26T02:25:47.759Z","room":"303/304","presenter":{"name":"Mike Garuccio","bio":"I am a product development engineer working for Expedient (https://www.expedient.com/) with a focus on our automated infrastructure management and Kubernetes products.  "},"url":"https://codeandsupply.co/event_sessions/128.json"},{"id":89,"title":"I'm Not Perfect (And I Know I Never Will Be)","body":"When I transitioned into a tech lead role for the first time, I was terrified of the fact that I was expected to not be perfect from the beginning. Instead of trying to prevent the inevitable mistakes I would make, I had to change my perspective to focus on what I could control. In this talk, I’ll share concrete examples of how I lowered my anxiety around messing up in my new role and turned my blunders into learning opportunities.","tags":"leadership, development, process","level":"Beginner","starts_at":"2019-08-23T17:35:00.000Z","ends_at":"2019-08-23T18:15:00.000Z","created_at":"2019-06-08T02:03:25.821Z","updated_at":"2019-07-26T02:25:47.793Z","room":"305","presenter":{"name":"Sharell Bryant","bio":"Sharell Bryant is a senior software engineer at Teachers Pay Teachers, an educational marketplace used by more than 2 out of 3 educators in the US. At TpT, Sharell is the tech lead of the Web Platform team helping support product engineering on the frontend. Outside of the office, you can find her out for a run in the park or playing guitar at an open mic."},"url":"https://codeandsupply.co/event_sessions/89.json"},{"id":6,"title":"Mind the Gap: Closing the Digital Divide in America","body":"According to the FCC, in Detroit - my hometown - 40 percent of residents do not have internet access of any kind at home, while 57 percent rely on their smartphones to get online. This is not exclusive to Detroit. Major cities across America like Miami, FL, Dallas, TX, Milwaukee, WI and Newark, NJ all have a population of 40 percent or more that does not have fixed broadband internet access at home. \r\n\r\nWhat challenges do people without Internet access face? What limitations do people with mobile-only Internet access encounter? As technology (and our relationship with it) continues to evolve, how can we better serve those who fall into the gaps of the Digital Divide?\r\n\r\nIn this talk, I will discuss some of the grassroots efforts in Detroit which seek to address the yawning chasm that separates those who can readily access technology and information from those who cannot. I will draw on my experiences working with nonprofit tech education organizations and programs. Together, we will see what this divide looks like and how we can help close this gap.\r\n","tags":"tech literacy, digital divide, accessibility","level":"Beginner","starts_at":"2019-08-23T17:35:00.000Z","ends_at":"2019-08-23T18:15:00.000Z","created_at":"2019-06-08T02:03:24.569Z","updated_at":"2019-07-26T02:25:47.786Z","room":"306/307","presenter":{"name":"Stephanie Vaughn","bio":"After being adopted by Chicago for 14 years, Stephanie hit 'RESET' and returned to her hometown of Detroit in 2015 to reboot her writing ambitions into a tech career. This bold move has since yielded a foray into Computer Science education and working closely with nationally recognized groups like Black Girls Code. With over a decade of experience in media-focused Communications, the Grand Circus (Javascript, '16) and Integrate Detroit (Software Development, ‘18) alumna is always looking to share her passion for the T in “STEM” with developers \u0026 non-developers alike."},"url":"https://codeandsupply.co/event_sessions/6.json"},{"id":157,"title":"Oops–I guess we're full-stack developers now","body":"A few years ago we were front-end developers. These days, as the tools we use to build the web are getting better, easier, and more powerful, we've suddenly become full-stack developers. Let's take a look at what happened and how we can take full advantage of our new super powers.","tags":"","level":"","starts_at":"2019-08-23T17:35:00.000Z","ends_at":"2019-08-23T18:15:00.000Z","created_at":"2019-06-11T00:22:42.073Z","updated_at":"2019-07-26T02:25:47.765Z","room":"401/402","presenter":{"name":"Chris Coyier"},"url":"https://codeandsupply.co/event_sessions/157.json"},{"id":103,"title":"Artistic Style Transfer with Convolutional Neural Networks","body":"Style transfer is a technique for creating computer-generated art that powers apps like Prisma. It repurposes neural networks to combine famous paintings and photos to produce pastiches that mimic the artistic style. \r\n\r\nIn this talk, we’ll take a look at the ideas behind this surprisingly simple algorithm and introduce fundamental Machine Learning and Deep Learning concepts along the way. Topics will include:\r\n\r\n• A high-level introduction to neural networks and deep convolutional nets for Computer Vision.\r\n• An overview of the original style transfer algorithm and related concepts like optimization.\r\n• A review of new ‘fast’ architectures for running style transfer in real-time.\r\n• Resources for learning more about ML/DL and Computer Vision.","tags":"machine learning, deep learning, computer vision, computer-generated art","level":"Advanced","starts_at":"2019-08-23T17:35:00.000Z","ends_at":"2019-08-23T18:15:00.000Z","created_at":"2019-06-08T02:03:26.029Z","updated_at":"2019-08-01T18:39:08.765Z","room":"403/404","presenter":{"name":"Evan Davis","bio":""},"url":"https://codeandsupply.co/event_sessions/103.json"},{"id":41,"title":"Unit Testing in Sass","body":"Remember that time someone on your team removed some questionable Sass, only to result in a broken UI? If this scenario sounds familiar, then Sass unit testing is for you! In this session, you’ll learn how unit testing is applied to Sass, how it can benefit your large project, and how to set it up in your own codebase. General takeaways will also include unit testing best practices and how to determine if your project is a good candidate for Sass unit testing. Lindsey will share her experience of unit testing an enterprise-level design system and how it has prevented unexpected UI changes. \r\n\r\nConsider this session if:\r\n- You work on large projects heavily relying on a consistent UI, such as a design system\r\n- You are passionate about code quality and testing\r\n- You’ve worked with unit testing before and you’re curious to know how it could translate into a styling language\r\n","tags":"unit testing, css, scss, sass, software quality","level":"Advanced","starts_at":"2019-08-23T17:35:00.000Z","ends_at":"2019-08-23T18:15:00.000Z","created_at":"2019-06-08T02:03:25.124Z","updated_at":"2019-07-30T19:30:43.371Z","room":"406","presenter":{"name":"Lindsey Wild","bio":"Lindsey Wild is a full-stack developer at Sparkbox’s Pittsburgh office. She’s worked on projects including an enterprise-level design system, various e-commerce websites, and dynamic web applications. She’s held developer positions for companies including DICK’S Sporting Goods and Giant Eagle and has more than six years of front-end development experience. In her free time, you can catch her on the volleyball court, watching a rock concert, or cheering on the Cleveland Indians."},"url":"https://codeandsupply.co/event_sessions/41.json"},{"id":64,"title":"UX Tools for Developers","body":" User experience and design are often hard problems for developers. We focus on code and hopefully someone else will make sure it looks good and users enjoy using it. That’s because user experience requires a different set of tools and thought processes. Sometimes, however, we do not have the luxury of a design team on every project. Add some of these tools to your toolbox so that every product you work on from this point forward has the extra edge. Regardless of if you are building an AR/VR, ML, or Mobile/Web app, this talk will help you to:\r\n\r\n* Perform User Research\r\n* Use sketching sessions \r\n* Affinity diagramming\r\n* Design Information Architecture\r\n* Create Valuable Personas\r\n* Create User Journeys and Story Mapping\r\n* Usability Testing\r\n* Define Minimum Marketable Product","tags":"user experience, personas, user research, sketching, mvp","level":"Beginner","starts_at":"2019-08-23T18:30:00.000Z","ends_at":"2019-08-23T19:10:00.000Z","created_at":"2019-06-08T02:03:25.446Z","updated_at":"2019-07-29T00:12:39.615Z","room":"301/302","presenter":{"name":"Heather Shockney","bio":"Software development lead and team builder with experience in many languages, frameworks, and development processes. Project delivery using Ruby, Java, JavaScript, Swift, PHP, HTML, CSS, and SQL deployed to cloud environments including server-less. \r\n\r\nManaged and mentored team consisting of twelve full stack developers in a continuous learning organization. For the past two years, I have worked remotely for teams and clients located throughout the United States. \r\n\r\nLed front end portfolio delivery at Mined Minds, a software consultancy. Used UXD training and development experience to bring user research, persona building, affinity mapping, sketching, MVP defining, as well as frontend development coding skills to both consultancy and training organizations.\r\n\r\nIn my spare time, I love taking photos, kayaking,  and scary movies."},"url":"https://codeandsupply.co/event_sessions/64.json"},{"id":76,"title":"How Live Coding Changed My Life","body":"I have been live coding nearly every weekday for over a year for freeCodeCamp. It has changed my live. My fear of others seeing my code is gone. My skills as a dev have increased at a remarkable rate. Most importantly and unexpectedly, a caring and helpful community has developed.\r\n\r\nHow do you get over a fear of others seeing your code? Start live coding on YouTube of course!\r\n\r\nFollow me on my journey from being a solo dev who was afraid of showing my code to anyone to live coding on a YouTube channel of nearly 300k subscribers. Along the way my skills improved dramatically. An amazing community of developers of all ages, locations, and skill levels has grown around the live streams. Live coding has changed my live as a developer and as a person, and I think anyone can enjoy the benefits of live coding.","tags":"live coding, community building, learning, professional development","level":"Beginner","starts_at":"2019-08-23T18:30:00.000Z","ends_at":"2019-08-23T19:10:00.000Z","created_at":"2019-06-08T02:03:25.635Z","updated_at":"2019-07-26T02:25:47.807Z","room":"303/304","presenter":{"name":"Jesse Raymond Weigel"},"url":"https://codeandsupply.co/event_sessions/76.json"},{"id":120,"title":"Bringing Order to Chaos: Incident Management and Your Organization","body":"How well did you handle your company's last major system outage or service degradation? What did you do when you discovered an internal system or process was broken and you needed to fix it ASAP? If your company is like most, episodes like these trigger organizational panic and uncertainty about the best response. This is why you need organized incident management.\r\n\r\nIn this talk, you'll learn why Incident Management should be part of every organization's framework for handling emergent issues of all kinds. You'll walk away with a solid understanding of how you can approach your company's next technology or business crisis in a more productive and time-efficient way. Fundamentally, you'll learn the process for dealing with challenges for which there is no process.","tags":"incident management, operations, leadership, trust","level":"Advanced","starts_at":"2019-08-23T18:30:00.000Z","ends_at":"2019-08-23T19:10:00.000Z","created_at":"2019-06-08T02:03:26.278Z","updated_at":"2019-07-26T02:25:47.839Z","room":"305","presenter":{"name":"Joshua Kaderlan","bio":"Josh Kaderlan has worked in a wide variety of organizations and roles, from startups to Fortune 500 companies. He has more than 20 years of industry experience and calls the Bay Area home."},"url":"https://codeandsupply.co/event_sessions/120.json"},{"id":117,"title":"The Four Components of High-Performing Teams","body":"Do you have a great team \u0026 a great mission but don't understand why the pace of delivery is so slow? Architecture \u0026 tech stack is only one part of the story.\r\nI believe high performing teams need four things to be effective:\r\nMastery - The skills \u0026 knowledge needed to do a great job, and a clear path to get to the next level.\r\nAutonomy - The space to figure out their own solution to a problem \u0026 how they want to work\r\nPurpose - A clear sense of direction, and the knowledge of how what they’re working on fits into the big picture \u0026 helps their team succeed.\r\nSafety - A team that is afraid won’t take risks or experiment, a team that is afraid of finger-pointing won’t learn from mistakes.\r\nIn this talk I’ll explain why those four things are key to teams being successful and give examples of how I’ve turned teams around by fixing the lack of one or more of them.\r\n","tags":"high performing teams, management, leadership","level":"Advanced","starts_at":"2019-08-23T18:30:00.000Z","ends_at":"2019-08-23T19:10:00.000Z","created_at":"2019-06-08T02:03:26.232Z","updated_at":"2019-07-27T19:14:32.099Z","room":"306/307","presenter":{"name":"Lisa van Gelder","bio":"Lisa has been in software for over 19 years, working in a wide range of companies from early stage startups to large media companies like the BBC \u0026 the Guardian newspaper. She used to debug code, now she debugs teams for a living. Lisa is currently VP, Engineering at Meetup. She is mostly powered by coffee.\r\n"},"url":"https://codeandsupply.co/event_sessions/117.json"},{"id":60,"title":"You're Better at CSS Than You Think","body":"A few months ago in a spontaneous research project, I decided to scrape the top 10,000 most visited websites on the internet to look at their CSS.\r\n\r\nThis talk is a breakdown of what I found (spoiler - not all of it was good).\r\n\r\nThis is for all the developers who have ever said \"I'm (adverb) bad at CSS\", thought it, or heard someone else say it. What does it mean to be \"good at CSS\"? When is 'float' a good idea, or is it? How much should browsers dictate what we can use?\r\n\r\nLet's find out!","tags":"css, scss, sass, js, responsive, best practices","level":"Beginner","starts_at":"2019-08-23T18:30:00.000Z","ends_at":"2019-08-23T19:10:00.000Z","created_at":"2019-06-08T02:03:25.386Z","updated_at":"2019-07-29T02:19:05.853Z","room":"401/402","presenter":{"name":"Thomas Golden","bio":"Tom Golden is a software engineer who works for Hatched Labs in San Francisco.\r\n\r\nHe moved from England to Silicon Valley three years ago with a degree in Discrete Mathematics, where he has worked for some hot start-ups, including Shipt where he was hired to be their first web developer.\r\n\r\nHe has a profound affection for all things CSS and design.\r\n"},"url":"https://codeandsupply.co/event_sessions/60.json"},{"id":44,"title":"Taking Our JavaScript SDK Offline","body":"Every day at Findaway, AudioEngine delivers millions of hours of audiobooks to listeners all over the world. We work with all the top players in the industry, including Audible, Apple, Google, Kobo, Scribd, and more. Our SDK helps dozens of apps deliver audiobooks to millions of listeners. But what if they don’t have an internet connection? Our native mobile apps allow for offline playback, why not our Javascript SDK too? Learn how we used modern browser capabilities to enable offline web playback into the AudioEngine Javascript SDK.","tags":"front-end, javascript, audiobooks, offline","level":"Advanced","starts_at":"2019-08-23T18:30:00.000Z","ends_at":"2019-08-23T19:10:00.000Z","created_at":"2019-06-08T02:03:25.161Z","updated_at":"2019-07-29T00:12:39.554Z","room":"403/404","presenter":{"name":"Cameron Wardzala","bio":"Cameron Wardzala is a web developer at Findaway, with nearly 20 years of experience in front-end development. He has developed sites for brands like HH Gregg, I Can Has Cheezburger, and Vonage. For the past 5 years, he's focused on building audiobook technology for Findaway, including an e-commerce platform, an audiobook delivery SDK, and countless internal tools. He has spoken at local meetups and larger conferences in and around Ohio."},"url":"https://codeandsupply.co/event_sessions/44.json"},{"id":32,"title":"Conway's Law in Practice: Lessons Learned Building a Distributed Storage System and Team","body":"Conway's Law states: Any organization that designs a system (defined broadly) will produce a design whose structure is a copy of the organization's communication structure.\r\n\r\nWith Conway's Law in hand, what should the team structure be for an open source project, aiming to build the world's largest decentralized cloud object storage system? \r\n\r\nThis talk will take the audience through the engineering, communication and leadership lessons learned while growing a geographically distributed, diverse, engineering team. The goal of this talk is to provide everyone, regardless of their team structure, practical advice on how they can utilize Conway's law to improve communication and efficiency in their organization. ","tags":"engineering leadership, hiring, communication, distributed systems, decentralization","level":"Beginner","starts_at":"2019-08-23T18:30:00.000Z","ends_at":"2019-08-23T19:10:00.000Z","created_at":"2019-06-08T02:03:25.005Z","updated_at":"2019-07-26T02:25:47.826Z","room":"406","presenter":{"name":"Dennis Coyle"},"url":"https://codeandsupply.co/event_sessions/32.json"},{"id":59,"title":"Code a Synth in 5 Lines (Of Your Code)","body":"Inspired by XKCD's \"import antigravity\", this talk aims to make programming \"fun again\" by leveraging Python and a handful of libraries to make a programmable synthesizer in an incredibly small amount of code.\r\n\r\nFrom scratch, we'll explore the basics of digital audio synthesis, dive into NumPy's \"broadcasting\" features, and find ways to make our computers make really weird noises, with an emphasis on how very simple, clear code can lead to surprisingly complex results.\r\n\r\nCover image uses assets from: By Chrisjohnson, CC BY-SA 3.0, https://commons.wikimedia.org/w/index.php?curid=23282431","tags":"music,python,generative art,how to","level":"Beginner","starts_at":"2019-08-23T19:25:00.000Z","ends_at":"2019-08-23T20:05:00.000Z","created_at":"2019-06-08T02:03:25.371Z","updated_at":"2019-07-26T16:18:55.183Z","room":"301/302","presenter":{"name":"Remy Porter","bio":"Remy Porter is a \"creative coder\" who mainly works on large-scale art installations, mixing digital technology with sculpture. As the Editor-in-Chief at TheDailyWTF.com, he's an expert in what makes bad code and bad workplaces, and writing articles about them. In addition to writing, Remy dabbles in film, theater, improvised comedy, and music, and is passionate about combining all of those interests into a single process."},"url":"https://codeandsupply.co/event_sessions/59.json"},{"id":96,"title":"Debugging Our Feelings: Cognitive Behavioural Therapy for Developers","body":"Developers have countless frameworks and tools to tackle technical problems but what can we use when we face personal ones? This talk is an introduction to cognitive behavioural therapy, which provides practical techniques to help change how we feel by changing how we think.\r\n\r\nThrough simple programming analogies, you'll learn:\r\n\r\n1) What cognitive behavioural therapy (CBT) is\r\n2) Why the model it offers fits so well with our developer mindset\r\n3) How CBT can be applied to help deal with challenges like procrastination, perfectionism, impostor syndrome, and handling criticism\r\n4) How to turn a piece of paper into a powerful debugger for our thoughts","tags":"mental health, self-care, cognitive behavioural therapy, procrastination, perfectionism, impostor syndrome","level":"Beginner","starts_at":"2019-08-23T19:25:00.000Z","ends_at":"2019-08-23T20:05:00.000Z","created_at":"2019-06-08T02:03:25.927Z","updated_at":"2019-07-26T02:25:47.854Z","room":"303/304","presenter":{"name":"Jamie Strachan","bio":"Jamie currently manages a team of developers at Loopio after spending 15 years as a web developer himself. He's (mostly) traded in coding for coaching and strives to help the developers around him be as effective as possible by being a facilitator, an advocate, and an advisor. He also shares his experience with depression to help combat the stigma surrounding mental health issues."},"url":"https://codeandsupply.co/event_sessions/96.json"},{"id":134,"title":"Evolving Ingress/v1beta1","body":"The Ingress object was added to Kubernetes in version 1.2 to describe properties of a cluster-wide reverse HTTP proxy. Since that time, it has not progressed beyond the beta stage, and its stagnation inspired an explosion of annotations to express missing properties of HTTP routing. \r\n\r\nIn order to support a real-world ingress platform, a new Ingress CRD, named IngressRoute, aims to solve these missing properties as well as support multi-team clusters with the ability to limit the management of routes to specific virtual hosts. This delegation pattern allows for powerful ingress traffic manipulation across teams and reduces errors due to bad configuration.\r\n\r\nCome see how a fresh perspective to ingress traffic can allow your teams to self-manage their application connectivity; as well as have a fully featured API spec to code against.\r\n","tags":"kubernetes, devops, application deployments","level":"Advanced","starts_at":"2019-08-23T19:25:00.000Z","ends_at":"2019-08-23T20:05:00.000Z","created_at":"2019-06-08T02:03:26.511Z","updated_at":"2019-07-29T00:12:39.856Z","room":"306/307","presenter":{"name":"Steve Sloka","bio":"Steve Sloka is a Sr. Member of Technical Staff from Pittsburgh, PA currently working at VMware dealing with all things Cloud, Containers, and Kubernetes. Steve is a maintainer of Contour, Gimbal, the Elasticsearch Operator and is a contributor to many other open source projects. Steve is also a Kubernetes contributor and has been working with it since early 2015.\r\n"},"url":"https://codeandsupply.co/event_sessions/134.json"},{"id":66,"title":"Introduction to Face Processing with Computer Vision","body":"Ever wonder how Facebook’s facial recognition or Snapchat’s filters work?\r\n\r\nFaces are a fundamental piece of photography, and building applications around them has never been easier with open-source libraries and pre-trained models.\r\n\r\nIn this talk, we’ll help you understand some of the computer vision and machine learning techniques behind these applications. Then, we’ll use this knowledge to develop our own prototypes to tackle tasks such as face detection (e.g. digital cameras), recognition (e.g. Facebook Photos), classification (e.g. identifying emotions), manipulation (e.g. Snapchat filters), and more.\r\n","tags":"artificial intelligence, data science, machine learning, computer vision, python, facial recognition, face processing","level":"Beginner","starts_at":"2019-08-23T19:25:00.000Z","ends_at":"2019-08-23T20:05:00.000Z","created_at":"2019-06-08T02:03:25.475Z","updated_at":"2019-07-26T02:25:47.861Z","room":"401/402","presenter":{"name":"Gabriel Bianconi","bio":"Gabriel is the founder of Scalar Research, a full-service artificial intelligence \u0026 data science consulting firm. Scalar helps companies tackle complex business challenges with data-driven solutions leveraging cutting-edge machine learning and advanced analytics.\r\n\r\nPreviously, Gabriel was a B.S. \u0026 M.S. student in computer science at Stanford, where he conducted research on computer vision, deep learning, and quantum computing. He's also spent time at Google, Facebook, startups, and investment firms.\r\n"},"url":"https://codeandsupply.co/event_sessions/66.json"},{"id":153,"title":"Humane Design Patterns","body":"The rapid growth of mobile technology has ushered in an age where time and attention is an increasingly scarce resource. Instead of technology enhancing our abilities as humans, we’ve seen it become a vehicle for extracting our attention, monetizing our personal information, and exploiting our psychological vulnerabilities. Designers and developers play a key role in the creation of such technology, and it’s time we take responsibility for the impact that these products and services we build are having on people it should serve.\r\n\r\nIn this session we’ll explore some common extractive design patterns in addition to alternatives that focus on user well-being instead. These patterns will be framed through the lens of guiding principles to follow when designing ethically humane products and services.","tags":"UX, Design Patterns, Ethics","level":"Beginner","starts_at":"2019-08-23T19:25:00.000Z","ends_at":"2019-08-23T20:05:00.000Z","created_at":"2019-06-11T00:18:18.900Z","updated_at":"2019-08-01T17:00:25.757Z","room":"403/404","presenter":{"name":"Jon Yablonski"},"url":"https://codeandsupply.co/event_sessions/153.json"},{"id":167,"title":"Closing Keynote","body":"","tags":"","level":"","starts_at":"2019-08-23T20:20:00.000Z","ends_at":"2019-08-23T21:00:00.000Z","created_at":"2019-07-27T04:04:17.951Z","updated_at":"2019-07-27T04:09:02.592Z","room":"Ballroom I/II/III","presenter":{"name":"Abstractions"},"url":"https://codeandsupply.co/event_sessions/167.json"},{"id":168,"title":"Departing High Fives","body":"","tags":"","level":"","starts_at":"2019-08-23T21:00:00.000Z","ends_at":"2019-08-23T21:15:00.000Z","created_at":"2019-07-27T04:07:42.723Z","updated_at":"2019-07-27T04:07:42.723Z","room":"Ballroom I/II/III","presenter":{"name":"Abstractions"},"url":"https://codeandsupply.co/event_sessions/168.json"}]